akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
#include <ctype.h>
#include <errno.h>
#include <fcntl.h>
#include <netdb.h>
#include <stdarg.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <sys/select.h>
#include <sys/param.h>
#include <sys/socket.h>
#include <strings.h>
#include <string.h>
#include <time.h>
#include <unistd.h>

#include "sdkconfig.h"
#include "bsp/esp32_s3_touch_amoled_2_06.h"
#include "cJSON.h"
#include "esp_err.h"
#include "esp_event.h"
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
#include "esp_crt_bundle.h"
#endif
#include "esp_codec_dev.h"
#include "esp_heap_caps.h"
#include "esp_http_client.h"
#include "esp_http_server.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_netif.h"
#include "esp_heap_caps.h"
#include "esp_sntp.h"
#include "esp_sleep.h"
#include "esp_system.h"
#include "esp_timer.h"
#include "esp_tls.h"
#include "esp_transport.h"
#include "esp_wifi.h"
#if CONFIG_BT_ENABLED
#include "esp_bt.h"
#endif
#include "freertos/FreeRTOS.h"
#if CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM
#include "freertos/idf_additions.h"
#endif
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "driver/gpio.h"
#include "driver/rtc_io.h"
#include "driver/i2c_master.h"
#include "lvgl.h"
#include "src/display/lv_display.h"
#include "src/draw/lv_draw_buf.h"
#include "src/draw/snapshot/lv_snapshot.h"
#include "src/draw/lv_draw_line.h"
#include "nvs.h"
#include "nvs_flash.h"

LV_FONT_DECLARE(watch_ai_cn_24);
#define AI_DIALOG_FONT (&watch_ai_cn_24)
#define AI_TEXT_FILTER_FONT (&watch_ai_cn_24)
#define AI_BUTTON_FONT (&watch_ai_cn_24)

#define TAG "watch_lite"

static bool s_ai_text_filter_enabled;

#define APP_NS "watch_lite"
#define CONFIG_MAGIC 0x574C5431u
#define CONFIG_VERSION 5u

#define AP_PASSWORD "12345678"
#define DEFAULT_VOICE_GATEWAY_URL "http://127.0.0.1:8790"
#define DEFAULT_API_URL "https://ai.orbitlink.me/v1"
#define DEFAULT_MODEL "gpt-5.4"
#define AI_PROFILE_COUNT 6
#define AI_PROFILE_CUSTOM_INDEX 5
#define AI_PROFILE_MAGIC 0x41495031u
#define AI_PROFILE_VERSION 1u
#define DEFAULT_MARKET_PROVIDER "coingecko"
#define DEFAULT_STARTER_PROMPT "用中文简短回复：手表 AI 聊天已经启动，请问我可以帮你什么？"
#define DEFAULT_AUTO_SLEEP_S 45
#define MAX_AUTO_SLEEP_S 86400
#define DEFAULT_BRIGHTNESS_PERCENT 35
#define DEFAULT_MOTION_WAKE_ENABLED 0
#define DEFAULT_MOTION_WAKE_THRESHOLD_MG 2000
#define HTTP_PROXY_FEATURE_ENABLED 0
#define MIN_MOTION_WAKE_THRESHOLD_MG 600
#define MAX_MOTION_WAKE_THRESHOLD_MG 6000
#define DEEP_SLEEP_ENABLED 1
#define DEEP_SLEEP_AUTO_ENTER 0
// Light sleep wakes from BOOT, but the touch I2C driver aborts after resume on this board.
#define BUTTON_LIGHT_SLEEP_ENABLED 0
#define AUTO_POWEROFF_ON_SLEEP 1
#define DEEP_SLEEP_AFTER_SCREEN_OFF_S 15
#define AI_SCREEN_MIN_AUTO_SLEEP_S 180
#define DEEP_SLEEP_BOOT_BUTTON_GPIO GPIO_NUM_0
#define DEEP_SLEEP_POWER_BUTTON_GPIO GPIO_NUM_10
#define BOOT_LONG_PRESS_CONFIG_AP_MS 2000
#define BUSY_SLEEP_FORCE_RESET_MS 90000
#define MARKET_BUSY_STALE_MS 65000
#define CHART_BUSY_STALE_MS 65000
#define TTS_BUSY_STALE_MS 90000

#define MARKET_WAIT_INTERVAL_MS 2000
#define DIRECT_HTTP_TIMEOUT_MS 12000
#define DIRECT_AI_TIMEOUT_MS 35000
#define DIRECT_HTTP_MAX_BODY 12288
#define VOICE_AI_TIMEOUT_MS 180000
#define VOICE_GATEWAY_TIMEOUT_MS 45000
#define VOICE_AUDIO_TIMEOUT_MS 30000
#define VOICE_NET_LOCK_WAIT_MS 8000
#define VOICE_STALE_RESET_MS 65000
#define VOICE_SAMPLE_RATE 22050
#define VOICE_CHANNELS 1
#define VOICE_CAPTURE_CHANNELS 1
#define VOICE_BITS_PER_SAMPLE 16
#define VOICE_MIC_GAIN_DB 36.0f
#define VOICE_MAX_SECONDS 7
#define VOICE_MIN_RECORD_MS 700
#define VOICE_MAX_IDLE_MS 1000
#define VOICE_SILENCE_MS 600
#define VOICE_WARMUP_DISCARD_MS 100
#define VOICE_SPEECH_THRESHOLD 380
#define VOICE_FORCE_SPEECH_THRESHOLD 900
#define VOICE_NOISE_CALIBRATE_MS 400
#define VOICE_SPEECH_START_CHUNKS 2
#define VOICE_ENERGY_LOG_MS 500
#define VOICE_READ_CHUNK_BYTES 4096
#define VOICE_MAX_AUDIO_BYTES (2 * 1024 * 1024)
#define VOICE_AUDIO_GROW_STEP (16 * 1024)
#define VOICE_PLAY_VOLUME 75
#define VOICE_TASK_STACK_BYTES (20 * 1024)
#define VOICE_TASK_FALLBACK_STACK_BYTES (12 * 1024)
#define VOICE_TTS_TASK_STACK_BYTES (16 * 1024)
#define VOICE_TTS_TASK_FALLBACK_STACK_BYTES (10 * 1024)
#define VOICE_KEEP_STA_CONNECTED 0
#define VOICE_TRY_COMBINED_GATEWAY 1
#define SETUP_PAGE_MAX 24000
#define COINGECKO_MARKET_URL "https://api.coingecko.com/api/v3/simple/price?ids=bitcoin,ethereum&vs_currencies=usd&include_24hr_change=true"
#define GATE_TICKER_URL_FMT "https://api.gateio.ws/api/v4/spot/tickers?currency_pair=%s_USDT"
#define HUOBI_TICKER_URL_FMT "https://api.huobi.pro/market/detail/merged?symbol=%susdt"
#define BINANCE_TICKER_URL_FMT "https://api.binance.com/api/v3/ticker/24hr?symbol=%sUSDT"
#define EASTMONEY_HOME_URL "https://push2delay.eastmoney.com/api/qt/ulist.np/get?fltt=2&invt=2&fields=f12,f14,f2,f3,f4,f18,f152&secids=1.000001,100.HSI,100.N225,100.GDAXI,100.FTSE,100.SPX,100.NDX100,101.GC00Y,102.CL00Y,100.UDI,133.USDCNH,119.EURUSD"
#define EASTMONEY_QUOTE_URL_FMT "https://push2delay.eastmoney.com/api/qt/ulist.np/get?fltt=2&invt=2&fields=f12,f14,f2,f3,f4,f18,f152&secids=%s"
#define SINA_VIX_URL "https://hq.sinajs.cn/list=b_VIX"
#define STOOQ_QUOTE_URL_FMT "https://stooq.com/q/l/?s=%s&f=sd2t2ohlcv&h&e=csv"
#define YAHOO_CHART_URL_FMT "https://query1.finance.yahoo.com/v8/finance/chart/%s?range=1d&interval=30m"
#define WIFI_CONNECT_WAIT_MS 15000
#define WIFI_CONNECT_RETRY_MS 1600
#define WIFI_SLOT_COUNT 5
#define WIFI_SCAN_MAX_RESULTS 20
#define MARKET_REFRESH_INTERVAL_S 300
#define MARKET_ROW_COUNT 15
#define CHART_POINT_COUNT 48
#define MARKET_CACHE_MAGIC 0x4D4B5431u
#define MARKET_CACHE_VERSION 1u

#define SAFE_X 42
#define SAFE_Y 34
#define SAFE_W (BSP_LCD_H_RES - (SAFE_X * 2))
#define SAFE_H (BSP_LCD_V_RES - (SAFE_Y * 2))

#define QMI8658_ADDR_LOW 0x6B
#define QMI8658_ADDR_HIGH 0x6A
#define QMI8658_WHOAMI 0x00
#define QMI8658_WHOAMI_VALUE 0x05
#define QMI8658_CTRL1 0x02
#define QMI8658_CTRL2 0x03
#define QMI8658_CTRL5 0x06
#define QMI8658_CTRL7 0x08
#define QMI8658_CTRL7_DISABLE 0x00
#define QMI8658_RESET 0x60
#define QMI8658_RST_RESULT 0x4D
#define QMI8658_RST_RESULT_VALUE 0x80
#define QMI8658_ACCEL_X_L 0x35
#define QMI8658_ACCEL_RANGE_MG 8000
#define MOTION_WAKE_POLL_MS 80
#define MOTION_WAKE_COOLDOWN_US 3000000LL

#define AXP2101_ADDR 0x34
#define AXP2101_STATUS1 0x00
#define AXP2101_STATUS2 0x01
#define AXP2101_CHIP_ID 0x03
#define AXP2101_CHIP_ID_VALUE_A 0x4A
#define AXP2101_CHIP_ID_VALUE_B 0x47
#define AXP2101_COMMON_CONFIG 0x10
#define AXP2101_SOFT_SHUTDOWN_MASK (1u << 0)
#define AXP2101_CHARGE_GAUGE_WDT_CTRL 0x18
#define AXP2101_GAUGE_ENABLE_MASK (1u << 3)
#define AXP2101_ADC_DATA_VBAT_H 0x34
#define AXP2101_ADC_DATA_VBAT_L 0x35
#define AXP2101_GAUGE_VBAT_H_MASK 0x1F
#define AXP2101_BAT_DET_CTRL 0x68
#define AXP2101_BAT_TYPE_DET_MASK (1u << 0)
#define AXP2101_BAT_PRESENT_MASK (1u << 3)
#define AXP2101_BAT_PERCENT_DATA 0xA4
#define AXP2101_LDO_ONOFF_CTRL0 0x90
#define AXP2101_ALDO2_ENABLE_MASK (1u << 1)

#define WL_RETURN_ON_ERROR(expr, message) do {                         \
        esp_err_t wl_err__ = (expr);                                    \
        if (wl_err__ != ESP_OK) {                                       \
            ESP_LOGE(TAG, "%s: %s", (message), esp_err_to_name(wl_err__)); \
            return wl_err__;                                            \
        }                                                               \
    } while (0)

