akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
typedef struct {
    char static_ip[16];
    char static_netmask[16];
    char static_gateway[16];
    char dns1[16];
    char dns2[16];
} wifi_ip_config_t;

typedef struct {
    char name[16];
    char server_url[160];
    char api_key[192];
    char model[64];
} ai_profile_t;

typedef struct {
    uint32_t magic;
    uint32_t version;
    int active_index;
    ai_profile_t profiles[AI_PROFILE_COUNT];
} ai_profile_store_t;

typedef struct {
    uint32_t magic;
    uint32_t version;
    char wifi_ssid[33];
    char wifi_password[65];
    char server_url[160];
    char api_key[192];
    char model[64];
    char market_provider[16];
    char starter_prompt[160];
    char static_ip[16];
    char static_netmask[16];
    char static_gateway[16];
    char dns1[16];
    char dns2[16];
    char proxy_host[64];
    int proxy_port;
    int auto_sleep_s;
} watch_lite_config_prefix_t;

typedef struct {
    uint32_t magic;
    uint32_t version;
    char wifi_ssid[33];
    char wifi_password[65];
    char server_url[160];
    char api_key[192];
    char model[64];
    char market_provider[16];
    char starter_prompt[160];
    char static_ip[16];
    char static_netmask[16];
    char static_gateway[16];
    char dns1[16];
    char dns2[16];
    char proxy_host[64];
    int proxy_port;
    int auto_sleep_s;
    int brightness_percent;
    int motion_wake_enabled;
    int motion_wake_threshold_mg;
    char wifi_ssid2[33];
    char wifi_password2[65];
    char wifi_ssid3[33];
    char wifi_password3[65];
    char wifi_ssid4[33];
    char wifi_password4[65];
    char wifi_ssid5[33];
    char wifi_password5[65];
    wifi_ip_config_t wifi_net[WIFI_SLOT_COUNT];
} watch_lite_config_t;

typedef struct {
    uint32_t magic;
    uint32_t version;
    char wifi_ssid[33];
    char wifi_password[65];
    char server_url[160];
    char api_key[192];
    char model[64];
    char market_provider[16];
    char starter_prompt[160];
    char static_ip[16];
    char static_netmask[16];
    char static_gateway[16];
    char dns1[16];
    char dns2[16];
    char proxy_host[64];
    int proxy_port;
    int auto_sleep_s;
    int brightness_percent;
    int motion_wake_enabled;
    int motion_wake_threshold_mg;
    char wifi_ssid2[33];
    char wifi_password2[65];
    char wifi_ssid3[33];
    char wifi_password3[65];
    char wifi_ssid4[33];
    char wifi_password4[65];
    char wifi_ssid5[33];
    char wifi_password5[65];
} watch_lite_config_v4_t;

typedef struct {
    uint32_t magic;
    uint32_t version;
    char wifi_ssid[33];
    char wifi_password[65];
    char server_url[160];
    int auto_sleep_s;
} watch_lite_config_v1_t;

typedef struct {
    uint32_t magic;
    uint32_t version;
    char wifi_ssid[33];
    char wifi_password[65];
    char server_url[160];
    char api_key[192];
    char model[64];
    char market_provider[16];
    char starter_prompt[160];
    char static_ip[16];
    char static_netmask[16];
    char static_gateway[16];
    char dns1[16];
    char dns2[16];
    char proxy_host[64];
    int proxy_port;
    int auto_sleep_s;
} watch_lite_config_v3_t;

typedef struct {
    uint32_t magic;
    uint32_t version;
    char wifi_ssid[33];
    char wifi_password[65];
    char server_url[160];
    char api_key[192];
    char model[64];
    char market_provider[16];
    char starter_prompt[160];
    char static_ip[16];
    char static_netmask[16];
    char static_gateway[16];
    char dns1[16];
    char dns2[16];
    char proxy_host[64];
    int proxy_port;
    int auto_sleep_s;
    int brightness_percent;
    int motion_wake_enabled;
    int motion_wake_threshold_mg;
} watch_lite_config_v3_full_t;

typedef struct {
    char *data;
    int len;
    int capacity;
} http_buffer_t;

typedef struct {
    uint8_t *data;
    size_t len;
    size_t cap;
    bool truncated;
} binary_buffer_t;

typedef struct {
    size_t data_offset;
    size_t data_len;
    esp_codec_dev_sample_info_t fs;
} wav_audio_info_t;

typedef struct {
    char reply[512];
    bool created_with_caps;
} voice_tts_job_t;

typedef struct {
    char transcript[192];
    char reply[512];
    char audio_url[224];
    char action[32];
    char asset[16];
    int brightness_delta;
    bool local;
    bool refresh_market;
} voice_gateway_result_t;

typedef struct {
    char proxy_host[64];
    int proxy_port;
    bool use_tls;
    int sockfd;
    esp_tls_t *tls;
} http_proxy_transport_ctx_t;

typedef enum {
    MARKET_SOURCE_CRYPTO = 0,
    MARKET_SOURCE_STOOQ,
    MARKET_SOURCE_YAHOO,
} market_source_t;

typedef struct {
    const char *code;
    const char *symbol;
    const char *chart_symbol;
    market_source_t source;
    uint32_t color;
} market_asset_def_t;

typedef struct {
    char price[24];
    char change[16];
    lv_obj_t *code_label;
    lv_obj_t *price_label;
    lv_obj_t *change_label;
    lv_obj_t *hit_obj;
} market_row_t;

typedef struct {
    uint32_t magic;
    uint32_t version;
    uint32_t row_count;
    char market_time[16];
    char price[MARKET_ROW_COUNT][24];
    char change[MARKET_ROW_COUNT][16];
} market_cache_t;

typedef struct {
    watch_lite_config_t cfg;
    char ap_ssid[32];
    char sta_ip[16];
    bool sta_configured;
    bool sta_connected;
    bool sta_link_connected;
    bool sta_connect_requested;
    uint8_t sta_disconnect_reason;
    bool wifi_started;
    bool ap_started;
    bool ap_config_enabled;
    bool ui_ready;
    bool sntp_started;
    bool screen_sleeping;
    bool worker_started;
    bool market_refresh_inflight;
    bool ai_start_inflight;
    bool ai_tts_inflight;
    bool ai_playback_inflight;
    bool ai_tts_stop_requested;
    bool chart_inflight;
    bool market_polled_once;
    bool deep_sleep_armed;
    bool motion_worker_started;
    volatile bool boot_wake_refresh_pending;
    volatile bool boot_config_ap_pending;
    bool pmic_present;
    bool battery_present;
    bool imu_present;
    bool imu_baseline_valid;
    uint32_t ai_task_generation;
    int64_t ai_task_started_us;
    int preferred_wifi_slot;
    int pending_wifi_slot;
    int active_wifi_slot;
    int64_t last_market_refresh_us;
    int64_t last_activity_us;
    int64_t screen_sleep_started_us;
    int64_t last_motion_wake_us;
    int64_t last_battery_read_us;
    int64_t market_task_started_us;
    int64_t chart_task_started_us;
    int64_t tts_task_started_us;
    esp_netif_t *sta_netif;
    i2c_master_dev_handle_t pmic_dev;
    i2c_master_dev_handle_t imu_dev;
    httpd_handle_t httpd;
    SemaphoreHandle_t net_lock;
    SemaphoreHandle_t audio_lock;
    esp_codec_dev_handle_t speaker_dev;
    esp_codec_dev_handle_t mic_dev;
    int16_t imu_last_raw[3];
    int battery_percent;
    int battery_mv;

    market_row_t market_rows[MARKET_ROW_COUNT];
    char market_status[64];
    char market_time[16];
    int chart_selected_index;
    int chart_point_count;
    double chart_values[CHART_POINT_COUNT];
    char chart_hint[48];
    char ai_state[48];
    char ai_hint[96];
    char ai_user[192];
    char ai_reply[512];
    char ai_dialog[896];
    ai_profile_store_t ai_profiles;

    lv_obj_t *home_screen;
    lv_obj_t *ai_screen;
    lv_obj_t *chart_screen;
    lv_obj_t *wifi_label;
    lv_obj_t *time_label;
    lv_obj_t *battery_label;
    lv_obj_t *market_time_label;
    lv_obj_t *market_status_label;
    lv_obj_t *chart_title_label;
    lv_obj_t *chart_price_label;
    lv_obj_t *chart_hint_label;
    lv_obj_t *chart_plot_obj;
    lv_obj_t *status_label;
    lv_obj_t *ai_title_label;
    lv_obj_t *ai_state_label;
    lv_obj_t *ai_reply_container;
    lv_obj_t *ai_reply_label;
    lv_obj_t *ai_profile_label;
} app_state_t;

static app_state_t g_app;

