akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static const ai_profile_t DEFAULT_AI_PROFILES[AI_PROFILE_COUNT] = {
    {
        .name = "GPT",
        .server_url = "https://api.openai.com/v1",
        .model = "gpt-4o-mini",
    },
    {
        .name = "Gemini",
        .server_url = "https://generativelanguage.googleapis.com/v1beta/openai",
        .model = "gemini-2.5-flash",
    },
    {
        .name = "豆包",
        .server_url = "https://ark.cn-beijing.volces.com/api/v3",
        .model = "doubao-seed-1-6",
    },
    {
        .name = "DeepSeek",
        .server_url = "https://api.deepseek.com/v1",
        .model = "deepseek-chat",
    },
    {
        .name = "千问",
        .server_url = "https://dashscope.aliyuncs.com/compatible-mode/v1",
        .model = "qwen-plus",
    },
    {
        .name = "自定",
        .server_url = DEFAULT_API_URL,
        .model = DEFAULT_MODEL,
    },
};

static void ui_refresh_now(void);
static void ui_refresh_locked(void);
static void ui_show_home(void);
static void ui_show_ai(void);
static void ui_show_chart(int row_index);
static const char *ui_current_screen_name(void);
static void ui_create_chart(void);
static void configure_timezone_once(void);
static void home_market_refresh_async(void);
static bool direct_ai_start_request(const char *source);
static void chart_refresh_async(int row_index);
static void handle_button_wake_refresh(void);
static void process_pending_button_requests(void);
static void motion_task_start_once(void);
static void boot_button_task_start_once(void);
static esp_err_t market_cache_load(void);
static esp_err_t market_cache_save(void);
static esp_err_t config_save(const watch_lite_config_t *cfg);
static esp_err_t ai_profiles_save(const ai_profile_store_t *store);
static void ai_profile_apply(int index, bool persist);
static void config_sanitize(watch_lite_config_t *cfg);
static bool config_has_wifi(const watch_lite_config_t *cfg);
static void apply_ip_config_for_slot(int slot);
static void apply_dns_config_for_slot(int slot);
static int wifi_slot_at_try_index(int index);
static int wifi_current_connected_slot(void);
static int configured_wifi_slot_count(void);
static esp_err_t wifi_apply_sta_slot(int slot);
static void wifi_select_task(void *arg);
static esp_err_t wifi_sta_connect_once(int timeout_ms);
static void wifi_sta_disconnect_now(void);
static void wifi_sta_disconnect_when_idle(void);
static esp_err_t wifi_apply_power_save_mode(void);
static esp_err_t wifi_configure_ap(void);
static esp_err_t wifi_enable_config_ap(void);
static esp_err_t http_server_start(void);
static esp_err_t pmic_init(void);
static esp_err_t pmic_read_reg(uint8_t reg, uint8_t *value);
static esp_err_t pmic_update_bits(uint8_t reg, uint8_t mask, uint8_t value);
static esp_err_t pmic_read_battery(void);
static void battery_update_once(void);
static void pmic_audio_power_set(bool enabled);
static void enter_deep_sleep_now(void);
static esp_err_t imu_write_reg(uint8_t reg, uint8_t value);
static void log_wakeup_reason(void);
static void update_ai_dialog_text(void);
static bool ai_task_generation_is_current(uint32_t generation);
static void ai_task_set_state_if_current(uint32_t generation, const char *state);
static void ai_task_set_reply_if_current(uint32_t generation, const char *reply);
static esp_err_t record_voice_wav(binary_buffer_t *wav_out, char *error_out, size_t error_out_len);
static esp_err_t play_wav_audio(uint8_t *data, size_t len, char *error_out, size_t error_out_len);
static bool schedule_tts_reply(const char *reply);
static void voice_tts_task(void *arg);
static esp_err_t http_binary_event_cb(esp_http_client_event_t *event);
static bool extract_error_string_from_json(cJSON *root, char *error_out, size_t error_out_len);
static esp_err_t parse_reply_response(const char *body, char *reply_out, size_t reply_out_len,
                                      char *error_out, size_t error_out_len);
static esp_err_t perform_gateway_voice_request(const uint8_t *wav_data, size_t wav_len,
                                               voice_gateway_result_t *result,
                                               char *error_out, size_t error_out_len);
static esp_err_t fetch_gateway_audio(const char *audio_url, binary_buffer_t *audio_out,
                                     char *error_out, size_t error_out_len);
static void binary_buffer_free(binary_buffer_t *buffer);
static esp_transport_handle_t http_client_attach_proxy(esp_http_client_config_t *config,
                                                       const char *url);
static void http_client_destroy_proxy_transport(esp_transport_handle_t proxy_transport);

static const market_asset_def_t MARKET_DEFS[MARKET_ROW_COUNT] = {
    {"BTC", "bitcoin", "BTC-USD", MARKET_SOURCE_CRYPTO, 0xF7C873},
    {"ETH", "ethereum", "ETH-USD", MARKET_SOURCE_CRYPTO, 0x7AA7FF},
    {"XAU", "xauusd", "GC=F", MARKET_SOURCE_STOOQ, 0xF7D774},
    {"WTI", "cl.f", "CL=F", MARKET_SOURCE_STOOQ, 0xEFA26A},
    {"DXY", "dx.f", "DX-Y.NYB", MARKET_SOURCE_STOOQ, 0xB8C7DD},
    {"CNY", "usdcny", "CNY=X", MARKET_SOURCE_STOOQ, 0xB8C7DD},
    {"EUR", "eurusd", "EURUSD=X", MARKET_SOURCE_STOOQ, 0xB8C7DD},
    {"VIX", "%5EVIX", "%5EVIX", MARKET_SOURCE_YAHOO, 0xFF8A7A},
    {"SHC", "%5Eshc", "000001.SS", MARKET_SOURCE_STOOQ, 0x91D7FF},
    {"HSI", "%5Ehsi", "%5EHSI", MARKET_SOURCE_STOOQ, 0x91D7FF},
    {"N225", "%5Enkx", "%5EN225", MARKET_SOURCE_STOOQ, 0x91D7FF},
    {"DAX", "%5Edax", "%5EGDAXI", MARKET_SOURCE_STOOQ, 0xC7B7FF},
    {"UKX", "%5Eukx", "%5EFTSE", MARKET_SOURCE_STOOQ, 0xC7B7FF},
    {"SPX", "%5Espx", "%5EGSPC", MARKET_SOURCE_STOOQ, 0xC7B7FF},
    {"NDX", "%5Endq", "%5ENDX", MARKET_SOURCE_STOOQ, 0xC7B7FF},
};

static void copy_string(char *dst, size_t dst_size, const char *src)
{
    if (!dst || dst_size == 0) {
        return;
    }
    if (!src) {
        dst[0] = '\0';
        return;
    }
    strlcpy(dst, src, dst_size);
}

static size_t utf8_safe_copy(const char *src, char *dst, size_t dst_len)
{
    if (!dst || dst_len == 0) {
        return 0;
    }
    dst[0] = '\0';
    if (!src) {
        return 0;
    }

    size_t di = 0;
    for (size_t si = 0; src[si] != '\0';) {
        unsigned char c = (unsigned char)src[si];
        size_t char_len = 1;
        if ((c & 0x80u) == 0x00u) {
            char_len = 1;
        } else if ((c & 0xE0u) == 0xC0u) {
            char_len = 2;
        } else if ((c & 0xF0u) == 0xE0u) {
            char_len = 3;
        } else if ((c & 0xF8u) == 0xF0u) {
            char_len = 4;
        }
        if (di + char_len >= dst_len) {
            break;
        }
        memcpy(dst + di, src + si, char_len);
        di += char_len;
        si += char_len;
    }
    dst[di] = '\0';
    return di;
}

static bool utf8_decode_codepoint(const char *src, uint32_t *codepoint, size_t *char_len)
{
    if (!src || !src[0] || !codepoint || !char_len) {
        return false;
    }

    const unsigned char c0 = (unsigned char)src[0];
    if ((c0 & 0x80u) == 0) {
        *codepoint = c0;
        *char_len = 1;
        return true;
    }

