akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    uint32_t cp = 0;
    size_t len = 0;
    uint32_t min_cp = 0;
    if ((c0 & 0xE0u) == 0xC0u) {
        cp = c0 & 0x1Fu;
        len = 2;
        min_cp = 0x80u;
    } else if ((c0 & 0xF0u) == 0xE0u) {
        cp = c0 & 0x0Fu;
        len = 3;
        min_cp = 0x800u;
    } else if ((c0 & 0xF8u) == 0xF0u) {
        cp = c0 & 0x07u;
        len = 4;
        min_cp = 0x10000u;
    } else {
        return false;
    }

    for (size_t i = 1; i < len; ++i) {
        unsigned char cx = (unsigned char)src[i];
        if ((cx & 0xC0u) != 0x80u) {
            return false;
        }
        cp = (cp << 6) | (uint32_t)(cx & 0x3Fu);
    }

    if (cp < min_cp || cp > 0x10FFFFu || (cp >= 0xD800u && cp <= 0xDFFFu)) {
        return false;
    }

    *codepoint = cp;
    *char_len = len;
    return true;
}

static bool utf8_append_codepoint(char *dst, size_t dst_size, size_t *di, uint32_t codepoint)
{
    if (!dst || !di || *di >= dst_size) {
        return false;
    }

    unsigned char encoded[4] = {0};
    size_t len = 0;
    if (codepoint <= 0x7Fu) {
        encoded[0] = (unsigned char)codepoint;
        len = 1;
    } else if (codepoint <= 0x7FFu) {
        encoded[0] = (unsigned char)(0xC0u | (codepoint >> 6));
        encoded[1] = (unsigned char)(0x80u | (codepoint & 0x3Fu));
        len = 2;
    } else if (codepoint <= 0xFFFFu) {
        encoded[0] = (unsigned char)(0xE0u | (codepoint >> 12));
        encoded[1] = (unsigned char)(0x80u | ((codepoint >> 6) & 0x3Fu));
        encoded[2] = (unsigned char)(0x80u | (codepoint & 0x3Fu));
        len = 3;
    } else if (codepoint <= 0x10FFFFu) {
        encoded[0] = (unsigned char)(0xF0u | (codepoint >> 18));
        encoded[1] = (unsigned char)(0x80u | ((codepoint >> 12) & 0x3Fu));
        encoded[2] = (unsigned char)(0x80u | ((codepoint >> 6) & 0x3Fu));
        encoded[3] = (unsigned char)(0x80u | (codepoint & 0x3Fu));
        len = 4;
    } else {
        return false;
    }

    if (*di + len >= dst_size) {
        return false;
    }
    memcpy(dst + *di, encoded, len);
    *di += len;
    dst[*di] = '\0';
    return true;
}

static uint32_t display_normalize_codepoint(uint32_t codepoint)
{
    if (codepoint >= 0xFF10u && codepoint <= 0xFF19u) {
        return '0' + (codepoint - 0xFF10u);
    }
    if (codepoint >= 0xFF21u && codepoint <= 0xFF3Au) {
        return 'A' + (codepoint - 0xFF21u);
    }
    if (codepoint >= 0xFF41u && codepoint <= 0xFF5Au) {
        return 'a' + (codepoint - 0xFF41u);
    }

    switch (codepoint) {
    case '\r':
        return 0;
    case '\t':
    case 0x00A0u:
    case 0x3000u:
        return ' ';
    case 0x200Bu: /* zero-width space */
    case 0x200Cu:
    case 0x200Du:
    case 0x2060u:
    case 0xFEFFu:
    case 0xFE0Eu:
    case 0xFE0Fu:
        return 0;
    case 0x00B0u:
        return 0;
    case 0x00A9u:
    case 0x00AEu:
    case 0x2122u:
        return 0;
    case 0x00B7u:
    case 0x30FBu:
        return 0x00B7u;
    case 0x2022u:
    case 0x25CFu:
    case 0x25A0u:
    case 0x25AAu:
        return 0x2022u;
    case 0x2010u:
    case 0x2011u:
    case 0x2012u:
    case 0x2013u:
    case 0x2014u:
    case 0x2015u:
    case 0x2212u:
    case 0xFF0Du:
        return '-';
    case 0x2018u:
    case 0x2019u:
    case 0x201Au:
    case 0x201Bu:
    case 0x2032u:
    case 0x0060u:
    case 0x00B4u:
        return '\'';
    case 0x201Cu:
    case 0x201Du:
    case 0x201Eu:
    case 0x201Fu:
    case 0x2033u:
        return '"';
    case 0x2026u:
    case 0x22EFu:
        return 0x2026u;
    case 0x300Cu:
    case 0x300Eu:
        return 0x201Cu;
    case 0x300Du:
    case 0x300Fu:
        return 0x201Du;
    case 0x3014u:
    case 0x3016u:
    case 0x301Au:
    case 0xFF3Bu:
        return 0x3010u;
    case 0x3015u:
    case 0x3017u:
    case 0x301Bu:
    case 0xFF3Du:
        return 0x3011u;
    case 0x3008u:
    case 0x300Au:
    case 0xFE64u:
        return '<';
    case 0x3009u:
    case 0x300Bu:
    case 0xFE65u:
        return '>';
    case 0x301Cu:
    case 0xFF5Eu:
    case 0x223Cu:
        return '-';
    case 0xFF01u:
        return 0xFF01u;
    case 0xFF08u:
        return 0xFF08u;
    case 0xFF09u:
        return 0xFF09u;
    case 0xFF0Cu:
        return 0xFF0Cu;
    case 0xFF0Eu:
        return '.';
    case 0xFF1Au:
        return 0xFF1Au;
    case 0xFF1Bu:
        return 0xFF1Bu;
    case 0xFF1Fu:
        return 0xFF1Fu;
    case 0xFF05u:
        return 0xFF05u;
    case 0xFF0Bu:
        return 0xFF0Bu;
    case 0x00A5u:
        return 0xFFE5u;
    case 0xFF04u:
        return '$';
    case 0x2705u:
    case 0x2611u:
    case 0x2714u:
        return 0x2713u;
    case 0x274Cu:
    case 0x2716u:
    case 0x2718u:
        return 0x2715u;
    case 0x2190u:
    case 0x21D0u:
        return '<';
    case 0x2192u:
    case 0x21D2u:
        return '>';
    case 0x2191u:
        return 0x2191u;
    case 0x2193u:
        return 0x2193u;
    case 0x2194u:
    case 0x21D4u:
        return '-';
    case 0x20ACu:
        return 'E';
    case 0x00A3u:
        return 'L';
    default:
        return codepoint;
    }
}

static bool display_codepoint_is_cjk(uint32_t codepoint)
{
    return (codepoint >= 0x3400u && codepoint <= 0x9FFFu) ||
           (codepoint >= 0xF900u && codepoint <= 0xFAFFu);
}

static bool ai_dialog_font_has_glyph(uint32_t codepoint)
{
    if (codepoint == '\n' || codepoint == ' ') {
        return true;
    }
    if (codepoint < 0x20u) {
        return false;
    }
    if (codepoint >= 0x1F000u) {
        return false;
    }

    lv_font_glyph_dsc_t glyph = {0};
    if (!lv_font_get_glyph_dsc(AI_TEXT_FILTER_FONT, &glyph, codepoint, 0)) {
        return false;
    }
    return !glyph.is_placeholder;
}

static size_t display_safe_text_copy(const char *src, char *dst, size_t dst_len)
{
    if (!dst || dst_len == 0) {
        return 0;
    }
    dst[0] = '\0';
    if (!src) {
        return 0;
    }

    if (!s_ai_text_filter_enabled) {
        return utf8_safe_copy(src, dst, dst_len);
    }

    size_t di = 0;
    for (size_t si = 0; src[si] != '\0';) {
        uint32_t cp = 0;
        size_t char_len = 0;
        if (!utf8_decode_codepoint(src + si, &cp, &char_len)) {
            cp = '?';
            char_len = 1;
        }
        si += char_len;

