akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
        cp = display_normalize_codepoint(cp);
        if (cp == 0) {
            continue;
        }

        if (!ai_dialog_font_has_glyph(cp)) {
            if (display_codepoint_is_cjk(cp)) {
                cp = '?';
            } else {
                continue;
            }
        }
        if (!utf8_append_codepoint(dst, dst_len, &di, cp)) {
            break;
        }
    }
    return di;
}

static void copy_ai_text(char *dst, size_t dst_size, const char *src)
{
    (void)display_safe_text_copy(src, dst, dst_size);
}

static bool text_has_non_ascii(const char *text)
{
    if (!text) {
        return false;
    }
    while (*text) {
        if ((unsigned char)*text >= 0x80u) {
            return true;
        }
        text++;
    }
    return false;
}

static bool stt_text_is_empty_or_prompt_hallucination(const char *text)
{
    if (!text) {
        return true;
    }
    while (*text && isspace((unsigned char)*text)) {
        ++text;
    }
    if (*text == '\0') {
        return true;
    }

    return strstr(text, "语音转写") ||
           strstr(text, "只输出用户说") ||
           strstr(text, "不要翻译") ||
           strstr(text, "中文普通话");
}

static char *config_wifi_ssid(watch_lite_config_t *cfg, int slot)
{
    if (!cfg) {
        return NULL;
    }
    switch (slot) {
    case 0:
        return cfg->wifi_ssid;
    case 1:
        return cfg->wifi_ssid2;
    case 2:
        return cfg->wifi_ssid3;
    case 3:
        return cfg->wifi_ssid4;
    case 4:
        return cfg->wifi_ssid5;
    default:
        return NULL;
    }
}

static char *config_wifi_password(watch_lite_config_t *cfg, int slot)
{
    if (!cfg) {
        return NULL;
    }
    switch (slot) {
    case 0:
        return cfg->wifi_password;
    case 1:
        return cfg->wifi_password2;
    case 2:
        return cfg->wifi_password3;
    case 3:
        return cfg->wifi_password4;
    case 4:
        return cfg->wifi_password5;
    default:
        return NULL;
    }
}

static const char *config_wifi_ssid_const(const watch_lite_config_t *cfg, int slot)
{
    return config_wifi_ssid((watch_lite_config_t *)cfg, slot);
}

static const char *config_wifi_password_const(const watch_lite_config_t *cfg, int slot)
{
    return config_wifi_password((watch_lite_config_t *)cfg, slot);
}

static wifi_ip_config_t *config_wifi_net(watch_lite_config_t *cfg, int slot)
{
    if (!cfg || slot < 0 || slot >= WIFI_SLOT_COUNT) {
        return NULL;
    }
    return &cfg->wifi_net[slot];
}

static const wifi_ip_config_t *config_wifi_net_const(const watch_lite_config_t *cfg, int slot)
{
    return config_wifi_net((watch_lite_config_t *)cfg, slot);
}

static bool config_wifi_slot_used(const watch_lite_config_t *cfg, int slot)
{
    const char *ssid = config_wifi_ssid_const(cfg, slot);
    return ssid && ssid[0] != '\0';
}

static bool config_has_wifi(const watch_lite_config_t *cfg)
{
    for (int i = 0; i < WIFI_SLOT_COUNT; i++) {
        if (config_wifi_slot_used(cfg, i)) {
            return true;
        }
    }
    return false;
}

static void ai_profiles_set_defaults(ai_profile_store_t *store)
{
    memset(store, 0, sizeof(*store));
    store->magic = AI_PROFILE_MAGIC;
    store->version = AI_PROFILE_VERSION;
    store->active_index = AI_PROFILE_CUSTOM_INDEX;
    for (int i = 0; i < AI_PROFILE_COUNT; i++) {
        copy_string(store->profiles[i].name, sizeof(store->profiles[i].name),
                    DEFAULT_AI_PROFILES[i].name);
        copy_string(store->profiles[i].server_url, sizeof(store->profiles[i].server_url),
                    DEFAULT_AI_PROFILES[i].server_url);
        copy_string(store->profiles[i].model, sizeof(store->profiles[i].model),
                    DEFAULT_AI_PROFILES[i].model);
    }
}

static void ai_profiles_import_current_config(ai_profile_store_t *store,
                                              const watch_lite_config_t *cfg)
{
    if (!store || !cfg) {
        return;
    }
    ai_profile_t *custom = &store->profiles[AI_PROFILE_CUSTOM_INDEX];
    copy_string(custom->server_url, sizeof(custom->server_url), cfg->server_url);
    copy_string(custom->api_key, sizeof(custom->api_key), cfg->api_key);
    copy_string(custom->model, sizeof(custom->model), cfg->model);
}

static void ai_profiles_sanitize(ai_profile_store_t *store)
{
    if (!store || store->magic != AI_PROFILE_MAGIC || store->version != AI_PROFILE_VERSION) {
        return;
    }
    if (store->active_index < 0 || store->active_index >= AI_PROFILE_COUNT) {
        store->active_index = AI_PROFILE_CUSTOM_INDEX;
    }
    for (int i = 0; i < AI_PROFILE_COUNT; i++) {
        ai_profile_t *profile = &store->profiles[i];
        profile->name[sizeof(profile->name) - 1] = '\0';
        profile->server_url[sizeof(profile->server_url) - 1] = '\0';
        profile->api_key[sizeof(profile->api_key) - 1] = '\0';
        profile->model[sizeof(profile->model) - 1] = '\0';
        if (profile->name[0] == '\0') {
            copy_string(profile->name, sizeof(profile->name), DEFAULT_AI_PROFILES[i].name);
        }
        if (profile->server_url[0] == '\0') {
            copy_string(profile->server_url, sizeof(profile->server_url),
                        DEFAULT_AI_PROFILES[i].server_url);
        }
        if (profile->model[0] == '\0') {
            copy_string(profile->model, sizeof(profile->model),
                        DEFAULT_AI_PROFILES[i].model);
        }
    }
}

static esp_err_t ai_profiles_load(ai_profile_store_t *store, const watch_lite_config_t *cfg)
{
    ai_profiles_set_defaults(store);
    ai_profiles_import_current_config(store, cfg);

    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(APP_NS, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "ai profiles load: open failed: %s", esp_err_to_name(err));
        return err;
    }

    size_t size = 0;
    err = nvs_get_blob(handle, "ai_profiles", NULL, &size);
    if (err == ESP_OK && size == sizeof(*store)) {
        err = nvs_get_blob(handle, "ai_profiles", store, &size);
        if (err == ESP_OK && store->magic == AI_PROFILE_MAGIC &&
            store->version == AI_PROFILE_VERSION) {
            ai_profiles_sanitize(store);
            nvs_close(handle);
            ESP_LOGI(TAG, "ai profiles load: stored active=%d", store->active_index);
            return ESP_OK;
        }
    }
    nvs_close(handle);

    ai_profiles_set_defaults(store);
    ai_profiles_import_current_config(store, cfg);
    ESP_LOGI(TAG, "ai profiles load: defaults err=%s size=%u",
             esp_err_to_name(err), (unsigned)size);
    (void)ai_profiles_save(store);
    return err;
}

