akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static esp_err_t ai_profiles_save(const ai_profile_store_t *store)
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(APP_NS, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return err;
    }
    err = nvs_set_blob(handle, "ai_profiles", store, sizeof(*store));
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err;
}

static const ai_profile_t *ai_profile_active(void)
{
    int index = g_app.ai_profiles.active_index;
    if (index < 0 || index >= AI_PROFILE_COUNT) {
        index = AI_PROFILE_CUSTOM_INDEX;
    }
    return &g_app.ai_profiles.profiles[index];
}

static void ai_profile_apply(int index, bool persist)
{
    if (index < 0 || index >= AI_PROFILE_COUNT) {
        index = AI_PROFILE_CUSTOM_INDEX;
    }
    g_app.ai_profiles.active_index = index;
    const ai_profile_t *profile = ai_profile_active();
    copy_string(g_app.cfg.server_url, sizeof(g_app.cfg.server_url), profile->server_url);
    copy_string(g_app.cfg.api_key, sizeof(g_app.cfg.api_key), profile->api_key);
    copy_string(g_app.cfg.model, sizeof(g_app.cfg.model), profile->model);
    config_sanitize(&g_app.cfg);
    if (persist) {
        (void)ai_profiles_save(&g_app.ai_profiles);
        (void)config_save(&g_app.cfg);
    }
}

static void config_set_defaults(watch_lite_config_t *cfg)
{
    memset(cfg, 0, sizeof(*cfg));
    cfg->magic = CONFIG_MAGIC;
    cfg->version = CONFIG_VERSION;
    copy_string(cfg->server_url, sizeof(cfg->server_url), DEFAULT_API_URL);
    copy_string(cfg->model, sizeof(cfg->model), DEFAULT_MODEL);
    copy_string(cfg->market_provider, sizeof(cfg->market_provider), DEFAULT_MARKET_PROVIDER);
    copy_string(cfg->starter_prompt, sizeof(cfg->starter_prompt), DEFAULT_STARTER_PROMPT);
    cfg->auto_sleep_s = DEFAULT_AUTO_SLEEP_S;
    cfg->brightness_percent = DEFAULT_BRIGHTNESS_PERCENT;
    cfg->motion_wake_enabled = DEFAULT_MOTION_WAKE_ENABLED;
    cfg->motion_wake_threshold_mg = DEFAULT_MOTION_WAKE_THRESHOLD_MG;
}

static void config_copy_common_from_v4(watch_lite_config_t *cfg, const watch_lite_config_v4_t *old)
{
    if (!cfg || !old) {
        return;
    }
    copy_string(cfg->wifi_ssid, sizeof(cfg->wifi_ssid), old->wifi_ssid);
    copy_string(cfg->wifi_password, sizeof(cfg->wifi_password), old->wifi_password);
    copy_string(cfg->server_url, sizeof(cfg->server_url), old->server_url);
    copy_string(cfg->api_key, sizeof(cfg->api_key), old->api_key);
    copy_string(cfg->model, sizeof(cfg->model), old->model);
    copy_string(cfg->market_provider, sizeof(cfg->market_provider), old->market_provider);
    copy_string(cfg->starter_prompt, sizeof(cfg->starter_prompt), old->starter_prompt);
    copy_string(cfg->static_ip, sizeof(cfg->static_ip), old->static_ip);
    copy_string(cfg->static_netmask, sizeof(cfg->static_netmask), old->static_netmask);
    copy_string(cfg->static_gateway, sizeof(cfg->static_gateway), old->static_gateway);
    copy_string(cfg->dns1, sizeof(cfg->dns1), old->dns1);
    copy_string(cfg->dns2, sizeof(cfg->dns2), old->dns2);
    copy_string(cfg->proxy_host, sizeof(cfg->proxy_host), old->proxy_host);
    cfg->proxy_port = old->proxy_port;
    cfg->auto_sleep_s = old->auto_sleep_s;
    cfg->brightness_percent = old->brightness_percent;
    cfg->motion_wake_enabled = old->motion_wake_enabled;
    cfg->motion_wake_threshold_mg = old->motion_wake_threshold_mg;
    copy_string(cfg->wifi_ssid2, sizeof(cfg->wifi_ssid2), old->wifi_ssid2);
    copy_string(cfg->wifi_password2, sizeof(cfg->wifi_password2), old->wifi_password2);
    copy_string(cfg->wifi_ssid3, sizeof(cfg->wifi_ssid3), old->wifi_ssid3);
    copy_string(cfg->wifi_password3, sizeof(cfg->wifi_password3), old->wifi_password3);
    copy_string(cfg->wifi_ssid4, sizeof(cfg->wifi_ssid4), old->wifi_ssid4);
    copy_string(cfg->wifi_password4, sizeof(cfg->wifi_password4), old->wifi_password4);
    copy_string(cfg->wifi_ssid5, sizeof(cfg->wifi_ssid5), old->wifi_ssid5);
    copy_string(cfg->wifi_password5, sizeof(cfg->wifi_password5), old->wifi_password5);
    copy_string(cfg->wifi_net[0].static_ip, sizeof(cfg->wifi_net[0].static_ip), old->static_ip);
    copy_string(cfg->wifi_net[0].static_netmask, sizeof(cfg->wifi_net[0].static_netmask), old->static_netmask);
    copy_string(cfg->wifi_net[0].static_gateway, sizeof(cfg->wifi_net[0].static_gateway), old->static_gateway);
    copy_string(cfg->wifi_net[0].dns1, sizeof(cfg->wifi_net[0].dns1), old->dns1);
    copy_string(cfg->wifi_net[0].dns2, sizeof(cfg->wifi_net[0].dns2), old->dns2);
}

static bool config_migrate_from_v4_blob(watch_lite_config_t *cfg, const watch_lite_config_v4_t *old)
{
    if (!cfg || !old || old->magic != CONFIG_MAGIC) {
        return false;
    }

    config_set_defaults(cfg);
    config_copy_common_from_v4(cfg, old);
    cfg->magic = CONFIG_MAGIC;
    cfg->version = CONFIG_VERSION;
    config_sanitize(cfg);
    return true;
}

static void config_copy_prefix_string(char *dst, size_t dst_size, const uint8_t *blob,
                                      size_t blob_size, size_t offset, size_t src_size)
{
    if (!dst || dst_size == 0 || !blob || offset >= blob_size) {
        return;
    }
    size_t available = blob_size - offset;
    size_t copy_len = MIN(MIN(dst_size - 1, src_size), available);
    memcpy(dst, blob + offset, copy_len);
    dst[copy_len] = '\0';
}

static bool config_migrate_from_prefix_blob(watch_lite_config_t *cfg, const uint8_t *blob,
                                            size_t blob_size)
{
    if (!cfg || !blob || blob_size < offsetof(watch_lite_config_prefix_t, wifi_password)) {
        return false;
    }

    const watch_lite_config_prefix_t *old = (const watch_lite_config_prefix_t *)blob;
    if (old->magic != CONFIG_MAGIC) {
        return false;
    }

    config_set_defaults(cfg);
    config_copy_prefix_string(cfg->wifi_ssid, sizeof(cfg->wifi_ssid), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, wifi_ssid),
                              sizeof(old->wifi_ssid));
    config_copy_prefix_string(cfg->wifi_password, sizeof(cfg->wifi_password), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, wifi_password),
                              sizeof(old->wifi_password));
    config_copy_prefix_string(cfg->server_url, sizeof(cfg->server_url), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, server_url),
                              sizeof(old->server_url));
    config_copy_prefix_string(cfg->api_key, sizeof(cfg->api_key), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, api_key),
                              sizeof(old->api_key));
    config_copy_prefix_string(cfg->model, sizeof(cfg->model), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, model),
                              sizeof(old->model));
    config_copy_prefix_string(cfg->market_provider, sizeof(cfg->market_provider), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, market_provider),
                              sizeof(old->market_provider));
    config_copy_prefix_string(cfg->starter_prompt, sizeof(cfg->starter_prompt), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, starter_prompt),
                              sizeof(old->starter_prompt));
    config_copy_prefix_string(cfg->static_ip, sizeof(cfg->static_ip), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, static_ip),
                              sizeof(old->static_ip));
    config_copy_prefix_string(cfg->static_netmask, sizeof(cfg->static_netmask), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, static_netmask),
                              sizeof(old->static_netmask));
    config_copy_prefix_string(cfg->static_gateway, sizeof(cfg->static_gateway), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, static_gateway),
                              sizeof(old->static_gateway));
    config_copy_prefix_string(cfg->dns1, sizeof(cfg->dns1), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, dns1),
                              sizeof(old->dns1));
    config_copy_prefix_string(cfg->dns2, sizeof(cfg->dns2), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, dns2),
                              sizeof(old->dns2));
    config_copy_prefix_string(cfg->proxy_host, sizeof(cfg->proxy_host), blob, blob_size,
                              offsetof(watch_lite_config_prefix_t, proxy_host),
                              sizeof(old->proxy_host));

    if (blob_size >= offsetof(watch_lite_config_prefix_t, proxy_port) + sizeof(old->proxy_port)) {
        memcpy(&cfg->proxy_port, blob + offsetof(watch_lite_config_prefix_t, proxy_port),
               sizeof(cfg->proxy_port));
    }
    if (blob_size >= offsetof(watch_lite_config_prefix_t, auto_sleep_s) + sizeof(old->auto_sleep_s)) {
        memcpy(&cfg->auto_sleep_s, blob + offsetof(watch_lite_config_prefix_t, auto_sleep_s),
               sizeof(cfg->auto_sleep_s));
    }
    copy_string(cfg->wifi_net[0].static_ip, sizeof(cfg->wifi_net[0].static_ip), cfg->static_ip);
    copy_string(cfg->wifi_net[0].static_netmask, sizeof(cfg->wifi_net[0].static_netmask),
                cfg->static_netmask);
    copy_string(cfg->wifi_net[0].static_gateway, sizeof(cfg->wifi_net[0].static_gateway),
                cfg->static_gateway);
    copy_string(cfg->wifi_net[0].dns1, sizeof(cfg->wifi_net[0].dns1), cfg->dns1);
    copy_string(cfg->wifi_net[0].dns2, sizeof(cfg->wifi_net[0].dns2), cfg->dns2);
    cfg->magic = CONFIG_MAGIC;
    cfg->version = CONFIG_VERSION;
    config_sanitize(cfg);
    return true;
}

