akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static void config_sanitize(watch_lite_config_t *cfg)
{
    if (cfg->magic != CONFIG_MAGIC || cfg->version != CONFIG_VERSION) {
        config_set_defaults(cfg);
        return;
    }

    for (int i = 0; i < WIFI_SLOT_COUNT; i++) {
        char *ssid = config_wifi_ssid(cfg, i);
        char *password = config_wifi_password(cfg, i);
        if (ssid) {
            ssid[32] = '\0';
        }
        if (password) {
            password[64] = '\0';
        }
        wifi_ip_config_t *net = config_wifi_net(cfg, i);
        if (net) {
            net->static_ip[sizeof(net->static_ip) - 1] = '\0';
            net->static_netmask[sizeof(net->static_netmask) - 1] = '\0';
            net->static_gateway[sizeof(net->static_gateway) - 1] = '\0';
            net->dns1[sizeof(net->dns1) - 1] = '\0';
            net->dns2[sizeof(net->dns2) - 1] = '\0';
        }
    }
    cfg->server_url[sizeof(cfg->server_url) - 1] = '\0';
    cfg->api_key[sizeof(cfg->api_key) - 1] = '\0';
    cfg->model[sizeof(cfg->model) - 1] = '\0';
    cfg->market_provider[sizeof(cfg->market_provider) - 1] = '\0';
    cfg->starter_prompt[sizeof(cfg->starter_prompt) - 1] = '\0';
    cfg->static_ip[sizeof(cfg->static_ip) - 1] = '\0';
    cfg->static_netmask[sizeof(cfg->static_netmask) - 1] = '\0';
    cfg->static_gateway[sizeof(cfg->static_gateway) - 1] = '\0';
    cfg->dns1[sizeof(cfg->dns1) - 1] = '\0';
    cfg->dns2[sizeof(cfg->dns2) - 1] = '\0';
    cfg->proxy_host[0] = '\0';
    cfg->proxy_port = 0;

    if (cfg->server_url[0] == '\0') {
        copy_string(cfg->server_url, sizeof(cfg->server_url), DEFAULT_API_URL);
    }
    if (strcmp(cfg->server_url, DEFAULT_VOICE_GATEWAY_URL) == 0) {
        copy_string(cfg->server_url, sizeof(cfg->server_url), DEFAULT_API_URL);
    }
    if (cfg->model[0] == '\0') {
        copy_string(cfg->model, sizeof(cfg->model), DEFAULT_MODEL);
    }
    if (cfg->market_provider[0] == '\0') {
        copy_string(cfg->market_provider, sizeof(cfg->market_provider), DEFAULT_MARKET_PROVIDER);
    }
    if (cfg->starter_prompt[0] == '\0') {
        copy_string(cfg->starter_prompt, sizeof(cfg->starter_prompt), DEFAULT_STARTER_PROMPT);
    }
    if (cfg->auto_sleep_s < 0 || cfg->auto_sleep_s > MAX_AUTO_SLEEP_S) {
        cfg->auto_sleep_s = DEFAULT_AUTO_SLEEP_S;
    }
    if (cfg->brightness_percent < 5 || cfg->brightness_percent > 100) {
        cfg->brightness_percent = DEFAULT_BRIGHTNESS_PERCENT;
    }
    cfg->motion_wake_enabled = 0;
    if (cfg->motion_wake_threshold_mg < MIN_MOTION_WAKE_THRESHOLD_MG ||
        cfg->motion_wake_threshold_mg > MAX_MOTION_WAKE_THRESHOLD_MG) {
        cfg->motion_wake_threshold_mg = DEFAULT_MOTION_WAKE_THRESHOLD_MG;
    }
}

static esp_err_t config_load(watch_lite_config_t *cfg)
{
    config_set_defaults(cfg);
    bool save_after_load = false;
    const char *source = "defaults";

    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(APP_NS, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "config load: open failed: %s", esp_err_to_name(err));
        return err;
    }

    size_t size = 0;
    err = nvs_get_blob(handle, "config", NULL, &size);
    if (err == ESP_OK && size == sizeof(*cfg)) {
        err = nvs_get_blob(handle, "config", cfg, &size);
        if (err == ESP_OK && cfg->magic == CONFIG_MAGIC) {
            if (cfg->version != CONFIG_VERSION) {
                ESP_LOGW(TAG, "config load: same-size old version=%lu, keeping fields",
                         (unsigned long)cfg->version);
                cfg->version = CONFIG_VERSION;
                save_after_load = true;
            }
            config_sanitize(cfg);
            source = "v5";
        } else {
            config_set_defaults(cfg);
            source = "bad-v5";
        }
    } else if (err == ESP_OK && size == sizeof(watch_lite_config_v4_t)) {
        watch_lite_config_v4_t old = {0};
        size = sizeof(old);
        err = nvs_get_blob(handle, "config", &old, &size);
        if (err == ESP_OK && config_migrate_from_v4_blob(cfg, &old)) {
            save_after_load = true;
            source = "v4-migrated";
        } else {
            config_set_defaults(cfg);
            source = "bad-v4";
        }
    } else if (err == ESP_OK && size == sizeof(watch_lite_config_v1_t)) {
        watch_lite_config_v1_t old = {0};
        size = sizeof(old);
        err = nvs_get_blob(handle, "config", &old, &size);
        config_set_defaults(cfg);
        if (err == ESP_OK && old.magic == CONFIG_MAGIC && old.version == 1u) {
            copy_string(cfg->wifi_ssid, sizeof(cfg->wifi_ssid), old.wifi_ssid);
            copy_string(cfg->wifi_password, sizeof(cfg->wifi_password), old.wifi_password);
            cfg->auto_sleep_s = old.auto_sleep_s;
            config_sanitize(cfg);
            save_after_load = true;
            source = "v1-migrated";
        } else {
            source = "bad-v1";
        }
    } else if (err == ESP_OK && size == sizeof(watch_lite_config_v3_t)) {
        watch_lite_config_v3_t old = {0};
        size = sizeof(old);
        err = nvs_get_blob(handle, "config", &old, &size);
        config_set_defaults(cfg);
        if (err == ESP_OK && old.magic == CONFIG_MAGIC && old.version == 3u) {
            copy_string(cfg->wifi_ssid, sizeof(cfg->wifi_ssid), old.wifi_ssid);
            copy_string(cfg->wifi_password, sizeof(cfg->wifi_password), old.wifi_password);
            copy_string(cfg->server_url, sizeof(cfg->server_url), old.server_url);
            copy_string(cfg->api_key, sizeof(cfg->api_key), old.api_key);
            copy_string(cfg->model, sizeof(cfg->model), old.model);
            copy_string(cfg->market_provider, sizeof(cfg->market_provider), old.market_provider);
            copy_string(cfg->starter_prompt, sizeof(cfg->starter_prompt), old.starter_prompt);
            copy_string(cfg->static_ip, sizeof(cfg->static_ip), old.static_ip);
            copy_string(cfg->static_netmask, sizeof(cfg->static_netmask), old.static_netmask);
            copy_string(cfg->static_gateway, sizeof(cfg->static_gateway), old.static_gateway);
            copy_string(cfg->dns1, sizeof(cfg->dns1), old.dns1);
            copy_string(cfg->dns2, sizeof(cfg->dns2), old.dns2);
            copy_string(cfg->proxy_host, sizeof(cfg->proxy_host), old.proxy_host);
            cfg->proxy_port = old.proxy_port;
            cfg->auto_sleep_s = old.auto_sleep_s;
            config_sanitize(cfg);
            save_after_load = true;
            source = "v3-migrated";
        } else {
            source = "bad-v3";
        }
    } else if (err == ESP_OK && size == sizeof(watch_lite_config_v3_full_t)) {
        watch_lite_config_v3_full_t old = {0};
        size = sizeof(old);
        err = nvs_get_blob(handle, "config", &old, &size);
        config_set_defaults(cfg);
        if (err == ESP_OK && old.magic == CONFIG_MAGIC && old.version == 3u) {
            copy_string(cfg->wifi_ssid, sizeof(cfg->wifi_ssid), old.wifi_ssid);
            copy_string(cfg->wifi_password, sizeof(cfg->wifi_password), old.wifi_password);
            copy_string(cfg->server_url, sizeof(cfg->server_url), old.server_url);
            copy_string(cfg->api_key, sizeof(cfg->api_key), old.api_key);
            copy_string(cfg->model, sizeof(cfg->model), old.model);
            copy_string(cfg->market_provider, sizeof(cfg->market_provider), old.market_provider);
            copy_string(cfg->starter_prompt, sizeof(cfg->starter_prompt), old.starter_prompt);
            copy_string(cfg->static_ip, sizeof(cfg->static_ip), old.static_ip);
            copy_string(cfg->static_netmask, sizeof(cfg->static_netmask), old.static_netmask);
            copy_string(cfg->static_gateway, sizeof(cfg->static_gateway), old.static_gateway);
            copy_string(cfg->dns1, sizeof(cfg->dns1), old.dns1);
            copy_string(cfg->dns2, sizeof(cfg->dns2), old.dns2);
            copy_string(cfg->proxy_host, sizeof(cfg->proxy_host), old.proxy_host);
            cfg->proxy_port = old.proxy_port;
            cfg->auto_sleep_s = old.auto_sleep_s;
            cfg->brightness_percent = old.brightness_percent;
            cfg->motion_wake_enabled = old.motion_wake_enabled;
            cfg->motion_wake_threshold_mg = old.motion_wake_threshold_mg;
            config_sanitize(cfg);
            save_after_load = true;
            source = "v3-full-migrated";
        } else {
            source = "bad-v3-full";
        }
    } else {
        if (err == ESP_OK && size >= offsetof(watch_lite_config_prefix_t, wifi_password)) {
            uint8_t *raw = calloc(1, size);
            if (raw) {
                size_t raw_size = size;
                esp_err_t raw_err = nvs_get_blob(handle, "config", raw, &raw_size);
                if (raw_err == ESP_OK && config_migrate_from_prefix_blob(cfg, raw, raw_size)) {
                    save_after_load = true;
                    source = "prefix-migrated";
                    ESP_LOGW(TAG, "config load: recovered unknown blob size=%u", (unsigned)raw_size);
                } else {
                    ESP_LOGW(TAG, "config load: unknown blob rejected err=%s size=%u",
                             esp_err_to_name(raw_err), (unsigned)raw_size);
                    config_set_defaults(cfg);
                    source = "unknown-defaults";
                }
                free(raw);
            } else {
                ESP_LOGW(TAG, "config load: no memory for unknown blob size=%u", (unsigned)size);
                config_set_defaults(cfg);
                source = "unknown-no-mem";
            }
        } else {
            ESP_LOGW(TAG, "config load: no compatible blob err=%s size=%u",
                     esp_err_to_name(err), (unsigned)size);
            config_set_defaults(cfg);
        }
    }
    nvs_close(handle);

    if (save_after_load) {
        esp_err_t save_err = config_save(cfg);
        ESP_LOGI(TAG, "config load: migrated source=%s save=%s",
                 source, esp_err_to_name(save_err));
    } else {
        ESP_LOGI(TAG, "config load: source=%s err=%s size=%u",
                 source, esp_err_to_name(err), (unsigned)size);
    }
    return err;
}

static esp_err_t config_save(const watch_lite_config_t *cfg)
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(APP_NS, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return err;
    }
    err = nvs_set_blob(handle, "config", cfg, sizeof(*cfg));
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err;
}

static int wifi_preferred_slot_load(void)
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(APP_NS, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return -1;
    }
    int32_t slot = -1;
    err = nvs_get_i32(handle, "wifi_pref_slot", &slot);
    nvs_close(handle);
    if (err != ESP_OK || slot < 0 || slot >= WIFI_SLOT_COUNT) {
        return -1;
    }
    return (int)slot;
}

static void log_config_summary(void)
{
    const ai_profile_t *profile = ai_profile_active();
    ESP_LOGI(TAG, "config summary: wifi_slots=%d preferred=%d auto_sleep=%d ai=%s api=%s model=%s",
             configured_wifi_slot_count(), g_app.preferred_wifi_slot,
             g_app.cfg.auto_sleep_s, profile->name,
             g_app.cfg.api_key[0] ? "set" : "empty",
             g_app.cfg.model);
    for (int slot = 0; slot < WIFI_SLOT_COUNT; slot++) {
        const char *ssid = config_wifi_ssid_const(&g_app.cfg, slot);
        if (ssid && ssid[0]) {
            ESP_LOGI(TAG, "config wifi slot %d ssid=%s", slot + 1, ssid);
        }
    }
}

static esp_err_t wifi_preferred_slot_save(int slot)
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(APP_NS, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return err;
    }
    if (slot >= 0 && slot < WIFI_SLOT_COUNT) {
        err = nvs_set_i32(handle, "wifi_pref_slot", slot);
    } else {
        err = nvs_erase_key(handle, "wifi_pref_slot");
        if (err == ESP_ERR_NVS_NOT_FOUND) {
            err = ESP_OK;
        }
    }
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err;
}

static esp_err_t market_cache_load(void)
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(APP_NS, NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return err;
    }

