akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    market_cache_t cache = {0};
    size_t size = sizeof(cache);
    err = nvs_get_blob(handle, "market_cache", &cache, &size);
    nvs_close(handle);
    if (err != ESP_OK) {
        return err;
    }
    if (size != sizeof(cache) ||
        cache.magic != MARKET_CACHE_MAGIC ||
        cache.version != MARKET_CACHE_VERSION ||
        cache.row_count != MARKET_ROW_COUNT) {
        return ESP_ERR_INVALID_VERSION;
    }

    for (int i = 0; i < MARKET_ROW_COUNT; i++) {
        copy_string(g_app.market_rows[i].price, sizeof(g_app.market_rows[i].price), cache.price[i]);
        copy_string(g_app.market_rows[i].change, sizeof(g_app.market_rows[i].change), cache.change[i]);
    }
    copy_string(g_app.market_time, sizeof(g_app.market_time), cache.market_time);
    g_app.market_polled_once = true;
    copy_string(g_app.market_status, sizeof(g_app.market_status), "CACHE");
    return ESP_OK;
}

static esp_err_t market_cache_save(void)
{
    market_cache_t cache = {
        .magic = MARKET_CACHE_MAGIC,
        .version = MARKET_CACHE_VERSION,
        .row_count = MARKET_ROW_COUNT,
    };
    copy_string(cache.market_time, sizeof(cache.market_time), g_app.market_time);
    for (int i = 0; i < MARKET_ROW_COUNT; i++) {
        copy_string(cache.price[i], sizeof(cache.price[i]), g_app.market_rows[i].price);
        copy_string(cache.change[i], sizeof(cache.change[i]), g_app.market_rows[i].change);
    }

    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(APP_NS, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        return err;
    }
    err = nvs_set_blob(handle, "market_cache", &cache, sizeof(cache));
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    return err;
}

static void make_ap_ssid(void)
{
    uint8_t mac[6] = {0};
    esp_read_mac(mac, ESP_MAC_WIFI_SOFTAP);
    snprintf(g_app.ap_ssid, sizeof(g_app.ap_ssid), "WatchLite-%02X%02X", mac[4], mac[5]);
}

static void app_state_set_defaults(void)
{
    g_app.preferred_wifi_slot = wifi_preferred_slot_load();
    g_app.pending_wifi_slot = -1;
    g_app.active_wifi_slot = -1;
    for (int i = 0; i < MARKET_ROW_COUNT; i++) {
        copy_string(g_app.market_rows[i].price, sizeof(g_app.market_rows[i].price), "--");
        copy_string(g_app.market_rows[i].change, sizeof(g_app.market_rows[i].change), "--");
    }
    copy_string(g_app.market_status, sizeof(g_app.market_status), "IDLE");
    copy_string(g_app.market_time, sizeof(g_app.market_time), "--:--");
    g_app.chart_selected_index = -1;
    g_app.chart_point_count = 0;
    copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "Tap row");
    copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
    copy_string(g_app.ai_hint, sizeof(g_app.ai_hint), "");
    copy_string(g_app.ai_user, sizeof(g_app.ai_user), "");
    copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), "中文显示正常\n点说话开始");
    update_ai_dialog_text();
    g_app.battery_percent = -1;
    g_app.battery_mv = 0;
}

static void restore_display_brightness(void)
{
    int brightness = g_app.cfg.brightness_percent;
    if (brightness < 5 || brightness > 100) {
        brightness = DEFAULT_BRIGHTNESS_PERCENT;
    }
    (void)bsp_display_brightness_set(brightness);
}

static bool elapsed_ms_exceeded(int64_t started_us, int timeout_ms)
{
    if (started_us <= 0 || timeout_ms <= 0) {
        return false;
    }
    return (esp_timer_get_time() - started_us) > ((int64_t)timeout_ms * 1000LL);
}

static void force_clear_stale_busy_flags(void)
{
    if (g_app.market_refresh_inflight &&
        elapsed_ms_exceeded(g_app.market_task_started_us, MARKET_BUSY_STALE_MS)) {
        ESP_LOGW(TAG, "sleep: clearing stale market task");
        g_app.market_refresh_inflight = false;
        g_app.market_task_started_us = 0;
    }
    if (g_app.chart_inflight &&
        elapsed_ms_exceeded(g_app.chart_task_started_us, CHART_BUSY_STALE_MS)) {
        ESP_LOGW(TAG, "sleep: clearing stale chart task");
        g_app.chart_inflight = false;
        g_app.chart_task_started_us = 0;
    }
    if (g_app.ai_start_inflight &&
        elapsed_ms_exceeded(g_app.ai_task_started_us, BUSY_SLEEP_FORCE_RESET_MS)) {
        ESP_LOGW(TAG, "sleep: clearing stale voice task");
        g_app.ai_task_generation++;
        g_app.ai_start_inflight = false;
        g_app.ai_playback_inflight = false;
        g_app.ai_tts_stop_requested = true;
        g_app.ai_task_started_us = 0;
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
    }
    if (g_app.ai_tts_inflight &&
        elapsed_ms_exceeded(g_app.tts_task_started_us, TTS_BUSY_STALE_MS)) {
        ESP_LOGW(TAG, "sleep: clearing stale tts task");
        g_app.ai_tts_inflight = false;
        g_app.ai_playback_inflight = false;
        g_app.ai_tts_stop_requested = true;
        g_app.tts_task_started_us = 0;
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
    }
}

static void enter_low_power_sleep(void)
{
    (void)bsp_display_backlight_off();
    wifi_sta_disconnect_when_idle();
    gpio_set_level(BSP_POWER_AMP_IO, 0);
    ESP_LOGI(TAG, "sleep: screen off, WiFi STA disconnected, config AP=%d", g_app.ap_config_enabled);
}

static bool app_busy_for_sleep(void)
{
    force_clear_stale_busy_flags();
    return g_app.market_refresh_inflight ||
           g_app.chart_inflight ||
           g_app.ai_start_inflight ||
           g_app.ai_tts_inflight ||
           g_app.ai_playback_inflight;
}

static void audio_shutdown_for_sleep(void)
{
    bool lock_taken = false;
    if (g_app.audio_lock) {
        lock_taken = xSemaphoreTake(g_app.audio_lock, pdMS_TO_TICKS(200)) == pdTRUE;
    }
    if (lock_taken && g_app.mic_dev) {
        (void)esp_codec_dev_close(g_app.mic_dev);
    }
    if (lock_taken && g_app.speaker_dev) {
        (void)esp_codec_dev_close(g_app.speaker_dev);
    }
    gpio_set_level(BSP_POWER_AMP_IO, 0);
    gpio_reset_pin(BSP_I2S_MCLK);
    gpio_reset_pin(BSP_I2S_SCLK);
    gpio_reset_pin(BSP_I2S_LCLK);
    gpio_reset_pin(BSP_I2S_DOUT);
    gpio_reset_pin(BSP_I2S_DSIN);
    pmic_audio_power_set(false);
    if (lock_taken) {
        xSemaphoreGive(g_app.audio_lock);
    }
}

static void imu_shutdown_for_sleep(void)
{
    if (g_app.imu_present && g_app.imu_dev) {
        (void)imu_write_reg(QMI8658_CTRL7, QMI8658_CTRL7_DISABLE);
        g_app.imu_baseline_valid = false;
    }
}

static void pmic_prepare_for_deep_sleep(void)
{
    if (!g_app.pmic_present) {
        return;
    }
    (void)pmic_update_bits(AXP2101_CHARGE_GAUGE_WDT_CTRL, AXP2101_GAUGE_ENABLE_MASK, 0);
    (void)pmic_update_bits(AXP2101_LDO_ONOFF_CTRL0, AXP2101_ALDO2_ENABLE_MASK, 0);
}

static void pmic_audio_power_set(bool enabled)
{
    if (!g_app.pmic_present) {
        return;
    }
    (void)pmic_update_bits(AXP2101_LDO_ONOFF_CTRL0, AXP2101_ALDO2_ENABLE_MASK,
                           enabled ? AXP2101_ALDO2_ENABLE_MASK : 0);
    if (enabled) {
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

static void enter_poweroff_now(void)
{
    if (!AUTO_POWEROFF_ON_SLEEP) {
        return;
    }
    if (!g_app.pmic_present) {
        ESP_LOGW(TAG, "poweroff: PMIC not present, staying in standby");
        return;
    }
    if (g_app.deep_sleep_armed) {
        return;
    }

