akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    g_app.deep_sleep_armed = true;
    (void)market_cache_save();

    uint8_t status1 = 0;
    uint8_t status2 = 0;
    bool vbus_good = pmic_read_reg(AXP2101_STATUS1, &status1) == ESP_OK && (status1 & (1u << 5));
    bool vbus_in = pmic_read_reg(AXP2101_STATUS2, &status2) == ESP_OK && ((status2 & (1u << 3)) == 0) && vbus_good;
    ESP_LOGI(TAG, "poweroff: idle timeout, AXP2101 soft shutdown vbus=%d status1=0x%02X status2=0x%02X",
             vbus_in ? 1 : 0, status1, status2);

    esp_err_t err = pmic_update_bits(AXP2101_COMMON_CONFIG,
                                     AXP2101_SOFT_SHUTDOWN_MASK,
                                     AXP2101_SOFT_SHUTDOWN_MASK);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "poweroff: shutdown request failed: %s", esp_err_to_name(err));
        g_app.deep_sleep_armed = false;
        return;
    }

    vTaskDelay(pdMS_TO_TICKS(2000));
    ESP_LOGW(TAG, "poweroff: PMIC did not cut power, entering deep sleep fallback");
    enter_deep_sleep_now();
}

static void wifi_shutdown_for_deep_sleep(void)
{
    wifi_sta_disconnect_now();
    if (!g_app.wifi_started) {
        return;
    }
    (void)esp_wifi_stop();
    (void)esp_wifi_deinit();
    g_app.wifi_started = false;
    g_app.sta_connected = false;
    g_app.pending_wifi_slot = -1;
    g_app.active_wifi_slot = -1;
    g_app.sta_ip[0] = '\0';
}

static void hardware_prepare_for_deep_sleep(void)
{
    ESP_LOGI(TAG, "deep sleep: hardware shutdown");
    g_app.ai_tts_stop_requested = true;
    audio_shutdown_for_sleep();
    imu_shutdown_for_sleep();
    (void)bsp_display_panel_sleep();
    wifi_shutdown_for_deep_sleep();
    pmic_prepare_for_deep_sleep();
#if CONFIG_BT_ENABLED
    (void)esp_bt_controller_disable();
    (void)esp_bt_controller_deinit();
#endif
}

static void configure_power_button_gpio_for_sleep(void)
{
    gpio_config_t power_btn = {
        .pin_bit_mask = 1ULL << DEEP_SLEEP_POWER_BUTTON_GPIO,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    esp_err_t err = gpio_config(&power_btn);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "deep sleep: power key gpio config failed: %s", esp_err_to_name(err));
    }
    (void)gpio_sleep_sel_dis(DEEP_SLEEP_POWER_BUTTON_GPIO);

    if (rtc_gpio_is_valid_gpio(DEEP_SLEEP_POWER_BUTTON_GPIO)) {
        (void)rtc_gpio_hold_dis(DEEP_SLEEP_POWER_BUTTON_GPIO);
        err = rtc_gpio_init(DEEP_SLEEP_POWER_BUTTON_GPIO);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "deep sleep: power key rtc init failed: %s", esp_err_to_name(err));
        }
        (void)rtc_gpio_set_direction(DEEP_SLEEP_POWER_BUTTON_GPIO, RTC_GPIO_MODE_INPUT_ONLY);
        (void)rtc_gpio_set_direction_in_sleep(DEEP_SLEEP_POWER_BUTTON_GPIO, RTC_GPIO_MODE_INPUT_ONLY);
        (void)rtc_gpio_pullup_dis(DEEP_SLEEP_POWER_BUTTON_GPIO);
        (void)rtc_gpio_pulldown_dis(DEEP_SLEEP_POWER_BUTTON_GPIO);
    }
    (void)esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_ON);
    ESP_LOGI(TAG, "deep sleep: PWR wake gpio=%d level=%d",
             (int)DEEP_SLEEP_POWER_BUTTON_GPIO, gpio_get_level(DEEP_SLEEP_POWER_BUTTON_GPIO));
}

static void enter_deep_sleep_now(void)
{
#if DEEP_SLEEP_ENABLED
    ESP_LOGI(TAG, "deep sleep: entering, PWR key wake only");
    g_app.deep_sleep_armed = true;
    (void)market_cache_save();
    hardware_prepare_for_deep_sleep();
    (void)esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
    (void)esp_sleep_disable_ext1_wakeup_io(0);
    configure_power_button_gpio_for_sleep();
    esp_err_t wake_err = esp_sleep_enable_ext1_wakeup_io(1ULL << DEEP_SLEEP_POWER_BUTTON_GPIO,
                                                         ESP_EXT1_WAKEUP_ANY_HIGH);
    if (wake_err != ESP_OK) {
        ESP_LOGW(TAG, "deep sleep: PWR ext1 wake failed: %s", esp_err_to_name(wake_err));
    }
    vTaskDelay(pdMS_TO_TICKS(100));
    esp_deep_sleep_start();
#endif
}

static void set_sleeping(bool sleeping)
{
    g_app.last_activity_us = esp_timer_get_time();
    if (g_app.screen_sleeping == sleeping) {
        return;
    }
    g_app.screen_sleeping = sleeping;
    if (sleeping) {
        g_app.deep_sleep_armed = false;
        g_app.screen_sleep_started_us = g_app.last_activity_us;
        enter_low_power_sleep();
        enter_poweroff_now();
    } else {
        g_app.deep_sleep_armed = false;
        g_app.screen_sleep_started_us = 0;
        restore_display_brightness();
        battery_update_once();
        home_market_refresh_async();
    }
}

static void wake_screen_for_input(void)
{
    g_app.last_activity_us = esp_timer_get_time();
    if (!g_app.screen_sleeping) {
        return;
    }
    g_app.screen_sleeping = false;
    g_app.deep_sleep_armed = false;
    g_app.screen_sleep_started_us = 0;
    restore_display_brightness();
    battery_update_once();
}

static void activity_event_cb(lv_event_t *event)
{
    lv_event_code_t code = lv_event_get_code(event);
    if (code == LV_EVENT_PRESSED || code == LV_EVENT_CLICKED || code == LV_EVENT_VALUE_CHANGED) {
        if (g_app.screen_sleeping) {
            g_app.last_activity_us = esp_timer_get_time();
            return;
        }
        g_app.last_activity_us = esp_timer_get_time();
    }
}

static lv_obj_t *make_label_font(lv_obj_t *parent, const char *text, int x, int y, int w,
                                 uint32_t color, const lv_font_t *font)
{
    lv_obj_t *label = lv_label_create(parent);
    lv_obj_set_pos(label, x, y);
    lv_obj_set_width(label, w);
    lv_obj_set_style_text_color(label, lv_color_hex(color), 0);
    lv_obj_set_style_text_font(label, font, 0);
    lv_label_set_long_mode(label, LV_LABEL_LONG_DOT);
    lv_label_set_text(label, text);
    return label;
}

static lv_obj_t *make_wrap_label_font(lv_obj_t *parent, const char *text, int x, int y,
                                      int w, int h, uint32_t color, const lv_font_t *font)
{
    lv_obj_t *label = lv_label_create(parent);
    lv_obj_set_pos(label, x, y);
    lv_obj_set_size(label, w, h);
    lv_obj_set_style_text_color(label, lv_color_hex(color), 0);
    lv_obj_set_style_text_font(label, font, 0);
    lv_obj_set_style_text_line_space(label, 2, 0);
    lv_label_set_long_mode(label, LV_LABEL_LONG_WRAP);
    lv_label_set_text(label, text);
    return label;
}

static lv_obj_t *make_button(lv_obj_t *parent, const char *text, int x, int y, int w, int h,
                             uint32_t bg, lv_event_cb_t cb, void *user_data)
{
    lv_obj_t *btn = lv_btn_create(parent);
    lv_obj_set_pos(btn, x, y);
    lv_obj_set_size(btn, w, h);
    lv_obj_set_style_radius(btn, 999, 0);
    lv_obj_set_style_bg_color(btn, lv_color_hex(bg), 0);
    lv_obj_set_style_shadow_width(btn, 0, 0);
    lv_obj_add_event_cb(btn, activity_event_cb, LV_EVENT_ALL, NULL);
    if (cb) {
        lv_obj_add_event_cb(btn, cb, LV_EVENT_CLICKED, user_data);
    }

    lv_obj_t *label = lv_label_create(btn);
    lv_obj_set_style_text_color(label, lv_color_hex(0xF4F7FF), 0);
    lv_obj_set_style_text_font(label,
                               text_has_non_ascii(text) ? AI_BUTTON_FONT : &lv_font_montserrat_20,
                               0);
    lv_label_set_text(label, text);
    lv_obj_center(label);
    return btn;
}

static void home_action_cb(lv_event_t *event)
{
    uintptr_t action = (uintptr_t)lv_event_get_user_data(event);
    if (g_app.screen_sleeping) {
        wake_screen_for_input();
    }
    if (action == 1) {
        ESP_LOGI(TAG, "home action: show AI");
        ui_show_ai();
    } else if (action >= 100 && action < 100 + AI_PROFILE_COUNT) {
        int profile_index = (int)(action - 100);
        ESP_LOGI(TAG, "home action: AI profile %d", profile_index);
        ai_profile_apply(profile_index, true);
        ui_show_ai();
    }
}

static void ai_action_cb(lv_event_t *event)
{
    uintptr_t action = (uintptr_t)lv_event_get_user_data(event);
    if (g_app.screen_sleeping) {
        wake_screen_for_input();
    }
    if (action == 1) {
        ESP_LOGI(TAG, "AI action: back");
        ui_show_home();
    } else if (action == 2) {
        ESP_LOGI(TAG, "AI action: talk");
        (void)direct_ai_start_request("ui");
    }
}

