akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static void market_row_action_cb(lv_event_t *event)
{
    if (g_app.screen_sleeping) {
        return;
    }
    int row_index = (int)(uintptr_t)lv_event_get_user_data(event);
    ui_show_chart(row_index);
    chart_refresh_async(row_index);
}

static void chart_action_cb(lv_event_t *event)
{
    uintptr_t action = (uintptr_t)lv_event_get_user_data(event);
    if (g_app.screen_sleeping) {
        return;
    }
    if (action == 1) {
        ui_show_home();
    } else if (action == 2 && g_app.chart_selected_index >= 0) {
        chart_refresh_async(g_app.chart_selected_index);
    }
}

static void chart_plot_draw_cb(lv_event_t *event)
{
    if (lv_event_get_code(event) != LV_EVENT_DRAW_MAIN) {
        return;
    }

    lv_obj_t *obj = lv_event_get_target_obj(event);
    lv_layer_t *layer = lv_event_get_layer(event);
    if (!obj || !layer) {
        return;
    }

    lv_area_t coords;
    lv_obj_get_coords(obj, &coords);
    int w = lv_area_get_width(&coords);
    int h = lv_area_get_height(&coords);
    const int pad = 8;

    lv_draw_line_dsc_t grid;
    lv_draw_line_dsc_init(&grid);
    grid.color = lv_color_hex(0x1B2638);
    grid.opa = LV_OPA_70;
    grid.width = 1;
    for (int i = 1; i < 4; i++) {
        int y = coords.y1 + pad + ((h - pad * 2) * i) / 4;
        grid.p1.x = coords.x1 + pad;
        grid.p1.y = y;
        grid.p2.x = coords.x2 - pad;
        grid.p2.y = y;
        lv_draw_line(layer, &grid);
    }

    if (g_app.chart_point_count < 2) {
        return;
    }

    double min_v = g_app.chart_values[0];
    double max_v = g_app.chart_values[0];
    for (int i = 1; i < g_app.chart_point_count; i++) {
        double v = g_app.chart_values[i];
        if (v < min_v) {
            min_v = v;
        }
        if (v > max_v) {
            max_v = v;
        }
    }
    if (max_v <= min_v) {
        max_v = min_v + 1.0;
    }

    bool up = g_app.chart_values[g_app.chart_point_count - 1] >= g_app.chart_values[0];
    lv_draw_line_dsc_t line;
    lv_draw_line_dsc_init(&line);
    line.color = lv_color_hex(up ? 0x46E09F : 0xFF5C5C);
    line.opa = LV_OPA_COVER;
    line.width = 3;
    line.round_start = 1;
    line.round_end = 1;

    int prev_x = 0;
    int prev_y = 0;
    for (int i = 0; i < g_app.chart_point_count; i++) {
        double ratio = (g_app.chart_values[i] - min_v) / (max_v - min_v);
        int x = coords.x1 + pad + ((w - pad * 2) * i) / (g_app.chart_point_count - 1);
        int y = coords.y2 - pad - (int)((h - pad * 2) * ratio);
        if (i > 0) {
            line.p1.x = prev_x;
            line.p1.y = prev_y;
            line.p2.x = x;
            line.p2.y = y;
            lv_draw_line(layer, &line);
        }
        prev_x = x;
        prev_y = y;
    }
}

static void ui_create_home(void)
{
    lv_obj_t *scr = lv_obj_create(NULL);
    lv_obj_remove_style_all(scr);
    lv_obj_set_style_bg_color(scr, lv_color_hex(0x05080E), 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);
    lv_obj_add_event_cb(scr, activity_event_cb, LV_EVENT_ALL, NULL);

    g_app.time_label = make_label_font(scr, "--:--", 56, 14, 82, 0xEAF1FF, &lv_font_montserrat_20);
    g_app.wifi_label = make_label_font(scr, "W-", 178, 14, 42, 0x91A3BF, &lv_font_montserrat_20);
    g_app.battery_label = make_label_font(scr, "--%", 224, 14, 54, 0x91A3BF, &lv_font_montserrat_20);
    g_app.market_time_label = make_label_font(scr, "--:--", 290, 14, 82, 0x91A3BF, &lv_font_montserrat_20);

    const int row_y0 = 52;
    const int row_h = 30;
    for (int i = 0; i < MARKET_ROW_COUNT; i++) {
        int y = row_y0 + i * row_h;
        g_app.market_rows[i].code_label = make_label_font(scr, MARKET_DEFS[i].code, 80, y, 64,
                                                          MARKET_DEFS[i].color, &lv_font_montserrat_24);
        g_app.market_rows[i].price_label = make_label_font(scr, "--", 146, y, 94,
                                                           0x91A3BF, &lv_font_montserrat_24);
        g_app.market_rows[i].change_label = make_label_font(scr, "--", 244, y, 96,
                                                            0x91A3BF, &lv_font_montserrat_24);
        g_app.market_rows[i].hit_obj = lv_obj_create(scr);
        lv_obj_remove_style_all(g_app.market_rows[i].hit_obj);
        lv_obj_set_pos(g_app.market_rows[i].hit_obj, 76, y - 1);
        lv_obj_set_size(g_app.market_rows[i].hit_obj, 268, row_h);
        lv_obj_add_flag(g_app.market_rows[i].hit_obj, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_add_event_cb(g_app.market_rows[i].hit_obj, activity_event_cb, LV_EVENT_ALL, NULL);
        lv_obj_add_event_cb(g_app.market_rows[i].hit_obj, market_row_action_cb, LV_EVENT_CLICKED,
                            (void *)(uintptr_t)i);
    }

    const int btn_y_top = 72;
    const int btn_y_mid = 238;
    const int btn_y_bottom = 404;
    const int side_btn_h = 42;
    make_button(scr, "GPT", 8, btn_y_top, 62, side_btn_h, 0x2255A4, home_action_cb, (void *)100);
    make_button(scr, "Gem", 8, btn_y_mid, 62, side_btn_h, 0x167C7B, home_action_cb, (void *)101);
    make_button(scr, "豆包", 8, btn_y_bottom, 62, side_btn_h, 0x8A4E1D, home_action_cb, (void *)102);
    make_button(scr, "DS", 340, btn_y_top, 62, side_btn_h, 0x1B5D78, home_action_cb, (void *)103);
    make_button(scr, "千问", 340, btn_y_mid, 62, side_btn_h, 0x5C4FA3, home_action_cb, (void *)104);
    make_button(scr, "自定", 340, btn_y_bottom, 62, side_btn_h, 0x31523E, home_action_cb, (void *)105);
    g_app.ai_profile_label = NULL;
    g_app.home_screen = scr;
}

static void ui_create_ai(void)
{
    lv_obj_t *scr = lv_obj_create(NULL);
    lv_obj_remove_style_all(scr);
    lv_obj_set_style_bg_color(scr, lv_color_hex(0x03070D), 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);
    lv_obj_add_event_cb(scr, activity_event_cb, LV_EVENT_ALL, NULL);

    lv_obj_t *box = lv_obj_create(scr);
    lv_obj_remove_style_all(box);
    lv_obj_set_pos(box, 20, 56);
    lv_obj_set_size(box, 370, 340);
    lv_obj_set_style_bg_color(box, lv_color_hex(0x07111F), 0);
    lv_obj_set_style_bg_opa(box, LV_OPA_COVER, 0);
    lv_obj_set_style_radius(box, 18, 0);
    lv_obj_set_style_border_width(box, 1, 0);
    lv_obj_set_style_border_color(box, lv_color_hex(0x1B2638), 0);
    lv_obj_add_event_cb(box, activity_event_cb, LV_EVENT_ALL, NULL);

    g_app.ai_title_label = make_label_font(scr, "AI", 24, 18, 160, 0x46E09F, AI_DIALOG_FONT);
    g_app.ai_state_label = make_wrap_label_font(scr, "状态：READY", 34, 68, 342, 42,
                                                0xD8E7FF, AI_DIALOG_FONT);
    lv_obj_set_style_text_line_space(g_app.ai_state_label, 4, 0);
    g_app.ai_reply_container = lv_obj_create(scr);
    lv_obj_remove_style_all(g_app.ai_reply_container);
    lv_obj_set_pos(g_app.ai_reply_container, 34, 118);
    lv_obj_set_size(g_app.ai_reply_container, 342, 276);
    lv_obj_set_style_bg_opa(g_app.ai_reply_container, LV_OPA_TRANSP, 0);
    lv_obj_set_style_pad_all(g_app.ai_reply_container, 0, 0);
    lv_obj_set_scroll_dir(g_app.ai_reply_container, LV_DIR_VER);
    lv_obj_set_scrollbar_mode(g_app.ai_reply_container, LV_SCROLLBAR_MODE_AUTO);
    lv_obj_add_flag(g_app.ai_reply_container, LV_OBJ_FLAG_SCROLLABLE);
    lv_obj_add_event_cb(g_app.ai_reply_container, activity_event_cb, LV_EVENT_ALL, NULL);

    g_app.ai_reply_label = make_wrap_label_font(
        g_app.ai_reply_container,
        "中文显示正常\n点说话开始",
        0, 0, 342, LV_SIZE_CONTENT,
        0xF8FBFF, AI_DIALOG_FONT);
    lv_obj_set_style_text_line_space(g_app.ai_reply_label, 8, 0);
    lv_obj_set_style_bg_color(g_app.ai_reply_label, lv_color_hex(0x07111F), 0);
    lv_obj_set_style_bg_opa(g_app.ai_reply_label, LV_OPA_TRANSP, 0);

    make_button(scr, "返回", 34, 428, 140, 54, 0x223148, ai_action_cb, (void *)1);
    make_button(scr, "说话", 236, 428, 140, 54, 0x1C755C, ai_action_cb, (void *)2);
    g_app.ai_screen = scr;
}

