akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static void ui_create_chart(void)
{
    lv_obj_t *scr = lv_obj_create(NULL);
    lv_obj_remove_style_all(scr);
    lv_obj_set_style_bg_color(scr, lv_color_hex(0x03070D), 0);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);
    lv_obj_add_event_cb(scr, activity_event_cb, LV_EVENT_ALL, NULL);

    g_app.chart_title_label = make_label_font(scr, "--", 38, 24, 92, 0xEAF1FF, &lv_font_montserrat_28);
    g_app.chart_price_label = make_label_font(scr, "-- --", 132, 31, 244, 0x91A3BF, &lv_font_montserrat_20);

    g_app.chart_plot_obj = lv_obj_create(scr);
    lv_obj_remove_style_all(g_app.chart_plot_obj);
    lv_obj_set_pos(g_app.chart_plot_obj, 30, 76);
    lv_obj_set_size(g_app.chart_plot_obj, 350, 330);
    lv_obj_set_style_bg_color(g_app.chart_plot_obj, lv_color_hex(0x07111F), 0);
    lv_obj_set_style_bg_opa(g_app.chart_plot_obj, LV_OPA_COVER, 0);
    lv_obj_set_style_radius(g_app.chart_plot_obj, 18, 0);
    lv_obj_set_style_border_width(g_app.chart_plot_obj, 1, 0);
    lv_obj_set_style_border_color(g_app.chart_plot_obj, lv_color_hex(0x1B2638), 0);
    lv_obj_add_event_cb(g_app.chart_plot_obj, chart_plot_draw_cb, LV_EVENT_DRAW_MAIN, NULL);

    g_app.chart_hint_label = make_label_font(scr, "Tap refresh", 42, 410, 300, 0x91A3BF, &lv_font_montserrat_20);

    make_button(scr, "BACK", 46, 442, 112, 42, 0x223148, chart_action_cb, (void *)1);
    make_button(scr, "REF", 252, 442, 112, 42, 0x1C755C, chart_action_cb, (void *)2);
    g_app.chart_screen = scr;
}

static void ui_show_home(void)
{
    if (g_app.home_screen) {
        lv_screen_load(g_app.home_screen);
        ui_refresh_locked();
    }
}

static void ui_show_ai(void)
{
    if (g_app.ai_screen) {
        lv_screen_load(g_app.ai_screen);
        ui_refresh_locked();
    }
}

static void ui_show_chart(int row_index)
{
    if (row_index < 0 || row_index >= MARKET_ROW_COUNT || !g_app.chart_screen) {
        return;
    }
    g_app.chart_selected_index = row_index;
    g_app.chart_point_count = 0;
    copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "Loading");
    lv_screen_load(g_app.chart_screen);
    ui_refresh_locked();
}

static const char *ui_current_screen_name(void)
{
    lv_obj_t *active = lv_screen_active();
    if (active == g_app.home_screen) {
        return "home";
    }
    if (active == g_app.ai_screen) {
        return "ai";
    }
    if (active == g_app.chart_screen) {
        return "chart";
    }
    return "unknown";
}

static uint32_t market_value_color(const char *change)
{
    if (!change || change[0] == '\0' || strcmp(change, "--") == 0) {
        return 0x91A3BF;
    }
    return change[0] == '-' ? 0xFF5C5C : 0x46E09F;
}

static uint32_t battery_value_color(void)
{
    if (g_app.battery_percent < 0) {
        return 0x91A3BF;
    }
    if (g_app.battery_percent <= 15) {
        return 0xFF5C5C;
    }
    if (g_app.battery_percent <= 30) {
        return 0xF7C873;
    }
    return 0xEAF1FF;
}

static void set_market_value_label(lv_obj_t *label, const char *text, const char *change)
{
    if (!label) {
        return;
    }
    lv_label_set_text(label, text);
    lv_obj_set_style_text_color(label, lv_color_hex(market_value_color(change)), 0);
}

static void ui_refresh_locked(void)
{
    if (g_app.wifi_label) {
        const char *state = g_app.sta_connected ? "W+" :
                            (g_app.ap_started ? "AP" : (g_app.sta_configured ? "W-" : "AP"));
        lv_label_set_text(g_app.wifi_label, state);
        lv_obj_set_style_text_color(g_app.wifi_label,
                                    lv_color_hex(g_app.sta_connected ? 0x46E09F : 0x91A3BF), 0);
    }

    if (g_app.time_label) {
        time_t now = 0;
        struct tm tm_now = {0};
        time(&now);
        localtime_r(&now, &tm_now);
        if (tm_now.tm_year >= 120) {
            lv_label_set_text_fmt(g_app.time_label, "%02d:%02d", tm_now.tm_hour, tm_now.tm_min);
        } else {
            lv_label_set_text(g_app.time_label, "--:--");
        }
    }

    if (g_app.market_time_label) {
        lv_label_set_text(g_app.market_time_label, g_app.market_time);
    }

    if (g_app.battery_label) {
        if (g_app.battery_percent >= 0) {
            lv_label_set_text_fmt(g_app.battery_label, "%d%%", g_app.battery_percent);
        } else {
            lv_label_set_text(g_app.battery_label, "--%");
        }
        lv_obj_set_style_text_color(g_app.battery_label, lv_color_hex(battery_value_color()), 0);
    }

    for (int i = 0; i < MARKET_ROW_COUNT; i++) {
        market_row_t *row = &g_app.market_rows[i];
        set_market_value_label(row->price_label, row->price, row->change);
        set_market_value_label(row->change_label, row->change, row->change);
    }
    if (g_app.market_status_label) {
        lv_label_set_text(g_app.market_status_label, g_app.market_status);
    }

    const ai_profile_t *active_profile = ai_profile_active();
    if (g_app.ai_profile_label) {
        lv_label_set_text(g_app.ai_profile_label, active_profile->name);
    }

    if (g_app.status_label) {
        if (g_app.sta_connected) {
            lv_label_set_text_fmt(g_app.status_label, "%s", g_app.sta_ip);
        } else if (g_app.ap_started) {
            lv_label_set_text_fmt(g_app.status_label, "%s 192.168.4.1", g_app.ap_ssid);
        } else {
            lv_label_set_text(g_app.status_label, "BOOT 2s = CFG AP");
        }
    }
    if (g_app.ai_state_label || g_app.ai_reply_label) {
        if (g_app.ai_title_label) {
            lv_label_set_text(g_app.ai_title_label, active_profile->name);
        }
        if (g_app.ai_state_label) {
            lv_label_set_text_fmt(g_app.ai_state_label, "状态：%s",
                                  g_app.ai_state[0] ? g_app.ai_state : "READY");
        }
        if (g_app.ai_reply_label) {
            char reply_text[sizeof(g_app.ai_reply)] = {0};
            display_safe_text_copy(g_app.ai_reply, reply_text, sizeof(reply_text));
            lv_label_set_long_mode(g_app.ai_reply_label, LV_LABEL_LONG_WRAP);
            lv_label_set_text(g_app.ai_reply_label,
                              reply_text[0] ? reply_text : "中文显示正常\n点说话开始");
            lv_obj_set_height(g_app.ai_reply_label, LV_SIZE_CONTENT);
        }
    }

    if (g_app.chart_selected_index >= 0 && g_app.chart_selected_index < MARKET_ROW_COUNT) {
        int i = g_app.chart_selected_index;
        market_row_t *row = &g_app.market_rows[i];
        if (g_app.chart_title_label) {
            lv_label_set_text(g_app.chart_title_label, MARKET_DEFS[i].code);
            lv_obj_set_style_text_color(g_app.chart_title_label, lv_color_hex(MARKET_DEFS[i].color), 0);
        }
        if (g_app.chart_price_label) {
            lv_label_set_text_fmt(g_app.chart_price_label, "%s %s", row->price, row->change);
            lv_obj_set_style_text_color(g_app.chart_price_label,
                                        lv_color_hex(market_value_color(row->change)), 0);
        }
        if (g_app.chart_hint_label) {
            lv_label_set_text(g_app.chart_hint_label, g_app.chart_hint);
        }
        if (g_app.chart_plot_obj) {
            lv_obj_invalidate(g_app.chart_plot_obj);
        }
    }
}

