akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static void ui_refresh_now(void)
{
    if (!g_app.ui_ready) {
        return;
    }
    if (!bsp_display_lock(100)) {
        return;
    }
    ui_refresh_locked();
    bsp_display_unlock();
}

static bool enter_button_light_sleep_if_ready(void)
{
    if (!BUTTON_LIGHT_SLEEP_ENABLED || DEEP_SLEEP_AUTO_ENTER ||
        !g_app.screen_sleeping || app_busy_for_sleep() ||
        g_app.boot_wake_refresh_pending || g_app.boot_config_ap_pending) {
        return false;
    }

    if (gpio_get_level(DEEP_SLEEP_BOOT_BUTTON_GPIO) == 0) {
        g_app.last_activity_us = esp_timer_get_time();
        g_app.boot_wake_refresh_pending = true;
        return true;
    }

    esp_err_t err = gpio_wakeup_enable(DEEP_SLEEP_BOOT_BUTTON_GPIO, GPIO_INTR_LOW_LEVEL);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "light sleep: BOOT gpio wake enable failed: %s", esp_err_to_name(err));
        return false;
    }
    err = esp_sleep_enable_gpio_wakeup();
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "light sleep: gpio wake source enable failed: %s", esp_err_to_name(err));
        (void)gpio_wakeup_disable(DEEP_SLEEP_BOOT_BUTTON_GPIO);
        return false;
    }

    ESP_LOGI(TAG, "light sleep: entering, BOOT/GPIO%d low wakes",
             (int)DEEP_SLEEP_BOOT_BUTTON_GPIO);
    int64_t before_us = esp_timer_get_time();
    err = esp_light_sleep_start();
    int64_t slept_ms = (esp_timer_get_time() - before_us) / 1000;

    (void)gpio_wakeup_disable(DEEP_SLEEP_BOOT_BUTTON_GPIO);
    (void)esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_GPIO);

    if (err != ESP_OK) {
        ESP_LOGW(TAG, "light sleep: start failed: %s", esp_err_to_name(err));
        return false;
    }

    ESP_LOGI(TAG, "light sleep: woke cause=%d boot=%d slept=%lldms",
             (int)esp_sleep_get_wakeup_cause(),
             gpio_get_level(DEEP_SLEEP_BOOT_BUTTON_GPIO),
             (long long)slept_ms);
    g_app.last_activity_us = esp_timer_get_time();
    g_app.boot_wake_refresh_pending = true;
    return true;
}

static void ui_timer_cb(lv_timer_t *timer)
{
    (void)timer;
    process_pending_button_requests();
    ui_refresh_now();

    int64_t now_us = esp_timer_get_time();
    if (!g_app.screen_sleeping && !app_busy_for_sleep() &&
        (g_app.last_market_refresh_us == 0 ||
         now_us - g_app.last_market_refresh_us >= (int64_t)MARKET_REFRESH_INTERVAL_S * 1000000LL)) {
        home_market_refresh_async();
    }

    int auto_sleep_s = g_app.cfg.auto_sleep_s;
    if (auto_sleep_s > 0 && g_app.ai_screen && lv_screen_active() == g_app.ai_screen &&
        auto_sleep_s < AI_SCREEN_MIN_AUTO_SLEEP_S) {
        auto_sleep_s = AI_SCREEN_MIN_AUTO_SLEEP_S;
    }
    if (!g_app.screen_sleeping && auto_sleep_s > 0 && !app_busy_for_sleep()) {
        int64_t idle_us = now_us - g_app.last_activity_us;
        if (idle_us >= (int64_t)auto_sleep_s * 1000000LL) {
            set_sleeping(true);
        }
    }

    if (DEEP_SLEEP_AUTO_ENTER && g_app.screen_sleeping && !g_app.deep_sleep_armed && !app_busy_for_sleep()) {
        int64_t sleep_start_us = g_app.screen_sleep_started_us ? g_app.screen_sleep_started_us : g_app.last_activity_us;
        int64_t sleep_us = now_us - sleep_start_us;
        if (sleep_us >= (int64_t)DEEP_SLEEP_AFTER_SCREEN_OFF_S * 1000000LL) {
            enter_deep_sleep_now();
        }
    }

    if (enter_button_light_sleep_if_ready()) {
        process_pending_button_requests();
        ui_refresh_now();
    }
}

static esp_err_t pmic_write_reg(uint8_t reg, uint8_t value)
{
    if (!g_app.pmic_dev) {
        return ESP_ERR_INVALID_STATE;
    }
    uint8_t data[2] = {reg, value};
    return i2c_master_transmit(g_app.pmic_dev, data, sizeof(data), 100);
}

static esp_err_t pmic_read_reg(uint8_t reg, uint8_t *value)
{
    if (!g_app.pmic_dev || !value) {
        return ESP_ERR_INVALID_ARG;
    }
    return i2c_master_transmit_receive(g_app.pmic_dev, &reg, 1, value, 1, 100);
}

static esp_err_t pmic_update_bits(uint8_t reg, uint8_t mask, uint8_t value)
{
    uint8_t old_value = 0;
    esp_err_t err = pmic_read_reg(reg, &old_value);
    if (err != ESP_OK) {
        return err;
    }

    uint8_t new_value = (old_value & (uint8_t)~mask) | (value & mask);
    if (new_value == old_value) {
        return ESP_OK;
    }
    return pmic_write_reg(reg, new_value);
}

static esp_err_t pmic_init(void)
{
    g_app.pmic_present = false;
    g_app.battery_present = false;
    g_app.battery_percent = -1;
    g_app.battery_mv = 0;

    if (!g_app.pmic_dev) {
        i2c_master_bus_handle_t bus = bsp_i2c_get_handle();
        if (!bus) {
            ESP_LOGW(TAG, "PMIC I2C bus unavailable");
            return ESP_ERR_INVALID_STATE;
        }

        i2c_device_config_t dev_cfg = {
            .dev_addr_length = I2C_ADDR_BIT_LEN_7,
            .device_address = AXP2101_ADDR,
            .scl_speed_hz = 400000,
        };
        esp_err_t err = i2c_master_bus_add_device(bus, &dev_cfg, &g_app.pmic_dev);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "AXP2101 add failed: %s", esp_err_to_name(err));
            return err;
        }
    }

    uint8_t chip_id = 0;
    esp_err_t err = pmic_read_reg(AXP2101_CHIP_ID, &chip_id);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "AXP2101 probe failed: %s", esp_err_to_name(err));
        return err;
    }

    if (chip_id != AXP2101_CHIP_ID_VALUE_A && chip_id != AXP2101_CHIP_ID_VALUE_B) {
        ESP_LOGW(TAG, "AXP2101 unexpected chip id 0x%02X; trying battery registers", chip_id);
    } else {
        ESP_LOGI(TAG, "AXP2101 found id=0x%02X", chip_id);
    }

    g_app.pmic_present = true;
    (void)pmic_update_bits(AXP2101_BAT_DET_CTRL, AXP2101_BAT_TYPE_DET_MASK,
                           AXP2101_BAT_TYPE_DET_MASK);
    (void)pmic_update_bits(AXP2101_CHARGE_GAUGE_WDT_CTRL, AXP2101_GAUGE_ENABLE_MASK,
                           AXP2101_GAUGE_ENABLE_MASK);
    return ESP_OK;
}

static esp_err_t pmic_read_battery(void)
{
    if (!g_app.pmic_present) {
        g_app.battery_present = false;
        g_app.battery_percent = -1;
        g_app.battery_mv = 0;
        return ESP_ERR_INVALID_STATE;
    }

    uint8_t status = 0;
    esp_err_t status_err = pmic_read_reg(AXP2101_STATUS1, &status);
    if (status_err == ESP_OK) {
        g_app.battery_present = (status & AXP2101_BAT_PRESENT_MASK) != 0;
    }

    uint8_t percent_reg = 0;
    esp_err_t err = pmic_read_reg(AXP2101_BAT_PERCENT_DATA, &percent_reg);
    if (err != ESP_OK) {
        g_app.battery_percent = -1;
        ESP_LOGW(TAG, "battery percent read failed: %s", esp_err_to_name(err));
        return err;
    }

    int percent = percent_reg & 0x7F;
    if (percent > 100 || percent_reg == 0xFF) {
        percent = -1;
    }
    g_app.battery_percent = percent;

    uint8_t vbat_h = 0;
    uint8_t vbat_l = 0;
    if (pmic_read_reg(AXP2101_ADC_DATA_VBAT_H, &vbat_h) == ESP_OK &&
        pmic_read_reg(AXP2101_ADC_DATA_VBAT_L, &vbat_l) == ESP_OK) {
        g_app.battery_mv = ((int)(vbat_h & AXP2101_GAUGE_VBAT_H_MASK) << 8) | vbat_l;
    } else {
        g_app.battery_mv = 0;
    }

    g_app.last_battery_read_us = esp_timer_get_time();
    ESP_LOGI(TAG, "battery wake-read percent=%d raw=0x%02X mv=%d present=%d status=0x%02X",
             g_app.battery_percent, percent_reg, g_app.battery_mv, g_app.battery_present, status);
    return ESP_OK;
}

static void battery_update_once(void)
{
    if (!g_app.pmic_present) {
        return;
    }
    (void)pmic_read_battery();
    ui_refresh_now();
}

