akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static esp_err_t imu_write_reg(uint8_t reg, uint8_t value)
{
    if (!g_app.imu_dev) {
        return ESP_ERR_INVALID_STATE;
    }
    uint8_t data[2] = {reg, value};
    return i2c_master_transmit(g_app.imu_dev, data, sizeof(data), 100);
}

static esp_err_t imu_read_reg(uint8_t reg, uint8_t *value)
{
    if (!g_app.imu_dev || !value) {
        return ESP_ERR_INVALID_ARG;
    }
    return i2c_master_transmit_receive(g_app.imu_dev, &reg, 1, value, 1, 100);
}

static esp_err_t imu_read_regs(uint8_t reg, uint8_t *data, size_t len)
{
    if (!g_app.imu_dev || !data || len == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    return i2c_master_transmit_receive(g_app.imu_dev, &reg, 1, data, len, 100);
}

static esp_err_t imu_add_device(uint8_t address)
{
    i2c_master_bus_handle_t bus = bsp_i2c_get_handle();
    if (!bus) {
        return ESP_ERR_INVALID_STATE;
    }

    i2c_device_config_t dev_cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = address,
        .scl_speed_hz = 400000,
    };
    return i2c_master_bus_add_device(bus, &dev_cfg, &g_app.imu_dev);
}

static esp_err_t imu_try_address(uint8_t address)
{
    if (g_app.imu_dev) {
        (void)i2c_master_bus_rm_device(g_app.imu_dev);
        g_app.imu_dev = NULL;
    }

    esp_err_t err = imu_add_device(address);
    if (err != ESP_OK) {
        return err;
    }

    uint8_t id = 0;
    err = imu_read_reg(QMI8658_WHOAMI, &id);
    if (err != ESP_OK || id != QMI8658_WHOAMI_VALUE) {
        ESP_LOGW(TAG, "QMI8658 probe 0x%02X failed err=%s id=0x%02X",
                 address, esp_err_to_name(err), id);
        (void)i2c_master_bus_rm_device(g_app.imu_dev);
        g_app.imu_dev = NULL;
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "QMI8658 found at 0x%02X", address);
    return ESP_OK;
}

static esp_err_t imu_init(void)
{
    esp_err_t err = imu_try_address(QMI8658_ADDR_LOW);
    if (err != ESP_OK) {
        err = imu_try_address(QMI8658_ADDR_HIGH);
    }
    if (err != ESP_OK) {
        g_app.imu_present = false;
        return err;
    }

    (void)imu_write_reg(QMI8658_RESET, 0xB0);
    vTaskDelay(pdMS_TO_TICKS(20));

    uint8_t reset_result = 0;
    for (int i = 0; i < 20; i++) {
        if (imu_read_reg(QMI8658_RST_RESULT, &reset_result) == ESP_OK &&
            reset_result == QMI8658_RST_RESULT_VALUE) {
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    WL_RETURN_ON_ERROR(imu_write_reg(QMI8658_CTRL1, 0x40), "imu ctrl1 failed");
    WL_RETURN_ON_ERROR(imu_write_reg(QMI8658_CTRL2, 0x2D), "imu accel cfg failed");
    WL_RETURN_ON_ERROR(imu_write_reg(QMI8658_CTRL5, 0x00), "imu lpf cfg failed");
    WL_RETURN_ON_ERROR(imu_write_reg(QMI8658_CTRL7, 0x01), "imu accel enable failed");

    g_app.imu_present = true;
    g_app.imu_baseline_valid = false;
    ESP_LOGI(TAG, "QMI8658 motion wake ready");
    return ESP_OK;
}

static esp_err_t imu_read_accel_raw(int16_t raw[3])
{
    uint8_t data[6] = {0};
    esp_err_t err = imu_read_regs(QMI8658_ACCEL_X_L, data, sizeof(data));
    if (err != ESP_OK) {
        return err;
    }

    raw[0] = (int16_t)((uint16_t)data[1] << 8 | data[0]);
    raw[1] = (int16_t)((uint16_t)data[3] << 8 | data[2]);
    raw[2] = (int16_t)((uint16_t)data[5] << 8 | data[4]);
    return ESP_OK;
}

static int raw_delta_to_mg(int delta_raw)
{
    if (delta_raw < 0) {
        delta_raw = -delta_raw;
    }
    return (delta_raw * QMI8658_ACCEL_RANGE_MG) / 32768;
}

static bool motion_is_strong_shake(const int16_t raw[3])
{
    int max_delta_mg = 0;
    for (int i = 0; i < 3; i++) {
        int delta_mg = raw_delta_to_mg((int)raw[i] - (int)g_app.imu_last_raw[i]);
        if (delta_mg > max_delta_mg) {
            max_delta_mg = delta_mg;
        }
    }

    memcpy(g_app.imu_last_raw, raw, sizeof(g_app.imu_last_raw));
    return max_delta_mg >= g_app.cfg.motion_wake_threshold_mg;
}

static void motion_task(void *arg)
{
    (void)arg;
    if (imu_init() != ESP_OK) {
        ESP_LOGW(TAG, "QMI8658 unavailable; motion wake disabled");
    }

    while (true) {
        if (!g_app.imu_present || !g_app.cfg.motion_wake_enabled) {
            vTaskDelay(pdMS_TO_TICKS(2000));
            continue;
        }

        if (!g_app.screen_sleeping) {
            g_app.imu_baseline_valid = false;
            vTaskDelay(pdMS_TO_TICKS(500));
            continue;
        }

        int16_t raw[3] = {0};
        if (imu_read_accel_raw(raw) != ESP_OK) {
            g_app.imu_baseline_valid = false;
            vTaskDelay(pdMS_TO_TICKS(500));
            continue;
        }

        if (!g_app.imu_baseline_valid) {
            memcpy(g_app.imu_last_raw, raw, sizeof(g_app.imu_last_raw));
            g_app.imu_baseline_valid = true;
            vTaskDelay(pdMS_TO_TICKS(MOTION_WAKE_POLL_MS));
            continue;
        }

        int64_t now = esp_timer_get_time();
        if (now - g_app.last_motion_wake_us > MOTION_WAKE_COOLDOWN_US &&
            motion_is_strong_shake(raw)) {
            g_app.last_motion_wake_us = now;
            g_app.imu_baseline_valid = false;
            set_sleeping(false);
            ui_refresh_now();
        }

        vTaskDelay(pdMS_TO_TICKS(MOTION_WAKE_POLL_MS));
    }
}

static void motion_task_start_once(void)
{
    if (!g_app.cfg.motion_wake_enabled) {
        ESP_LOGI(TAG, "motion wake disabled; IMU task not started");
        return;
    }
    if (g_app.motion_worker_started) {
        return;
    }
    g_app.motion_worker_started = true;
    xTaskCreate(motion_task, "motion_wake", 4096, NULL, 3, NULL);
}

static void power_button_gpio_prepare_active(void)
{
    if (rtc_gpio_is_valid_gpio(DEEP_SLEEP_POWER_BUTTON_GPIO)) {
        (void)rtc_gpio_hold_dis(DEEP_SLEEP_POWER_BUTTON_GPIO);
        (void)rtc_gpio_deinit(DEEP_SLEEP_POWER_BUTTON_GPIO);
    }
    (void)gpio_sleep_sel_dis(DEEP_SLEEP_POWER_BUTTON_GPIO);
    gpio_config_t power_btn = {
        .pin_bit_mask = 1ULL << DEEP_SLEEP_POWER_BUTTON_GPIO,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    (void)gpio_config(&power_btn);
}

