akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static void handle_button_wake_refresh(void)
{
    int64_t now_us = esp_timer_get_time();
    if (g_app.screen_sleeping) {
        wake_screen_for_input();
    } else {
        g_app.last_activity_us = now_us;
    }
    if (g_app.chart_screen && lv_screen_active() == g_app.chart_screen &&
        g_app.chart_selected_index >= 0) {
        chart_refresh_async(g_app.chart_selected_index);
    } else {
        ui_show_home();
        home_market_refresh_async();
    }
}

static void process_pending_button_requests(void)
{
    bool config_ap_pending = g_app.boot_config_ap_pending;
    bool wake_refresh_pending = g_app.boot_wake_refresh_pending;

    if (!config_ap_pending && !wake_refresh_pending) {
        return;
    }

    g_app.boot_config_ap_pending = false;
    g_app.boot_wake_refresh_pending = false;

    if (config_ap_pending) {
        ESP_LOGI(TAG, "boot button: handle config AP on UI task");
        g_app.last_activity_us = esp_timer_get_time();
        if (g_app.screen_sleeping) {
            wake_screen_for_input();
        }
        (void)wifi_enable_config_ap();
        return;
    }

    ESP_LOGI(TAG, "boot button: handle wake and refresh on UI task");
    handle_button_wake_refresh();
}

static void boot_button_task(void *arg)
{
    (void)arg;
    gpio_config_t boot_btn = {
        .pin_bit_mask = 1ULL << DEEP_SLEEP_BOOT_BUTTON_GPIO,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    (void)gpio_config(&boot_btn);

    int last_level = gpio_get_level(DEEP_SLEEP_BOOT_BUTTON_GPIO);
    ESP_LOGI(TAG, "boot button: active gpio=%d initial=%d",
             (int)DEEP_SLEEP_BOOT_BUTTON_GPIO, last_level);
    int64_t press_start_us = 0;
    bool long_press_handled = false;
    while (true) {
        int level = gpio_get_level(DEEP_SLEEP_BOOT_BUTTON_GPIO);
        if (last_level == 1 && level == 0) {
            press_start_us = esp_timer_get_time();
            long_press_handled = false;
        } else if (level == 0 && press_start_us > 0 && !long_press_handled) {
            int64_t held_ms = (esp_timer_get_time() - press_start_us) / 1000;
            if (held_ms >= BOOT_LONG_PRESS_CONFIG_AP_MS) {
                long_press_handled = true;
                g_app.last_activity_us = esp_timer_get_time();
                ESP_LOGI(TAG, "boot button: long press, request config AP");
                g_app.boot_config_ap_pending = true;
            }
        } else if (last_level == 0 && level == 1) {
            int64_t now_us = esp_timer_get_time();
            int64_t held_ms = press_start_us > 0 ? (now_us - press_start_us) / 1000 : 0;
            press_start_us = 0;
            if (!long_press_handled && held_ms >= 60) {
                ESP_LOGI(TAG, "boot button: wake and refresh requested");
                g_app.last_activity_us = now_us;
                g_app.boot_wake_refresh_pending = true;
            }
        }
        last_level = level;
        vTaskDelay(pdMS_TO_TICKS(60));
    }
}

static void boot_button_task_start_once(void)
{
    xTaskCreate(boot_button_task, "boot_button", 3072, NULL, 3, NULL);
}

static const char *wake_cause_name(esp_sleep_wakeup_cause_t cause)
{
    switch (cause) {
    case ESP_SLEEP_WAKEUP_UNDEFINED:
        return "undefined";
    case ESP_SLEEP_WAKEUP_EXT0:
        return "ext0";
    case ESP_SLEEP_WAKEUP_EXT1:
        return "ext1";
    case ESP_SLEEP_WAKEUP_TIMER:
        return "timer";
    case ESP_SLEEP_WAKEUP_TOUCHPAD:
        return "touch";
    case ESP_SLEEP_WAKEUP_ULP:
        return "ulp";
    case ESP_SLEEP_WAKEUP_GPIO:
        return "gpio";
    case ESP_SLEEP_WAKEUP_UART:
        return "uart";
    default:
        return "other";
    }
}

static void log_wakeup_reason(void)
{
    esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
    uint64_t ext1_mask = esp_sleep_get_ext1_wakeup_status();
    ESP_LOGI(TAG, "wake cause: %s(%d) ext1=0x%llx boot=%d pwr=%d",
             wake_cause_name(cause), (int)cause, (unsigned long long)ext1_mask,
             gpio_get_level(DEEP_SLEEP_BOOT_BUTTON_GPIO),
             gpio_get_level(DEEP_SLEEP_POWER_BUTTON_GPIO));
}

static void update_ai_dialog_text(void)
{
    const char *state = g_app.ai_state[0] ? g_app.ai_state : "READY";
    const char *state_cn = "就绪";
    if (strcmp(state, "REC") == 0) {
        state_cn = "录音";
    } else if (strcmp(state, "NET") == 0) {
        state_cn = "联网";
    } else if (strcmp(state, "VOICE") == 0 || strcmp(state, "STT") == 0) {
        state_cn = "识别";
    } else if (strcmp(state, "AI") == 0) {
        state_cn = "思考";
    } else if (strcmp(state, "TTS") == 0) {
        state_cn = "合成";
    } else if (strcmp(state, "PLAY") == 0) {
        state_cn = "播放";
    } else if (strstr(state, "ERR") || strcmp(state, "ERROR") == 0) {
        state_cn = "错误";
    } else if (g_app.ai_tts_inflight || g_app.ai_playback_inflight) {
        state_cn = "语音";
    }

    char user_text[sizeof(g_app.ai_user)] = {0};
    char reply_text[sizeof(g_app.ai_reply)] = {0};
    display_safe_text_copy(g_app.ai_user, user_text, sizeof(user_text));
    display_safe_text_copy(g_app.ai_reply, reply_text, sizeof(reply_text));
    if (!reply_text[0]) {
        copy_string(reply_text, sizeof(reply_text), "就绪");
    }

    if (g_app.ai_user[0]) {
        snprintf(g_app.ai_dialog, sizeof(g_app.ai_dialog),
                 "状态：%s\n你：%s\n答：%s", state_cn, user_text, reply_text);
    } else {
        snprintf(g_app.ai_dialog, sizeof(g_app.ai_dialog),
                 "状态：%s\n答：%s", state_cn, reply_text);
    }
}

static void log_voice_task_heap(const char *reason)
{
    ESP_LOGE(TAG,
             "voice: %s int_free=%u int_largest=%u psram_free=%u psram_largest=%u",
             reason ? reason : "task create failed",
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT),
             (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT),
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT),
             (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
}

static esp_err_t direct_http_event_cb(esp_http_client_event_t *event)
{
    if (event->event_id == HTTP_EVENT_ON_DATA && event->user_data && event->data && event->data_len > 0) {
        http_buffer_t *buffer = (http_buffer_t *)event->user_data;
        if (!buffer->data || buffer->capacity <= 0) {
            return ESP_OK;
        }
        int copy_len = event->data_len;
        int remain = buffer->capacity - buffer->len - 1;
        if (copy_len > remain) {
            copy_len = remain;
        }
        if (copy_len > 0) {
            memcpy(buffer->data + buffer->len, event->data, copy_len);
            buffer->len += copy_len;
            buffer->data[buffer->len] = '\0';
        }
    }
    return ESP_OK;
}

static char *http_body_alloc(size_t size)
{
    char *body = heap_caps_calloc(1, size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!body) {
        body = heap_caps_calloc(1, size, MALLOC_CAP_8BIT);
    }
    return body;
}

static void http_body_free(char *body)
{
    if (body) {
        heap_caps_free(body);
    }
}

static void log_http_failure(const char *url, esp_err_t err, int status,
                             int sock_errno, int tls_err, int tls_flags)
{
    ESP_LOGW(TAG,
             "http failed err=%s status=%d errno=%d tls=%d flags=0x%x url=%s int_free=%u int_largest=%u psram_free=%u psram_largest=%u",
             esp_err_to_name(err), status, sock_errno, tls_err, tls_flags,
             url ? url : "",
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT),
             (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT),
             (unsigned)heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT),
             (unsigned)heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
}

static bool proxy_parse_url_target(const char *url, char *scheme, size_t scheme_size,
                                   char *host, size_t host_size, int *port)
{
    if (!url || !scheme || scheme_size == 0 || !host || host_size == 0 || !port) {
        return false;
    }
    scheme[0] = '\0';
    host[0] = '\0';
    *port = 0;

    const char *scheme_end = strstr(url, "://");
    if (!scheme_end || scheme_end == url) {
        return false;
    }
    size_t scheme_len = (size_t)(scheme_end - url);
    if (scheme_len >= scheme_size) {
        return false;
    }
    memcpy(scheme, url, scheme_len);
    scheme[scheme_len] = '\0';

    const char *p = scheme_end + 3;
    const char *host_start = p;
    const char *host_end = p;
    if (*host_start == '[') {
        host_start++;
        host_end = strchr(host_start, ']');
        if (!host_end) {
            return false;
        }
        p = host_end + 1;
    } else {
        while (*host_end && *host_end != '/' && *host_end != '?' && *host_end != '#' &&
               *host_end != ':') {
            host_end++;
        }
        p = host_end;
    }
    size_t host_len = (size_t)(host_end - host_start);
    if (host_len == 0 || host_len >= host_size) {
        return false;
    }
    memcpy(host, host_start, host_len);
    host[host_len] = '\0';

    if (*p == ':') {
        p++;
        int parsed_port = 0;
        while (isdigit((unsigned char)*p)) {
            parsed_port = parsed_port * 10 + (*p - '0');
            p++;
        }
        if (parsed_port <= 0 || parsed_port > 65535) {
            return false;
        }
        *port = parsed_port;
    } else if (strcasecmp(scheme, "https") == 0) {
        *port = 443;
    } else if (strcasecmp(scheme, "http") == 0) {
        *port = 80;
    } else {
        return false;
    }
    return true;
}

static bool proxy_host_is_private_or_local(const char *host)
{
    if (!host || host[0] == '\0') {
        return true;
    }
    if (strcasecmp(host, "localhost") == 0 ||
        strcmp(host, "127.0.0.1") == 0 ||
        strcmp(host, "::1") == 0) {
        return true;
    }
    int a = 0, b = 0, c = 0, d = 0;
    char tail = '\0';
    if (sscanf(host, "%d.%d.%d.%d%c", &a, &b, &c, &d, &tail) == 4 &&
        a >= 0 && a <= 255 && b >= 0 && b <= 255 &&
        c >= 0 && c <= 255 && d >= 0 && d <= 255) {
        if (a == 10 || a == 127 || a == 0 || a == 169) {
            return true;
        }
        if (a == 192 && b == 168) {
            return true;
        }
        if (a == 172 && b >= 16 && b <= 31) {
            return true;
        }
    }
    size_t len = strlen(host);
    return len >= 6 && strcasecmp(host + len - 6, ".local") == 0;
}

static bool proxy_should_use_for_url(const char *url, bool *use_tls_out)
{
    if (use_tls_out) {
        *use_tls_out = false;
    }
#if !HTTP_PROXY_FEATURE_ENABLED
    (void)url;
    return false;
#endif
    if (g_app.cfg.proxy_host[0] == '\0' || g_app.cfg.proxy_port <= 0) {
        return false;
    }

    char scheme[8] = {0};
    char host[128] = {0};
    int port = 0;
    if (!proxy_parse_url_target(url, scheme, sizeof(scheme), host, sizeof(host), &port)) {
        return false;
    }
    if (proxy_host_is_private_or_local(host)) {
        return false;
    }
    if (strcasecmp(scheme, "https") == 0) {
        if (use_tls_out) {
            *use_tls_out = true;
        }
        return true;
    }
    if (strcasecmp(scheme, "http") == 0) {
        return true;
    }
    return false;
}

static void proxy_set_socket_timeout(int sockfd, int timeout_ms)
{
    if (sockfd < 0) {
        return;
    }
    struct timeval tv = {
        .tv_sec = timeout_ms > 0 ? timeout_ms / 1000 : 10,
        .tv_usec = timeout_ms > 0 ? (timeout_ms % 1000) * 1000 : 0,
    };
    (void)setsockopt(sockfd, SOL_SOCKET, SO_RCVTIMEO, &tv, sizeof(tv));
    (void)setsockopt(sockfd, SOL_SOCKET, SO_SNDTIMEO, &tv, sizeof(tv));
}

static int proxy_tcp_connect(const char *host, int port, int timeout_ms)
{
    if (!host || host[0] == '\0' || port <= 0 || port > 65535) {
        errno = EINVAL;
        return -1;
    }

    char port_text[8] = {0};
    snprintf(port_text, sizeof(port_text), "%d", port);
    struct addrinfo hints = {
        .ai_family = AF_INET,
        .ai_socktype = SOCK_STREAM,
    };
    struct addrinfo *result = NULL;
    int gai = getaddrinfo(host, port_text, &hints, &result);
    if (gai != 0 || !result) {
        ESP_LOGW(TAG, "proxy: resolve failed host=%s gai=%d", host, gai);
        errno = ENOENT;
        return -1;
    }

    int connect_timeout = timeout_ms > 0 ? timeout_ms : 10000;
    int sockfd = -1;
    for (struct addrinfo *ai = result; ai; ai = ai->ai_next) {
        sockfd = socket(ai->ai_family, ai->ai_socktype, ai->ai_protocol);
        if (sockfd < 0) {
            continue;
        }

