akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
        int flags = fcntl(sockfd, F_GETFL, 0);
        if (flags >= 0) {
            (void)fcntl(sockfd, F_SETFL, flags | O_NONBLOCK);
        }
        int rc = connect(sockfd, ai->ai_addr, ai->ai_addrlen);
        if (rc < 0 && errno == EINPROGRESS) {
            fd_set write_set;
            FD_ZERO(&write_set);
            FD_SET(sockfd, &write_set);
            struct timeval tv = {
                .tv_sec = connect_timeout / 1000,
                .tv_usec = (connect_timeout % 1000) * 1000,
            };
            rc = select(sockfd + 1, NULL, &write_set, NULL, &tv);
            if (rc > 0) {
                int sock_error = 0;
                socklen_t sock_error_len = sizeof(sock_error);
                if (getsockopt(sockfd, SOL_SOCKET, SO_ERROR,
                               &sock_error, &sock_error_len) == 0) {
                    if (sock_error == 0) {
                        rc = 0;
                    } else {
                        errno = sock_error;
                        rc = -1;
                    }
                } else {
                    rc = -1;
                }
            } else {
                errno = (rc == 0) ? ETIMEDOUT : errno;
                rc = -1;
            }
        }
        if (flags >= 0) {
            (void)fcntl(sockfd, F_SETFL, flags);
        }
        if (rc == 0) {
            proxy_set_socket_timeout(sockfd, timeout_ms);
            break;
        }
        close(sockfd);
        sockfd = -1;
    }
    freeaddrinfo(result);
    return sockfd;
}

static int proxy_socket_write_all(int sockfd, const char *data, size_t len)
{
    size_t written = 0;
    while (written < len) {
        ssize_t rc = send(sockfd, data + written, len - written, 0);
        if (rc < 0) {
            if (errno == EINTR) {
                continue;
            }
            return -1;
        }
        if (rc == 0) {
            errno = ECONNRESET;
            return -1;
        }
        written += (size_t)rc;
    }
    return 0;
}

static int proxy_wait_for_headers(int sockfd, char *response, size_t response_size)
{
    if (!response || response_size == 0) {
        errno = EINVAL;
        return -1;
    }
    size_t len = 0;
    response[0] = '\0';
    while (len + 1 < response_size) {
        ssize_t rc = recv(sockfd, response + len, 1, 0);
        if (rc < 0) {
            if (errno == EINTR) {
                continue;
            }
            return -1;
        }
        if (rc == 0) {
            errno = ECONNRESET;
            return -1;
        }
        len += (size_t)rc;
        response[len] = '\0';
        if (len >= 4 && strstr(response, "\r\n\r\n")) {
            return (int)len;
        }
    }
    errno = EMSGSIZE;
    return -1;
}

static int proxy_transport_connect(esp_transport_handle_t transport,
                                   const char *host, int port, int timeout_ms)
{
    http_proxy_transport_ctx_t *ctx = esp_transport_get_context_data(transport);
    if (!ctx || !host || host[0] == '\0' || port <= 0) {
        errno = EINVAL;
        return -1;
    }

    ctx->sockfd = proxy_tcp_connect(ctx->proxy_host, ctx->proxy_port, timeout_ms);
    if (ctx->sockfd < 0) {
        ESP_LOGW(TAG, "proxy: connect failed proxy=%s:%d errno=%d",
                 ctx->proxy_host, ctx->proxy_port, errno);
        return -1;
    }

    char connect_req[256] = {0};
    snprintf(connect_req, sizeof(connect_req),
             "CONNECT %s:%d HTTP/1.1\r\n"
             "Host: %s:%d\r\n"
             "Proxy-Connection: close\r\n"
             "User-Agent: WatchLite/1\r\n\r\n",
             host, port, host, port);
    if (proxy_socket_write_all(ctx->sockfd, connect_req, strlen(connect_req)) != 0) {
        ESP_LOGW(TAG, "proxy: CONNECT write failed errno=%d", errno);
        close(ctx->sockfd);
        ctx->sockfd = -1;
        return -1;
    }

    char response[384] = {0};
    if (proxy_wait_for_headers(ctx->sockfd, response, sizeof(response)) < 0) {
        ESP_LOGW(TAG, "proxy: CONNECT response failed errno=%d", errno);
        close(ctx->sockfd);
        ctx->sockfd = -1;
        return -1;
    }
    if (!strstr(response, " 200 ") && !strstr(response, " 200\r\n")) {
        ESP_LOGW(TAG, "proxy: CONNECT rejected host=%s:%d response=%.80s",
                 host, port, response);
        close(ctx->sockfd);
        ctx->sockfd = -1;
        errno = ECONNREFUSED;
        return -1;
    }

    if (ctx->use_tls) {
        esp_tls_t *tls = esp_tls_init();
        if (!tls) {
            close(ctx->sockfd);
            ctx->sockfd = -1;
            errno = ENOMEM;
            return -1;
        }
        esp_tls_cfg_t tls_cfg = {
            .timeout_ms = timeout_ms,
            .addr_family = ESP_TLS_AF_INET,
        };
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
        tls_cfg.crt_bundle_attach = esp_crt_bundle_attach;
#endif
        (void)esp_tls_set_conn_sockfd(tls, ctx->sockfd);
        (void)esp_tls_set_conn_state(tls, ESP_TLS_CONNECTING);
        int tls_ret = esp_tls_conn_new_sync(host, (int)strlen(host), port, &tls_cfg, tls);
        if (tls_ret != 1) {
            ESP_LOGW(TAG, "proxy: TLS handshake failed host=%s:%d ret=%d",
                     host, port, tls_ret);
            (void)esp_tls_conn_destroy(tls);
            ctx->sockfd = -1;
            errno = ECONNABORTED;
            return -1;
        }
        ctx->tls = tls;
    }

    ESP_LOGI(TAG, "proxy: connected %s:%d via %s:%d%s",
             host, port, ctx->proxy_host, ctx->proxy_port,
             ctx->use_tls ? " tls" : "");
    return 0;
}

static int proxy_transport_read(esp_transport_handle_t transport,
                                char *buffer, int len, int timeout_ms)
{
    (void)timeout_ms;
    http_proxy_transport_ctx_t *ctx = esp_transport_get_context_data(transport);
    if (!ctx || !buffer || len <= 0) {
        errno = EINVAL;
        return -1;
    }
    if (ctx->tls) {
        ssize_t rc = esp_tls_conn_read(ctx->tls, buffer, (size_t)len);
        return (int)rc;
    }
    if (ctx->sockfd < 0) {
        errno = ENOTCONN;
        return -1;
    }
    ssize_t rc = recv(ctx->sockfd, buffer, (size_t)len, 0);
    return (int)rc;
}

static int proxy_transport_write(esp_transport_handle_t transport,
                                 const char *buffer, int len, int timeout_ms)
{
    (void)timeout_ms;
    http_proxy_transport_ctx_t *ctx = esp_transport_get_context_data(transport);
    if (!ctx || !buffer || len <= 0) {
        errno = EINVAL;
        return -1;
    }
    if (ctx->tls) {
        ssize_t rc = esp_tls_conn_write(ctx->tls, buffer, (size_t)len);
        return (int)rc;
    }
    if (ctx->sockfd < 0) {
        errno = ENOTCONN;
        return -1;
    }
    ssize_t rc = send(ctx->sockfd, buffer, (size_t)len, 0);
    return (int)rc;
}

static int proxy_transport_poll_read(esp_transport_handle_t transport, int timeout_ms)
{
    http_proxy_transport_ctx_t *ctx = esp_transport_get_context_data(transport);
    if (!ctx || ctx->sockfd < 0) {
        errno = ENOTCONN;
        return -1;
    }
    fd_set read_set;
    FD_ZERO(&read_set);
    FD_SET(ctx->sockfd, &read_set);
    struct timeval tv = {
        .tv_sec = timeout_ms > 0 ? timeout_ms / 1000 : 0,
        .tv_usec = timeout_ms > 0 ? (timeout_ms % 1000) * 1000 : 0,
    };
    return select(ctx->sockfd + 1, &read_set, NULL, NULL,
                  timeout_ms < 0 ? NULL : &tv);
}

static int proxy_transport_poll_write(esp_transport_handle_t transport, int timeout_ms)
{
    http_proxy_transport_ctx_t *ctx = esp_transport_get_context_data(transport);
    if (!ctx || ctx->sockfd < 0) {
        errno = ENOTCONN;
        return -1;
    }
    fd_set write_set;
    FD_ZERO(&write_set);
    FD_SET(ctx->sockfd, &write_set);
    struct timeval tv = {
        .tv_sec = timeout_ms > 0 ? timeout_ms / 1000 : 0,
        .tv_usec = timeout_ms > 0 ? (timeout_ms % 1000) * 1000 : 0,
    };
    return select(ctx->sockfd + 1, NULL, &write_set, NULL,
                  timeout_ms < 0 ? NULL : &tv);
}

static int proxy_transport_close(esp_transport_handle_t transport)
{
    http_proxy_transport_ctx_t *ctx = esp_transport_get_context_data(transport);
    if (!ctx) {
        return 0;
    }
    int ret = 0;
    if (ctx->tls) {
        ret = esp_tls_conn_destroy(ctx->tls);
        ctx->tls = NULL;
        ctx->sockfd = -1;
    } else if (ctx->sockfd >= 0) {
        ret = close(ctx->sockfd);
        ctx->sockfd = -1;
    }
    return ret;
}

static esp_err_t proxy_transport_destroy(esp_transport_handle_t transport)
{
    if (!transport) {
        return ESP_OK;
    }
    http_proxy_transport_ctx_t *ctx = esp_transport_get_context_data(transport);
    if (ctx) {
        (void)proxy_transport_close(transport);
        free(ctx);
    }
    return ESP_OK;
}

static esp_transport_handle_t proxy_transport_create(const char *url)
{
#if CONFIG_ESP_HTTP_CLIENT_ENABLE_CUSTOM_TRANSPORT
    bool use_tls = false;
    if (!proxy_should_use_for_url(url, &use_tls)) {
        return NULL;
    }

