akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    esp_transport_handle_t transport = esp_transport_init();
    if (!transport) {
        return NULL;
    }
    http_proxy_transport_ctx_t *ctx = calloc(1, sizeof(*ctx));
    if (!ctx) {
        esp_transport_destroy(transport);
        return NULL;
    }
    copy_string(ctx->proxy_host, sizeof(ctx->proxy_host), g_app.cfg.proxy_host);
    ctx->proxy_port = g_app.cfg.proxy_port;
    ctx->use_tls = use_tls;
    ctx->sockfd = -1;
    esp_transport_set_context_data(transport, ctx);
    esp_transport_set_func(transport,
                           proxy_transport_connect,
                           proxy_transport_read,
                           proxy_transport_write,
                           proxy_transport_close,
                           proxy_transport_poll_read,
                           proxy_transport_poll_write,
                           proxy_transport_destroy);
    return transport;
#else
    (void)url;
    return NULL;
#endif
}

static esp_transport_handle_t http_client_attach_proxy(esp_http_client_config_t *config,
                                                       const char *url)
{
#if CONFIG_ESP_HTTP_CLIENT_ENABLE_CUSTOM_TRANSPORT
    if (!config) {
        return NULL;
    }
    esp_transport_handle_t proxy_transport = proxy_transport_create(url);
    if (proxy_transport) {
        config->transport = proxy_transport;
    }
    return proxy_transport;
#else
    (void)config;
    (void)url;
    return NULL;
#endif
}

static void http_client_destroy_proxy_transport(esp_transport_handle_t proxy_transport)
{
#if CONFIG_ESP_HTTP_CLIENT_ENABLE_CUSTOM_TRANSPORT
    if (proxy_transport) {
        esp_transport_destroy(proxy_transport);
    }
#else
    (void)proxy_transport;
#endif
}

static esp_err_t direct_http_request_impl(const char *url, const char *payload, int timeout_ms,
                                          bool use_auth, char *body, size_t body_size,
                                          bool allow_proxy)
{
    if (!g_app.sta_connected) {
        return ESP_ERR_INVALID_STATE;
    }
    if (!body || body_size == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    body[0] = '\0';

    http_buffer_t buffer = {
        .data = body,
        .len = 0,
        .capacity = (int)body_size,
    };
    esp_http_client_config_t config = {
        .url = url,
        .timeout_ms = timeout_ms,
        .event_handler = direct_http_event_cb,
        .user_data = &buffer,
        .disable_auto_redirect = false,
        .buffer_size = 2048,
        .buffer_size_tx = 2048,
        .keep_alive_enable = false,
        .addr_type = HTTP_ADDR_TYPE_INET,
    };
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
    config.crt_bundle_attach = esp_crt_bundle_attach;
#endif

    esp_transport_handle_t proxy_transport = allow_proxy ? http_client_attach_proxy(&config, url) : NULL;
    esp_http_client_handle_t client = esp_http_client_init(&config);
    if (!client) {
        http_client_destroy_proxy_transport(proxy_transport);
        return ESP_ERR_NO_MEM;
    }

    if (payload) {
        esp_http_client_set_method(client, HTTP_METHOD_POST);
        esp_http_client_set_header(client, "Content-Type", "application/json");
        esp_http_client_set_post_field(client, payload, strlen(payload));
    }
    if (use_auth && g_app.cfg.api_key[0]) {
        char auth[224] = {0};
        snprintf(auth, sizeof(auth), "Bearer %s", g_app.cfg.api_key);
        esp_http_client_set_header(client, "Authorization", auth);
    }
    esp_http_client_set_header(client, "User-Agent", "Mozilla/5.0");
    esp_http_client_set_header(client, "Accept", "*/*");
    if (strstr(url, "hq.sinajs.cn")) {
        esp_http_client_set_header(client, "Referer", "https://finance.sina.com.cn/");
    } else if (strstr(url, "eastmoney.com")) {
        esp_http_client_set_header(client, "Referer", "https://quote.eastmoney.com/");
    } else if (strstr(url, "qt.gtimg.cn")) {
        esp_http_client_set_header(client, "Referer", "https://gu.qq.com/");
    }

    esp_err_t err = esp_http_client_perform(client);
    int status = esp_http_client_get_status_code(client);
    int sock_errno = esp_http_client_get_errno(client);
    int tls_err = 0;
    int tls_flags = 0;
    (void)esp_http_client_get_and_clear_last_tls_error(client, &tls_err, &tls_flags);
    esp_http_client_cleanup(client);
    http_client_destroy_proxy_transport(proxy_transport);

    if (err != ESP_OK) {
        log_http_failure(url, err, status, sock_errno, tls_err, tls_flags);
        return err;
    }
    if (status < 200 || status >= 300) {
        ESP_LOGW(TAG, "http status=%d url=%s body=%s", status, url, body);
        return ESP_FAIL;
    }
    return ESP_OK;
}

static esp_err_t direct_http_request(const char *url, const char *payload, int timeout_ms,
                                     bool use_auth, char *body, size_t body_size)
{
    return direct_http_request_impl(url, payload, timeout_ms, use_auth, body, body_size, true);
}

static esp_err_t direct_http_request_no_proxy(const char *url, const char *payload, int timeout_ms,
                                              bool use_auth, char *body, size_t body_size)
{
    return direct_http_request_impl(url, payload, timeout_ms, use_auth, body, body_size, false);
}

static void build_api_endpoint_url(const char *endpoint_path, char *out, size_t out_size)
{
    if (!out || out_size == 0) {
        return;
    }
    out[0] = '\0';
    if (!endpoint_path || endpoint_path[0] == '\0') {
        return;
    }

    char base[192] = {0};
    copy_string(base, sizeof(base), g_app.cfg.server_url);
    size_t len = strlen(base);
    while (len > 0 && base[len - 1] == '/') {
        base[--len] = '\0';
    }
    if (len == 0) {
        return;
    }

    static const char *const api_base_paths[] = {
        "/v1",
        "/api/v3",
        "/v1beta/openai",
    };
    for (size_t i = 0; i < sizeof(api_base_paths) / sizeof(api_base_paths[0]); ++i) {
        const char *api_base_path = api_base_paths[i];
        const size_t api_base_path_len = strlen(api_base_path);
        char api_base_path_with_slash[16] = {0};
        snprintf(api_base_path_with_slash, sizeof(api_base_path_with_slash), "%s/", api_base_path);

        const char *path = strstr(base, api_base_path_with_slash);
        if (path) {
            size_t prefix_len = (size_t)(path - base) + api_base_path_len;
            snprintf(out, out_size, "%.*s/%s", (int)prefix_len, base, endpoint_path);
            return;
        }
        if (len >= api_base_path_len &&
            strcmp(base + len - api_base_path_len, api_base_path) == 0) {
            snprintf(out, out_size, "%s/%s", base, endpoint_path);
            return;
        }
    }

