akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    snprintf(out, out_size, "%s/v1/%s", base, endpoint_path);
}

static void binary_buffer_free(binary_buffer_t *buffer)
{
    if (!buffer) {
        return;
    }
    free(buffer->data);
    buffer->data = NULL;
    buffer->len = 0;
    buffer->cap = 0;
    buffer->truncated = false;
}

static esp_err_t binary_buffer_reserve(binary_buffer_t *buffer, size_t needed)
{
    if (!buffer) {
        return ESP_ERR_INVALID_ARG;
    }
    if (needed <= buffer->cap) {
        return ESP_OK;
    }

    size_t new_cap = buffer->cap ? buffer->cap : VOICE_AUDIO_GROW_STEP;
    while (new_cap < needed) {
        new_cap *= 2;
        if (new_cap > VOICE_MAX_AUDIO_BYTES) {
            new_cap = VOICE_MAX_AUDIO_BYTES;
            break;
        }
    }
    if (new_cap < needed) {
        buffer->truncated = true;
        return ESP_ERR_NO_MEM;
    }

    uint8_t *new_data = realloc(buffer->data, new_cap);
    if (!new_data) {
        buffer->truncated = true;
        return ESP_ERR_NO_MEM;
    }
    buffer->data = new_data;
    buffer->cap = new_cap;
    return ESP_OK;
}

static esp_err_t binary_buffer_append(binary_buffer_t *buffer, const uint8_t *data, size_t len)
{
    if (!buffer || !data || len == 0) {
        return ESP_OK;
    }
    if (buffer->len + len > VOICE_MAX_AUDIO_BYTES) {
        len = (buffer->len < VOICE_MAX_AUDIO_BYTES) ? (VOICE_MAX_AUDIO_BYTES - buffer->len) : 0;
        buffer->truncated = true;
    }
    if (len == 0) {
        return ESP_ERR_NO_MEM;
    }

    esp_err_t err = binary_buffer_reserve(buffer, buffer->len + len);
    if (err != ESP_OK) {
        return err;
    }
    memcpy(buffer->data + buffer->len, data, len);
    buffer->len += len;
    return ESP_OK;
}

static esp_err_t binary_buffer_append_format(binary_buffer_t *buffer, const char *fmt, ...)
{
    if (!buffer || !fmt) {
        return ESP_ERR_INVALID_ARG;
    }

    char temp[512];
    va_list args;
    va_start(args, fmt);
    int written = vsnprintf(temp, sizeof(temp), fmt, args);
    va_end(args);
    if (written < 0) {
        return ESP_FAIL;
    }
    if ((size_t)written >= sizeof(temp)) {
        return ESP_ERR_NO_MEM;
    }
    return binary_buffer_append(buffer, (const uint8_t *)temp, (size_t)written);
}

static bool build_gateway_root_url(char *out, size_t out_size)
{
    if (!out || out_size == 0) {
        return false;
    }
    out[0] = '\0';

    char base[192] = {0};
    copy_string(base, sizeof(base), g_app.cfg.server_url);
    size_t len = strlen(base);
    while (len > 0 && base[len - 1] == '/') {
        base[--len] = '\0';
    }
    if (len == 0) {
        return false;
    }

    char *v1 = strstr(base, "/v1");
    if (v1 && (v1[3] == '\0' || v1[3] == '/')) {
        *v1 = '\0';
    }
    if (base[0] == '\0') {
        return false;
    }
    copy_string(out, out_size, base);
    return out[0] != '\0';
}

static bool build_gateway_url(const char *path, char *out, size_t out_size)
{
    if (!path || !out || out_size == 0) {
        return false;
    }
    char root[192] = {0};
    if (!build_gateway_root_url(root, sizeof(root))) {
        out[0] = '\0';
        return false;
    }
    snprintf(out, out_size, "%s%s%s", root, path[0] == '/' ? "" : "/", path);
    return out[0] != '\0';
}

static bool api_url_is_local_gateway(void)
{
    const char *url = g_app.cfg.server_url;
    if (!url || !url[0]) {
        return false;
    }
    return strncasecmp(url, "http://", 7) == 0 ||
           strstr(url, "/api/watch") != NULL ||
           strstr(url, "192.168.") != NULL ||
           strstr(url, "10.") != NULL ||
           strstr(url, "172.16.") != NULL ||
           strstr(url, "172.17.") != NULL ||
           strstr(url, "172.18.") != NULL ||
           strstr(url, "localhost") != NULL ||
           strstr(url, "127.0.0.1") != NULL;
}

static char *build_voice_context_json(void)
{
    cJSON *root = cJSON_CreateObject();
    if (!root) {
        return NULL;
    }
    cJSON_AddNumberToObject(root, "battery_percent", g_app.battery_percent);
    cJSON_AddStringToObject(root, "market_time", g_app.market_time);
    cJSON *markets = cJSON_AddArrayToObject(root, "markets");
    if (markets) {
        for (int i = 0; i < MARKET_ROW_COUNT; ++i) {
            cJSON *item = cJSON_CreateObject();
            if (!item) {
                continue;
            }
            cJSON_AddStringToObject(item, "code", MARKET_DEFS[i].code);
            cJSON_AddStringToObject(item, "price", g_app.market_rows[i].price);
            cJSON_AddStringToObject(item, "change", g_app.market_rows[i].change);
            cJSON_AddItemToArray(markets, item);
        }
    }
    char *json = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    return json;
}

static esp_err_t build_gateway_voice_multipart_body(const uint8_t *wav_data, size_t wav_len,
                                                    binary_buffer_t *body)
{
    if (!wav_data || wav_len == 0 || !body) {
        return ESP_ERR_INVALID_ARG;
    }

    const char *boundary = "----watchlite-voice-boundary";
    esp_err_t err = binary_buffer_append_format(
        body,
        "--%s\r\n"
        "Content-Disposition: form-data; name=\"language\"\r\n\r\nzh\r\n",
        boundary);
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append_format(
        body,
        "--%s\r\n"
        "Content-Disposition: form-data; name=\"prompt\"\r\n\r\n"
        "中文普通话语音转写，只输出用户说的话，不要翻译。\r\n",
        boundary);
    if (err != ESP_OK) {
        return err;
    }

    char *context = build_voice_context_json();
    if (context) {
        err = binary_buffer_append_format(
            body,
            "--%s\r\n"
            "Content-Disposition: form-data; name=\"context\"\r\n"
            "Content-Type: application/json\r\n\r\n",
            boundary);
        if (err == ESP_OK) {
            err = binary_buffer_append(body, (const uint8_t *)context, strlen(context));
        }
        free(context);
        if (err != ESP_OK) {
            return err;
        }
        err = binary_buffer_append(body, (const uint8_t *)"\r\n", 2);
        if (err != ESP_OK) {
            return err;
        }
    }

    err = binary_buffer_append_format(
        body,
        "--%s\r\n"
        "Content-Disposition: form-data; name=\"file\"; filename=\"voice.wav\"\r\n"
        "Content-Type: audio/wav\r\n\r\n",
        boundary);
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append(body, wav_data, wav_len);
    if (err != ESP_OK) {
        return err;
    }
    return binary_buffer_append_format(body, "\r\n--%s--\r\n", boundary);
}

static bool parse_gateway_voice_response(const char *body, voice_gateway_result_t *result,
                                         char *error_out, size_t error_out_len)
{
    if (!body || !result) {
        return false;
    }
    memset(result, 0, sizeof(*result));
    cJSON *root = cJSON_Parse(body);
    if (!root) {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "网关响应不是有效 JSON");
        }
        return false;
    }

    const cJSON *text = cJSON_GetObjectItemCaseSensitive(root, "text");
    const cJSON *reply = cJSON_GetObjectItemCaseSensitive(root, "reply");
    const cJSON *audio_url = cJSON_GetObjectItemCaseSensitive(root, "audio_url");
    const cJSON *local = cJSON_GetObjectItemCaseSensitive(root, "local");
    const cJSON *refresh_market = cJSON_GetObjectItemCaseSensitive(root, "refresh_market");
    const cJSON *action = cJSON_GetObjectItemCaseSensitive(root, "action");
    const cJSON *asset = cJSON_GetObjectItemCaseSensitive(root, "asset");
    const cJSON *brightness_delta = cJSON_GetObjectItemCaseSensitive(root, "brightness_delta");
    if (cJSON_IsString(text) && text->valuestring) {
        copy_ai_text(result->transcript, sizeof(result->transcript), text->valuestring);
    }
    if (cJSON_IsString(reply) && reply->valuestring) {
        copy_ai_text(result->reply, sizeof(result->reply), reply->valuestring);
    }
    if (cJSON_IsString(audio_url) && audio_url->valuestring) {
        copy_string(result->audio_url, sizeof(result->audio_url), audio_url->valuestring);
    }
    if (cJSON_IsString(action) && action->valuestring) {
        copy_string(result->action, sizeof(result->action), action->valuestring);
    }
    if (cJSON_IsString(asset) && asset->valuestring) {
        copy_string(result->asset, sizeof(result->asset), asset->valuestring);
    }
    if (cJSON_IsNumber(brightness_delta)) {
        result->brightness_delta = brightness_delta->valueint;
    }
    result->local = cJSON_IsTrue(local);
    result->refresh_market = cJSON_IsTrue(refresh_market);

    bool ok = result->transcript[0] != '\0' && result->reply[0] != '\0' &&
              result->audio_url[0] != '\0';
    if (!ok && error_out && error_out_len) {
        if (!extract_error_string_from_json(root, error_out, error_out_len)) {
            copy_string(error_out, error_out_len, "网关响应缺少文本或音频地址");
        }
    }
    cJSON_Delete(root);
    return ok;
}

static esp_err_t perform_gateway_voice_request(const uint8_t *wav_data, size_t wav_len,
                                               voice_gateway_result_t *result,
                                               char *error_out, size_t error_out_len)
{
    if (!wav_data || wav_len == 0 || !result) {
        return ESP_ERR_INVALID_ARG;
    }
    memset(result, 0, sizeof(*result));
    if (error_out && error_out_len) {
        error_out[0] = '\0';
    }

