akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    char voice_url[224] = {0};
    if (!build_gateway_url("/api/watch/voice", voice_url, sizeof(voice_url))) {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "无法生成语音网关地址");
        }
        return ESP_ERR_INVALID_ARG;
    }

    binary_buffer_t request = {0};
    esp_err_t err = build_gateway_voice_multipart_body(wav_data, wav_len, &request);
    if (err != ESP_OK) {
        binary_buffer_free(&request);
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "构建语音网关请求失败");
        }
        return err;
    }

    char *body = http_body_alloc(DIRECT_HTTP_MAX_BODY + 1);
    if (!body) {
        binary_buffer_free(&request);
        return ESP_ERR_NO_MEM;
    }
    http_buffer_t response = {
        .data = body,
        .len = 0,
        .capacity = DIRECT_HTTP_MAX_BODY + 1,
    };
    esp_http_client_config_t config = {
        .url = voice_url,
        .timeout_ms = VOICE_GATEWAY_TIMEOUT_MS,
        .event_handler = direct_http_event_cb,
        .user_data = &response,
        .disable_auto_redirect = false,
        .buffer_size = 2048,
        .buffer_size_tx = 2048,
        .keep_alive_enable = false,
        .addr_type = HTTP_ADDR_TYPE_INET,
    };
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
    if (strncasecmp(voice_url, "https://", 8) == 0) {
        config.crt_bundle_attach = esp_crt_bundle_attach;
    }
#endif

    esp_transport_handle_t proxy_transport = http_client_attach_proxy(&config, voice_url);
    esp_http_client_handle_t client = esp_http_client_init(&config);
    if (!client) {
        http_client_destroy_proxy_transport(proxy_transport);
        http_body_free(body);
        binary_buffer_free(&request);
        return ESP_ERR_NO_MEM;
    }

    const char *boundary = "----watchlite-voice-boundary";
    char content_type[128] = {0};
    snprintf(content_type, sizeof(content_type), "multipart/form-data; boundary=%s", boundary);
    esp_http_client_set_method(client, HTTP_METHOD_POST);
    esp_http_client_set_header(client, "Content-Type", content_type);
    if (g_app.cfg.api_key[0]) {
        char auth[224] = {0};
        snprintf(auth, sizeof(auth), "Bearer %s", g_app.cfg.api_key);
        esp_http_client_set_header(client, "Authorization", auth);
    }
    esp_http_client_set_post_field(client, (const char *)request.data, (int)request.len);

    err = esp_http_client_perform(client);
    int status = esp_http_client_get_status_code(client);
    esp_http_client_cleanup(client);
    http_client_destroy_proxy_transport(proxy_transport);
    binary_buffer_free(&request);

    if (err == ESP_OK && status >= 200 && status < 300) {
        if (!parse_gateway_voice_response(body, result, error_out, error_out_len)) {
            err = ESP_FAIL;
        }
    } else {
        if (error_out && error_out_len) {
            char temp[192] = {0};
            if (body[0] &&
                parse_reply_response(body, temp, sizeof(temp), temp, sizeof(temp)) == ESP_OK) {
                copy_string(error_out, error_out_len, temp);
            } else if (body[0] && temp[0]) {
                copy_string(error_out, error_out_len, temp);
            } else if (err == ESP_OK) {
                snprintf(error_out, error_out_len, "语音网关 HTTP %d", status);
            } else {
                snprintf(error_out, error_out_len, "语音网关失败: %s", esp_err_to_name(err));
            }
        }
        err = (err == ESP_OK) ? ESP_FAIL : err;
    }

    http_body_free(body);
    return err;
}

static esp_err_t fetch_gateway_audio(const char *audio_url, binary_buffer_t *audio_out,
                                     char *error_out, size_t error_out_len)
{
    if (!audio_url || !audio_url[0] || !audio_out) {
        return ESP_ERR_INVALID_ARG;
    }
    memset(audio_out, 0, sizeof(*audio_out));
    if (error_out && error_out_len) {
        error_out[0] = '\0';
    }

    char url[256] = {0};
    if (strncasecmp(audio_url, "http://", 7) == 0 ||
        strncasecmp(audio_url, "https://", 8) == 0) {
        copy_string(url, sizeof(url), audio_url);
    } else if (!build_gateway_url(audio_url, url, sizeof(url))) {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "无法生成语音音频地址");
        }
        return ESP_ERR_INVALID_ARG;
    }

    esp_http_client_config_t config = {
        .url = url,
        .timeout_ms = VOICE_AUDIO_TIMEOUT_MS,
        .event_handler = http_binary_event_cb,
        .user_data = audio_out,
        .disable_auto_redirect = false,
        .buffer_size = 2048,
        .buffer_size_tx = 2048,
        .keep_alive_enable = false,
    };
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
    if (strncasecmp(url, "https://", 8) == 0) {
        config.crt_bundle_attach = esp_crt_bundle_attach;
    }
#endif

    esp_transport_handle_t proxy_transport = http_client_attach_proxy(&config, url);
    esp_http_client_handle_t client = esp_http_client_init(&config);
    if (!client) {
        http_client_destroy_proxy_transport(proxy_transport);
        return ESP_ERR_NO_MEM;
    }
    if (g_app.cfg.api_key[0]) {
        char auth[224] = {0};
        snprintf(auth, sizeof(auth), "Bearer %s", g_app.cfg.api_key);
        esp_http_client_set_header(client, "Authorization", auth);
    }

    esp_err_t err = esp_http_client_perform(client);
    int status = esp_http_client_get_status_code(client);
    esp_http_client_cleanup(client);
    http_client_destroy_proxy_transport(proxy_transport);
    if (err != ESP_OK) {
        if (error_out && error_out_len) {
            snprintf(error_out, error_out_len, "语音音频下载失败: %s", esp_err_to_name(err));
        }
        binary_buffer_free(audio_out);
        return err;
    }
    if (status < 200 || status >= 300) {
        if (error_out && error_out_len) {
            snprintf(error_out, error_out_len, "语音音频 HTTP %d", status);
        }
        binary_buffer_free(audio_out);
        return ESP_FAIL;
    }
    if (audio_out->truncated || !audio_out->data || audio_out->len == 0) {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len,
                        audio_out->truncated ? "语音音频过大" : "语音音频为空");
        }
        binary_buffer_free(audio_out);
        return ESP_FAIL;
    }
    return ESP_OK;
}

static esp_err_t http_binary_event_cb(esp_http_client_event_t *event)
{
    if (event->event_id == HTTP_EVENT_ON_DATA && event->user_data && event->data && event->data_len > 0) {
        binary_buffer_t *buffer = (binary_buffer_t *)event->user_data;
        return binary_buffer_append(buffer, (const uint8_t *)event->data, (size_t)event->data_len);
    }
    return ESP_OK;
}

