akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static uint16_t read_le16(const uint8_t *p)
{
    return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

static uint32_t read_le32(const uint8_t *p)
{
    return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

static void write_le16(uint8_t *p, uint16_t value)
{
    p[0] = (uint8_t)(value & 0xFFu);
    p[1] = (uint8_t)((value >> 8) & 0xFFu);
}

static void write_le32(uint8_t *p, uint32_t value)
{
    p[0] = (uint8_t)(value & 0xFFu);
    p[1] = (uint8_t)((value >> 8) & 0xFFu);
    p[2] = (uint8_t)((value >> 16) & 0xFFu);
    p[3] = (uint8_t)((value >> 24) & 0xFFu);
}

static esp_err_t build_wav_header(uint8_t *dst, size_t pcm_bytes, const esp_codec_dev_sample_info_t *fs)
{
    if (!dst || !fs || fs->bits_per_sample == 0 || fs->channel == 0 || fs->sample_rate == 0) {
        return ESP_ERR_INVALID_ARG;
    }

    const uint16_t block_align = (uint16_t)(fs->channel * (fs->bits_per_sample / 8));
    const uint32_t byte_rate = fs->sample_rate * block_align;
    memcpy(dst + 0, "RIFF", 4);
    write_le32(dst + 4, (uint32_t)(36 + pcm_bytes));
    memcpy(dst + 8, "WAVE", 4);
    memcpy(dst + 12, "fmt ", 4);
    write_le32(dst + 16, 16);
    write_le16(dst + 20, 1);
    write_le16(dst + 22, fs->channel);
    write_le32(dst + 24, fs->sample_rate);
    write_le32(dst + 28, byte_rate);
    write_le16(dst + 32, block_align);
    write_le16(dst + 34, fs->bits_per_sample);
    memcpy(dst + 36, "data", 4);
    write_le32(dst + 40, (uint32_t)pcm_bytes);
    return ESP_OK;
}

static int64_t pcm_chunk_energy_16bit(const int16_t *samples, size_t sample_count)
{
    if (!samples || sample_count == 0) {
        return 0;
    }

    int64_t total = 0;
    for (size_t i = 0; i < sample_count; ++i) {
        int32_t sample = samples[i];
        total += (sample < 0) ? -(int64_t)sample : (int64_t)sample;
    }
    return total / (int64_t)sample_count;
}

static bool parse_wav_audio(const uint8_t *data, size_t len, wav_audio_info_t *out)
{
    if (!data || !out || len < 44) {
        return false;
    }
    memset(out, 0, sizeof(*out));
    if (memcmp(data, "RIFF", 4) != 0 || memcmp(data + 8, "WAVE", 4) != 0) {
        return false;
    }

    size_t pos = 12;
    bool found_fmt = false;
    bool found_data = false;
    uint16_t audio_format = 0;
    while (pos + 8 <= len) {
        const uint8_t *chunk = data + pos;
        uint32_t chunk_size = read_le32(chunk + 4);
        size_t payload = pos + 8;
        if (payload > len) {
            return false;
        }
        if (chunk_size == UINT32_MAX || payload + chunk_size > len) {
            if (memcmp(chunk, "data", 4) == 0) {
                chunk_size = (uint32_t)(len - payload);
            } else {
                return false;
            }
        }

        if (memcmp(chunk, "fmt ", 4) == 0) {
            if (chunk_size < 16) {
                return false;
            }
            audio_format = read_le16(data + payload + 0);
            out->fs.channel = (uint8_t)read_le16(data + payload + 2);
            out->fs.sample_rate = read_le32(data + payload + 4);
            out->fs.bits_per_sample = (uint8_t)read_le16(data + payload + 14);
            out->fs.channel_mask = 0;
            out->fs.mclk_multiple = 256;
            found_fmt = true;
        } else if (memcmp(chunk, "data", 4) == 0) {
            out->data_offset = payload;
            out->data_len = chunk_size;
            found_data = true;
        }

        pos = payload + chunk_size;
        if (chunk_size & 1u) {
            ++pos;
        }
    }

    if (!found_fmt || !found_data) {
        return false;
    }
    if (audio_format != 1 || out->fs.bits_per_sample != 16 ||
        out->fs.channel == 0 || out->fs.sample_rate == 0) {
        return false;
    }
    return out->data_offset + out->data_len <= len;
}

static void build_wav_sample_info(const wav_audio_info_t *wav, esp_codec_dev_sample_info_t *fs)
{
    if (!wav || !fs) {
        return;
    }
    *fs = wav->fs;
    if (fs->mclk_multiple <= 0) {
        fs->mclk_multiple = 256;
    }
    if (fs->channel_mask == 0) {
        fs->channel_mask = (fs->channel > 1) ? ((1u << fs->channel) - 1u) : 1u;
    }
}

static bool extract_reply_string_from_json(cJSON *root, char *reply, size_t reply_len)
{
    if (!root || !reply || reply_len == 0) {
        return false;
    }

    const cJSON *choices = cJSON_GetObjectItemCaseSensitive(root, "choices");
    if (cJSON_IsArray(choices) && cJSON_GetArraySize((cJSON *)choices) > 0) {
        const cJSON *choice0 = cJSON_GetArrayItem((cJSON *)choices, 0);
        const cJSON *message = choice0 ? cJSON_GetObjectItemCaseSensitive((cJSON *)choice0, "message") : NULL;
        const cJSON *content = message ? cJSON_GetObjectItemCaseSensitive((cJSON *)message, "content") : NULL;
        const cJSON *text = choice0 ? cJSON_GetObjectItemCaseSensitive((cJSON *)choice0, "text") : NULL;
        if (cJSON_IsString(content) && content->valuestring) {
            copy_string(reply, reply_len, content->valuestring);
            return true;
        }
        if (cJSON_IsString(text) && text->valuestring) {
            copy_string(reply, reply_len, text->valuestring);
            return true;
        }
    }

    const cJSON *output_text = cJSON_GetObjectItemCaseSensitive(root, "output_text");
    if (cJSON_IsString(output_text) && output_text->valuestring) {
        copy_string(reply, reply_len, output_text->valuestring);
        return true;
    }
    const cJSON *text = cJSON_GetObjectItemCaseSensitive(root, "text");
    if (cJSON_IsString(text) && text->valuestring) {
        copy_string(reply, reply_len, text->valuestring);
        return true;
    }
    const cJSON *message = cJSON_GetObjectItemCaseSensitive(root, "message");
    if (cJSON_IsString(message) && message->valuestring) {
        copy_string(reply, reply_len, message->valuestring);
        return true;
    }
    return false;
}

static bool extract_error_string_from_json(cJSON *root, char *error_out, size_t error_out_len)
{
    if (!root || !error_out || error_out_len == 0) {
        return false;
    }

    const cJSON *error = cJSON_GetObjectItemCaseSensitive(root, "error");
    if (cJSON_IsObject(error)) {
        const cJSON *message = cJSON_GetObjectItemCaseSensitive((cJSON *)error, "message");
        if (cJSON_IsString(message) && message->valuestring) {
            copy_string(error_out, error_out_len, message->valuestring);
            return true;
        }
    } else if (cJSON_IsString(error) && error->valuestring) {
        copy_string(error_out, error_out_len, error->valuestring);
        return true;
    }
    return extract_reply_string_from_json(root, error_out, error_out_len);
}

