akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static esp_err_t parse_reply_response(const char *body, char *reply_out, size_t reply_out_len,
                                      char *error_out, size_t error_out_len)
{
    if (!body || !reply_out || reply_out_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    reply_out[0] = '\0';
    cJSON *root = cJSON_Parse(body);
    if (!root) {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "响应不是有效 JSON");
        }
        return ESP_FAIL;
    }

    if (!extract_reply_string_from_json(root, reply_out, reply_out_len)) {
        if (error_out && error_out_len &&
            !extract_error_string_from_json(root, error_out, error_out_len)) {
            copy_string(error_out, error_out_len, "找不到回复内容");
        }
        cJSON_Delete(root);
        return ESP_FAIL;
    }
    cJSON_Delete(root);
    return ESP_OK;
}

static esp_err_t build_stt_multipart_body(const uint8_t *wav_data, size_t wav_len, binary_buffer_t *body)
{
    if (!wav_data || wav_len == 0 || !body) {
        return ESP_ERR_INVALID_ARG;
    }

    const char *boundary = "----watchlite-stt-boundary";
    esp_err_t err = binary_buffer_append_format(body, "--%s\r\n", boundary);
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append_format(
        body,
        "Content-Disposition: form-data; name=\"model\"\r\n\r\nwhisper-1\r\n");
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append_format(body, "--%s\r\n", boundary);
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append_format(
        body,
        "Content-Disposition: form-data; name=\"language\"\r\n\r\nzh\r\n");
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append_format(body, "--%s\r\n", boundary);
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append_format(
        body,
        "Content-Disposition: form-data; name=\"prompt\"\r\n\r\n中文普通话语音转写，只输出用户说的话，不要翻译。\r\n");
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append_format(body, "--%s\r\n", boundary);
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append_format(
        body,
        "Content-Disposition: form-data; name=\"file\"; filename=\"voice.wav\"\r\n"
        "Content-Type: audio/wav\r\n\r\n");
    if (err != ESP_OK) {
        return err;
    }
    err = binary_buffer_append(body, wav_data, wav_len);
    if (err != ESP_OK) {
        return err;
    }
    return binary_buffer_append_format(body, "\r\n--%s--\r\n", boundary);
}

static esp_err_t perform_stt_request(const uint8_t *wav_data, size_t wav_len,
                                     char *text_out, size_t text_out_len,
                                     char *error_out, size_t error_out_len)
{
    if (!wav_data || wav_len == 0 || !text_out || text_out_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    text_out[0] = '\0';
    if (error_out && error_out_len) {
        error_out[0] = '\0';
    }

    char stt_url[224] = {0};
    build_api_endpoint_url("audio/transcriptions", stt_url, sizeof(stt_url));
    if (stt_url[0] == '\0') {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "无法生成语音转写地址");
        }
        return ESP_ERR_INVALID_ARG;
    }

    binary_buffer_t request = {0};
    esp_err_t err = build_stt_multipart_body(wav_data, wav_len, &request);
    if (err != ESP_OK) {
        binary_buffer_free(&request);
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "构建转写请求失败");
        }
        return err;
    }

    char *body = http_body_alloc(DIRECT_HTTP_MAX_BODY + 1);
    if (!body) {
        binary_buffer_free(&request);
        return ESP_ERR_NO_MEM;
    }
    http_buffer_t response = {
        .data = body,
        .len = 0,
        .capacity = DIRECT_HTTP_MAX_BODY + 1,
    };
    esp_http_client_config_t config = {
        .url = stt_url,
        .timeout_ms = VOICE_AI_TIMEOUT_MS,
        .event_handler = direct_http_event_cb,
        .user_data = &response,
        .disable_auto_redirect = false,
        .buffer_size = 2048,
        .buffer_size_tx = 2048,
        .keep_alive_enable = false,
        .addr_type = HTTP_ADDR_TYPE_INET,
    };
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
    if (strncasecmp(stt_url, "https://", 8) == 0) {
        config.crt_bundle_attach = esp_crt_bundle_attach;
    }
#endif

    esp_transport_handle_t proxy_transport = http_client_attach_proxy(&config, stt_url);
    esp_http_client_handle_t client = esp_http_client_init(&config);
    if (!client) {
        http_client_destroy_proxy_transport(proxy_transport);
        http_body_free(body);
        binary_buffer_free(&request);
        return ESP_ERR_NO_MEM;
    }

    const char *boundary = "----watchlite-stt-boundary";
    char content_type[128] = {0};
    snprintf(content_type, sizeof(content_type), "multipart/form-data; boundary=%s", boundary);
    esp_http_client_set_method(client, HTTP_METHOD_POST);
    esp_http_client_set_header(client, "Content-Type", content_type);
    if (g_app.cfg.api_key[0]) {
        char auth[224] = {0};
        snprintf(auth, sizeof(auth), "Bearer %s", g_app.cfg.api_key);
        esp_http_client_set_header(client, "Authorization", auth);
    }
    esp_http_client_set_post_field(client, (const char *)request.data, (int)request.len);

    err = esp_http_client_perform(client);
    int status = esp_http_client_get_status_code(client);
    esp_http_client_cleanup(client);
    http_client_destroy_proxy_transport(proxy_transport);
    binary_buffer_free(&request);

    if (err == ESP_OK && status >= 200 && status < 300) {
        err = parse_reply_response(body, text_out, text_out_len, error_out, error_out_len);
    } else {
        if (error_out && error_out_len) {
            if (body[0]) {
                char temp[160] = {0};
                if (parse_reply_response(body, temp, sizeof(temp), temp, sizeof(temp)) == ESP_OK || temp[0]) {
                    copy_string(error_out, error_out_len, temp);
                } else {
                    snprintf(error_out, error_out_len, "STT HTTP %d", status);
                }
            } else {
                snprintf(error_out, error_out_len, "STT 请求失败: %s", esp_err_to_name(err));
            }
        }
        err = (err == ESP_OK) ? ESP_FAIL : err;
    }

