akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    http_body_free(body);
    return err;
}

static esp_err_t perform_tts_request(const char *text, binary_buffer_t *audio_out,
                                     char *error_out, size_t error_out_len)
{
    if (!text || !audio_out) {
        return ESP_ERR_INVALID_ARG;
    }
    memset(audio_out, 0, sizeof(*audio_out));
    if (error_out && error_out_len) {
        error_out[0] = '\0';
    }

    char tts_url[224] = {0};
    build_api_endpoint_url("audio/speech", tts_url, sizeof(tts_url));
    if (tts_url[0] == '\0') {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "无法生成语音合成地址");
        }
        return ESP_ERR_INVALID_ARG;
    }

    cJSON *root = cJSON_CreateObject();
    if (!root) {
        return ESP_ERR_NO_MEM;
    }
    cJSON_AddStringToObject(root, "model", "gpt-4o-mini-tts");
    cJSON_AddStringToObject(root, "input", text);
    cJSON_AddStringToObject(root, "voice", "alloy");
    cJSON_AddStringToObject(root, "response_format", "wav");
    cJSON_AddNumberToObject(root, "speed", 1.0);
    char *payload = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    if (!payload) {
        return ESP_ERR_NO_MEM;
    }

    esp_http_client_config_t config = {
        .url = tts_url,
        .timeout_ms = VOICE_AI_TIMEOUT_MS,
        .event_handler = http_binary_event_cb,
        .user_data = audio_out,
        .disable_auto_redirect = false,
        .buffer_size = 2048,
        .buffer_size_tx = 2048,
        .keep_alive_enable = false,
    };
#if CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
    if (strncasecmp(tts_url, "https://", 8) == 0) {
        config.crt_bundle_attach = esp_crt_bundle_attach;
    }
#endif

    esp_transport_handle_t proxy_transport = http_client_attach_proxy(&config, tts_url);
    esp_http_client_handle_t client = esp_http_client_init(&config);
    if (!client) {
        http_client_destroy_proxy_transport(proxy_transport);
        free(payload);
        return ESP_ERR_NO_MEM;
    }

    esp_http_client_set_method(client, HTTP_METHOD_POST);
    esp_http_client_set_header(client, "Content-Type", "application/json");
    if (g_app.cfg.api_key[0]) {
        char auth[224] = {0};
        snprintf(auth, sizeof(auth), "Bearer %s", g_app.cfg.api_key);
        esp_http_client_set_header(client, "Authorization", auth);
    }
    esp_http_client_set_post_field(client, payload, strlen(payload));

    esp_err_t err = esp_http_client_perform(client);
    int status = esp_http_client_get_status_code(client);
    esp_http_client_cleanup(client);
    http_client_destroy_proxy_transport(proxy_transport);
    free(payload);

    if (err != ESP_OK) {
        if (error_out && error_out_len) {
            snprintf(error_out, error_out_len, "TTS 请求失败: %s", esp_err_to_name(err));
        }
        binary_buffer_free(audio_out);
        return err;
    }
    if (status < 200 || status >= 300) {
        if (error_out && error_out_len) {
            snprintf(error_out, error_out_len, "TTS HTTP %d", status);
        }
        binary_buffer_free(audio_out);
        return ESP_FAIL;
    }
    if (audio_out->truncated || !audio_out->data || audio_out->len == 0) {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, audio_out->truncated ? "TTS 音频过大" : "TTS 返回为空");
        }
        binary_buffer_free(audio_out);
        return ESP_FAIL;
    }
    return ESP_OK;
}

static esp_err_t record_voice_wav(binary_buffer_t *wav_out, char *error_out, size_t error_out_len)
{
    if (!wav_out) {
        return ESP_ERR_INVALID_ARG;
    }
    memset(wav_out, 0, sizeof(*wav_out));
    if (error_out && error_out_len) {
        error_out[0] = '\0';
    }

    const size_t sample_bytes = VOICE_BITS_PER_SAMPLE / 8;
    const size_t output_frame_bytes = VOICE_CHANNELS * sample_bytes;
    const size_t capture_frame_bytes = VOICE_CAPTURE_CHANNELS * sample_bytes;
    size_t max_pcm_bytes = (size_t)VOICE_SAMPLE_RATE * output_frame_bytes * VOICE_MAX_SECONDS;
    size_t total_bytes = 44 + max_pcm_bytes;
    uint8_t *data = heap_caps_malloc(total_bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!data) {
        data = heap_caps_malloc(total_bytes, MALLOC_CAP_8BIT);
    }
    if (!data) {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "分配录音缓冲失败");
        }
        return ESP_ERR_NO_MEM;
    }
    memset(data, 0, total_bytes);

    size_t capture_chunk_frames = VOICE_READ_CHUNK_BYTES / capture_frame_bytes;
    if (capture_chunk_frames < 256) {
        capture_chunk_frames = 256;
    }
    size_t capture_chunk_bytes = capture_chunk_frames * capture_frame_bytes;
    uint8_t *capture = heap_caps_malloc(capture_chunk_bytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    if (!capture) {
        capture = heap_caps_malloc(capture_chunk_bytes, MALLOC_CAP_8BIT);
    }
    if (!capture) {
        free(data);
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "分配录音临时缓冲失败");
        }
        return ESP_ERR_NO_MEM;
    }

    if (g_app.audio_lock) {
        xSemaphoreTake(g_app.audio_lock, portMAX_DELAY);
    }
    pmic_audio_power_set(true);

    if (!g_app.mic_dev) {
        g_app.mic_dev = bsp_audio_codec_microphone_init();
    }
    if (!g_app.mic_dev) {
        pmic_audio_power_set(false);
        gpio_set_level(BSP_POWER_AMP_IO, 0);
        if (g_app.audio_lock) {
            xSemaphoreGive(g_app.audio_lock);
        }
        free(capture);
        free(data);
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "麦克风初始化失败");
        }
        return ESP_FAIL;
    }

    esp_codec_dev_sample_info_t capture_fs = {
        .bits_per_sample = VOICE_BITS_PER_SAMPLE,
        .channel = VOICE_CAPTURE_CHANNELS,
        .channel_mask = ESP_CODEC_DEV_MAKE_CHANNEL_MASK(0),
        .sample_rate = VOICE_SAMPLE_RATE,
        .mclk_multiple = 256,
    };
    esp_codec_dev_sample_info_t wav_fs = {
        .bits_per_sample = VOICE_BITS_PER_SAMPLE,
        .channel = VOICE_CHANNELS,
        .channel_mask = ESP_CODEC_DEV_MAKE_CHANNEL_MASK(0),
        .sample_rate = VOICE_SAMPLE_RATE,
        .mclk_multiple = 256,
    };
    int open_ret = esp_codec_dev_open(g_app.mic_dev, &capture_fs);
    if (open_ret != ESP_CODEC_DEV_OK) {
        pmic_audio_power_set(false);
        gpio_set_level(BSP_POWER_AMP_IO, 0);
        if (g_app.audio_lock) {
            xSemaphoreGive(g_app.audio_lock);
        }
        free(capture);
        free(data);
        if (error_out && error_out_len) {
            snprintf(error_out, error_out_len, "打开麦克风失败(%d)", open_ret);
        }
        return ESP_FAIL;
    }
    int mute_ret = esp_codec_dev_set_in_mute(g_app.mic_dev, false);
    if (mute_ret != ESP_CODEC_DEV_OK) {
        ESP_LOGW(TAG, "mic unmute failed: %d", mute_ret);
    }
    int gain_ret = esp_codec_dev_set_in_gain(g_app.mic_dev, VOICE_MIC_GAIN_DB);
    if (gain_ret != ESP_CODEC_DEV_OK) {
        ESP_LOGW(TAG, "mic gain failed: %d", gain_ret);
    }

    size_t pcm_bytes = 0;
    bool speech_started = false;
    int idle_ms = 0;
    int total_ms = 0;
    int energy_log_ms = 0;
    int64_t max_energy = 0;
    int64_t max_left_energy = 0;
    int64_t max_right_energy = 0;
    int64_t noise_energy_sum = 0;
    uint32_t noise_energy_count = 0;
    uint32_t speech_candidate_chunks = 0;
    uint32_t left_chunks = 0;
    uint32_t right_chunks = 0;
    size_t min_pcm_bytes = ((size_t)VOICE_SAMPLE_RATE * output_frame_bytes * VOICE_MIN_RECORD_MS) / 1000;

