akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    while (pcm_bytes < max_pcm_bytes) {
        size_t remain_frames = (max_pcm_bytes - pcm_bytes) / output_frame_bytes;
        size_t request_frames = MIN(capture_chunk_frames, remain_frames);
        size_t request = request_frames * capture_frame_bytes;
        if (request == 0) {
            break;
        }
        int read_ret = esp_codec_dev_read(g_app.mic_dev, capture, (int)request);
        if (read_ret != ESP_CODEC_DEV_OK) {
            if (error_out && error_out_len) {
                snprintf(error_out, error_out_len, "录音失败(%d)", read_ret);
            }
            break;
        }
        size_t got_capture_bytes = request;
        size_t got_frames = got_capture_bytes / capture_frame_bytes;
        if (got_frames == 0) {
            continue;
        }
        if (got_frames > remain_frames) {
            got_frames = remain_frames;
        }
        int chunk_ms = (int)((got_frames * 1000u) / VOICE_SAMPLE_RATE);
        if (chunk_ms <= 0) {
            chunk_ms = 1;
        }

        const int16_t *capture_samples = (const int16_t *)capture;
        int64_t left_energy_sum = 0;
        int64_t right_energy_sum = 0;
        for (size_t i = 0; i < got_frames; ++i) {
            int32_t left = capture_samples[i * VOICE_CAPTURE_CHANNELS + 0];
            int32_t right = (VOICE_CAPTURE_CHANNELS > 1) ?
                capture_samples[i * VOICE_CAPTURE_CHANNELS + 1] : left;
            left_energy_sum += (left < 0) ? -(int64_t)left : (int64_t)left;
            right_energy_sum += (right < 0) ? -(int64_t)right : (int64_t)right;
        }
        int64_t left_energy = left_energy_sum / (int64_t)got_frames;
        int64_t right_energy = right_energy_sum / (int64_t)got_frames;
        bool use_right = (VOICE_CAPTURE_CHANNELS > 1) && right_energy > left_energy;
        if (use_right) {
            ++right_chunks;
        } else {
            ++left_chunks;
        }
        if (left_energy > max_left_energy) {
            max_left_energy = left_energy;
        }
        if (right_energy > max_right_energy) {
            max_right_energy = right_energy;
        }
        if (total_ms < VOICE_WARMUP_DISCARD_MS) {
            total_ms += chunk_ms;
            continue;
        }

        int16_t *out_samples = (int16_t *)(data + 44 + pcm_bytes);
        for (size_t i = 0; i < got_frames; ++i) {
            out_samples[i] = capture_samples[i * VOICE_CAPTURE_CHANNELS + (use_right ? 1 : 0)];
        }

        size_t got_bytes = got_frames * output_frame_bytes;
        pcm_bytes += got_bytes;

        size_t sample_count = got_bytes / 2;
        int64_t energy = pcm_chunk_energy_16bit(out_samples, sample_count);
        if (energy > max_energy) {
            max_energy = energy;
        }
        total_ms += chunk_ms;
        energy_log_ms += chunk_ms;
        int64_t vad_threshold = VOICE_SPEECH_THRESHOLD;
        if (!speech_started && total_ms <= VOICE_NOISE_CALIBRATE_MS) {
            noise_energy_sum += energy;
            ++noise_energy_count;
        }
        if (noise_energy_count > 0) {
            int64_t noise_floor = noise_energy_sum / (int64_t)noise_energy_count;
            int64_t adaptive_threshold = noise_floor * 2 + 260;
            if (adaptive_threshold > vad_threshold) {
                vad_threshold = adaptive_threshold;
            }
        }
        if (vad_threshold > VOICE_FORCE_SPEECH_THRESHOLD) {
            vad_threshold = VOICE_FORCE_SPEECH_THRESHOLD;
        }

        if (energy_log_ms >= VOICE_ENERGY_LOG_MS) {
            energy_log_ms = 0;
            ESP_LOGI(TAG, "voice rec: ms=%d energy=%lld threshold=%lld L=%lld R=%lld max=%lld speech=%d",
                     total_ms, (long long)energy, (long long)vad_threshold,
                     (long long)left_energy, (long long)right_energy,
                     (long long)max_energy, speech_started ? 1 : 0);
        }

        bool speech_chunk = energy >= vad_threshold || energy >= VOICE_FORCE_SPEECH_THRESHOLD;
        if (!speech_started) {
            if (speech_chunk) {
                ++speech_candidate_chunks;
                if (speech_candidate_chunks >= VOICE_SPEECH_START_CHUNKS) {
                    speech_started = true;
                    idle_ms = 0;
                }
            } else {
                speech_candidate_chunks = 0;
            }
        } else if (speech_chunk) {
            idle_ms = 0;
        } else {
            idle_ms += chunk_ms;
        }

        if (!speech_started && total_ms >= VOICE_MAX_IDLE_MS) {
            break;
        }
        if (speech_started && pcm_bytes >= min_pcm_bytes && idle_ms >= VOICE_SILENCE_MS) {
            break;
        }
    }

    esp_codec_dev_close(g_app.mic_dev);
    gpio_set_level(BSP_POWER_AMP_IO, 0);
    pmic_audio_power_set(false);
    if (g_app.audio_lock) {
        xSemaphoreGive(g_app.audio_lock);
    }
    free(capture);

    ESP_LOGI(TAG, "voice rec: done ms=%d bytes=%u max=%lld Lmax=%lld Rmax=%lld pick=L%u/R%u speech=%d",
             total_ms, (unsigned)pcm_bytes, (long long)max_energy,
             (long long)max_left_energy, (long long)max_right_energy,
             (unsigned)left_chunks, (unsigned)right_chunks, speech_started ? 1 : 0);

    if (!speech_started) {
        free(data);
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "没有检测到语音，请靠近一点再试");
        }
        return ESP_ERR_NOT_FOUND;
    }
    if (pcm_bytes == 0) {
        free(data);
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "录音为空");
        }
        return ESP_FAIL;
    }

    esp_err_t header_err = build_wav_header(data, pcm_bytes, &wav_fs);
    if (header_err != ESP_OK) {
        free(data);
        return header_err;
    }
    wav_out->data = data;
    wav_out->len = pcm_bytes + 44;
    wav_out->cap = total_bytes;
    wav_out->truncated = false;
    return ESP_OK;
}

static esp_err_t play_wav_audio(uint8_t *data, size_t len, char *error_out, size_t error_out_len)
{
    if (!data || len == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    if (error_out && error_out_len) {
        error_out[0] = '\0';
    }

    wav_audio_info_t wav = {0};
    if (!parse_wav_audio(data, len, &wav)) {
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "TTS 返回的不是 16-bit WAV");
        }
        return ESP_FAIL;
    }

