akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    if (g_app.audio_lock) {
        xSemaphoreTake(g_app.audio_lock, portMAX_DELAY);
    }
    pmic_audio_power_set(true);
    if (!g_app.speaker_dev) {
        g_app.speaker_dev = bsp_audio_codec_speaker_init();
    }
    if (!g_app.speaker_dev) {
        pmic_audio_power_set(false);
        gpio_set_level(BSP_POWER_AMP_IO, 0);
        if (g_app.audio_lock) {
            xSemaphoreGive(g_app.audio_lock);
        }
        if (error_out && error_out_len) {
            copy_string(error_out, error_out_len, "扬声器初始化失败");
        }
        return ESP_FAIL;
    }

    esp_codec_dev_sample_info_t fs = {0};
    build_wav_sample_info(&wav, &fs);
    int open_ret = esp_codec_dev_open(g_app.speaker_dev, &fs);
    if (open_ret != ESP_CODEC_DEV_OK) {
        pmic_audio_power_set(false);
        gpio_set_level(BSP_POWER_AMP_IO, 0);
        if (g_app.audio_lock) {
            xSemaphoreGive(g_app.audio_lock);
        }
        if (error_out && error_out_len) {
            snprintf(error_out, error_out_len, "打开扬声器失败(%d)", open_ret);
        }
        return ESP_FAIL;
    }

    int vol_ret = esp_codec_dev_set_out_vol(g_app.speaker_dev, VOICE_PLAY_VOLUME);
    if (vol_ret != ESP_CODEC_DEV_OK) {
        ESP_LOGW(TAG, "speaker volume failed: %d", vol_ret);
    }

    esp_err_t err = ESP_OK;
    size_t offset = wav.data_offset;
    size_t end = wav.data_offset + wav.data_len;
    while (offset < end) {
        if (g_app.ai_tts_stop_requested) {
            ESP_LOGI(TAG, "voice: play interrupted");
            err = ESP_ERR_INVALID_STATE;
            if (error_out && error_out_len) {
                copy_string(error_out, error_out_len, "播放已打断");
            }
            break;
        }
        size_t chunk = MIN((size_t)4096, end - offset);
        int write_ret = esp_codec_dev_write(g_app.speaker_dev, data + offset, (int)chunk);
        if (write_ret != ESP_CODEC_DEV_OK) {
            if (error_out && error_out_len) {
                snprintf(error_out, error_out_len, "播放失败(%d)", write_ret);
            }
            err = ESP_FAIL;
            break;
        }
        offset += chunk;
    }

    esp_codec_dev_close(g_app.speaker_dev);
    gpio_set_level(BSP_POWER_AMP_IO, 0);
    pmic_audio_power_set(false);
    if (g_app.audio_lock) {
        xSemaphoreGive(g_app.audio_lock);
    }
    return err;
}

static void format_price(const char *symbol, double value, char *out, size_t out_size)
{
    (void)symbol;
    if (value <= 0.0) {
        copy_string(out, out_size, "--");
    } else if (value >= 100000.0) {
        snprintf(out, out_size, "%.1fk", value / 1000.0);
    } else if (value >= 1000.0) {
        snprintf(out, out_size, "%.0f", value);
    } else if (value >= 100.0) {
        snprintf(out, out_size, "%.1f", value);
    } else {
        snprintf(out, out_size, "%.2f", value);
    }
}

static void format_change(double value, char *out, size_t out_size)
{
    snprintf(out, out_size, "%+.1f%%", value);
}

static void mark_market_time_now(void)
{
    time_t now = 0;
    struct tm tm_now = {0};
    time(&now);
    localtime_r(&now, &tm_now);
    if (tm_now.tm_year >= 120) {
        snprintf(g_app.market_time, sizeof(g_app.market_time), "%02d:%02d",
                 tm_now.tm_hour, tm_now.tm_min);
    }
}

static bool clock_is_valid(void)
{
    time_t now = 0;
    struct tm tm_now = {0};
    time(&now);
    localtime_r(&now, &tm_now);
    return tm_now.tm_year >= 120;
}

static bool clock_is_ready_for_tls(void)
{
    if (!clock_is_valid()) {
        return false;
    }
    if (g_app.sntp_started &&
        esp_sntp_get_sync_status() != SNTP_SYNC_STATUS_COMPLETED) {
        return false;
    }
    return true;
}

static bool api_url_uses_https(void)
{
    return strncasecmp(g_app.cfg.server_url, "https://", 8) == 0;
}

static void wait_for_clock_once(int timeout_ms)
{
    int waited_ms = 0;
    while (!clock_is_ready_for_tls() && waited_ms < timeout_ms) {
        vTaskDelay(pdMS_TO_TICKS(200));
        waited_ms += 200;
    }
}

static bool parse_yahoo_chart(const char *body, int row_index, bool update_chart)
{
    if (!body || row_index < 0 || row_index >= MARKET_ROW_COUNT) {
        return false;
    }

    cJSON *root = cJSON_Parse(body);
    if (!root) {
        return false;
    }

    cJSON *chart = cJSON_GetObjectItemCaseSensitive(root, "chart");
    cJSON *results = cJSON_IsObject(chart) ? cJSON_GetObjectItemCaseSensitive(chart, "result") : NULL;
    cJSON *result = cJSON_IsArray(results) ? cJSON_GetArrayItem(results, 0) : NULL;
    cJSON *meta = cJSON_IsObject(result) ? cJSON_GetObjectItemCaseSensitive(result, "meta") : NULL;
    cJSON *indicators = cJSON_IsObject(result) ? cJSON_GetObjectItemCaseSensitive(result, "indicators") : NULL;
    cJSON *quotes = cJSON_IsObject(indicators) ? cJSON_GetObjectItemCaseSensitive(indicators, "quote") : NULL;
    cJSON *quote = cJSON_IsArray(quotes) ? cJSON_GetArrayItem(quotes, 0) : NULL;
    cJSON *close_array = cJSON_IsObject(quote) ? cJSON_GetObjectItemCaseSensitive(quote, "close") : NULL;
    if (!cJSON_IsArray(close_array)) {
        cJSON_Delete(root);
        return false;
    }

    double points[CHART_POINT_COUNT] = {0};
    int point_count = 0;
    int close_count = cJSON_GetArraySize(close_array);
    for (int i = 0; i < close_count; i++) {
        cJSON *item = cJSON_GetArrayItem(close_array, i);
        if (!cJSON_IsNumber(item) || item->valuedouble <= 0.0) {
            continue;
        }
        if (point_count < CHART_POINT_COUNT) {
            points[point_count++] = item->valuedouble;
        } else {
            memmove(points, points + 1, sizeof(double) * (CHART_POINT_COUNT - 1));
            points[CHART_POINT_COUNT - 1] = item->valuedouble;
        }
    }

    cJSON *regular_price = cJSON_IsObject(meta) ?
        cJSON_GetObjectItemCaseSensitive(meta, "regularMarketPrice") : NULL;
    double price = cJSON_IsNumber(regular_price) ? regular_price->valuedouble : 0.0;
    if (price <= 0.0 && point_count > 0) {
        price = points[point_count - 1];
    }
    if (price <= 0.0 || point_count <= 0) {
        cJSON_Delete(root);
        return false;
    }

    points[point_count - 1] = price;
    cJSON *chart_previous = cJSON_IsObject(meta) ?
        cJSON_GetObjectItemCaseSensitive(meta, "chartPreviousClose") : NULL;
    double previous = cJSON_IsNumber(chart_previous) ? chart_previous->valuedouble : 0.0;
    if (update_chart && point_count >= 2) {
        previous = points[0];
    } else if (previous <= 0.0 && point_count >= 2) {
        previous = points[0];
    }

    char price_text[24] = {0};
    char change_text[16] = {0};
    format_price(MARKET_DEFS[row_index].code, price, price_text, sizeof(price_text));
    if (previous > 0.0) {
        format_change(((price - previous) / previous) * 100.0, change_text, sizeof(change_text));
    } else {
        copy_string(change_text, sizeof(change_text), "--");
    }

