akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    copy_string(g_app.market_rows[row_index].price, sizeof(g_app.market_rows[row_index].price),
                price_text);
    copy_string(g_app.market_rows[row_index].change, sizeof(g_app.market_rows[row_index].change),
                change_text);
    if (update_chart) {
        memcpy(g_app.chart_values, points, sizeof(double) * point_count);
        g_app.chart_point_count = point_count;
    }

    cJSON_Delete(root);
    return true;
}

static bool json_item_to_double(cJSON *item, double *out)
{
    if (!out) {
        return false;
    }
    if (cJSON_IsNumber(item)) {
        *out = item->valuedouble;
        return true;
    }
    if (cJSON_IsString(item) && item->valuestring && item->valuestring[0]) {
        char *end = NULL;
        double value = strtod(item->valuestring, &end);
        if (end && end != item->valuestring) {
            *out = value;
            return true;
        }
    }
    return false;
}

static bool update_market_row_quote(int row_index, double price, double change_pct)
{
    if (row_index < 0 || row_index >= MARKET_ROW_COUNT || price <= 0.0) {
        return false;
    }
    char price_text[24] = {0};
    char change_text[16] = {0};
    format_price(MARKET_DEFS[row_index].code, price, price_text, sizeof(price_text));
    format_change(change_pct, change_text, sizeof(change_text));
    copy_string(g_app.market_rows[row_index].price,
                sizeof(g_app.market_rows[row_index].price), price_text);
    copy_string(g_app.market_rows[row_index].change,
                sizeof(g_app.market_rows[row_index].change), change_text);
    return true;
}

static bool update_crypto_market_row(int row_index, double price, double change_pct)
{
    return update_market_row_quote(row_index, price, change_pct);
}

static esp_err_t market_http_request_auto(const char *url, char *body, size_t body_size)
{
    memset(body, 0, body_size);
    return direct_http_request_no_proxy(url, NULL, DIRECT_HTTP_TIMEOUT_MS,
                                        false, body, body_size);
}

static int row_index_from_eastmoney_code(const char *code)
{
    if (!code || !code[0]) {
        return -1;
    }
    if (strcmp(code, "GC00Y") == 0) {
        return 2;
    }
    if (strcmp(code, "CL00Y") == 0) {
        return 3;
    }
    if (strcmp(code, "UDI") == 0) {
        return 4;
    }
    if (strcmp(code, "USDCNH") == 0 || strcmp(code, "USDCNYC") == 0) {
        return 5;
    }
    if (strcmp(code, "EURUSD") == 0) {
        return 6;
    }
    if (strcmp(code, "000001") == 0) {
        return 8;
    }
    if (strcmp(code, "HSI") == 0) {
        return 9;
    }
    if (strcmp(code, "N225") == 0) {
        return 10;
    }
    if (strcmp(code, "GDAXI") == 0) {
        return 11;
    }
    if (strcmp(code, "FTSE") == 0) {
        return 12;
    }
    if (strcmp(code, "SPX") == 0) {
        return 13;
    }
    if (strcmp(code, "NDX100") == 0) {
        return 14;
    }
    return -1;
}

static const char *eastmoney_secid_for_row(int row_index)
{
    switch (row_index) {
    case 2:
        return "101.GC00Y";
    case 3:
        return "102.CL00Y";
    case 4:
        return "100.UDI";
    case 5:
        return "133.USDCNH";
    case 6:
        return "119.EURUSD";
    case 8:
        return "1.000001";
    case 9:
        return "100.HSI";
    case 10:
        return "100.N225";
    case 11:
        return "100.GDAXI";
    case 12:
        return "100.FTSE";
    case 13:
        return "100.SPX";
    case 14:
        return "100.NDX100";
    default:
        return NULL;
    }
}

static int parse_eastmoney_market(const char *body, int expected_row, double *last_price_out,
                                  double *last_change_out)
{
    if (!body || !body[0]) {
        return 0;
    }

    cJSON *root = cJSON_Parse(body);
    if (!root) {
        return 0;
    }
    cJSON *data = cJSON_GetObjectItemCaseSensitive(root, "data");
    cJSON *diff = cJSON_IsObject(data) ? cJSON_GetObjectItemCaseSensitive(data, "diff") : NULL;
    if (!cJSON_IsArray(diff)) {
        cJSON_Delete(root);
        return 0;
    }

    bool updated[MARKET_ROW_COUNT] = {0};
    int ok_count = 0;
    cJSON *item = NULL;
    cJSON_ArrayForEach(item, diff) {
        cJSON *code = cJSON_GetObjectItemCaseSensitive(item, "f12");
        cJSON *price_item = cJSON_GetObjectItemCaseSensitive(item, "f2");
        cJSON *change_item = cJSON_GetObjectItemCaseSensitive(item, "f3");
        if (!cJSON_IsString(code)) {
            continue;
        }
        int row_index = row_index_from_eastmoney_code(code->valuestring);
        if (expected_row >= 0 && row_index != expected_row) {
            continue;
        }
        if (row_index < 0 || row_index >= MARKET_ROW_COUNT || updated[row_index]) {
            continue;
        }

        double price = 0.0;
        double change_pct = 0.0;
        if (!json_item_to_double(price_item, &price) ||
            !json_item_to_double(change_item, &change_pct) ||
            !update_market_row_quote(row_index, price, change_pct)) {
            continue;
        }
        updated[row_index] = true;
        ok_count++;
        if (last_price_out) {
            *last_price_out = price;
        }
        if (last_change_out) {
            *last_change_out = change_pct;
        }
    }

    cJSON_Delete(root);
    return ok_count;
}

static bool csv_field_to_double(const char *csv, int field_index, double *out)
{
    if (!csv || field_index < 0 || !out) {
        return false;
    }

    const char *p = csv;
    for (int i = 0; i < field_index; ++i) {
        p = strchr(p, ',');
        if (!p) {
            return false;
        }
        p++;
    }

    char value[32] = {0};
    size_t len = 0;
    while (p[len] && p[len] != ',' && p[len] != '"' && p[len] != ';' && len < sizeof(value) - 1) {
        value[len] = p[len];
        len++;
    }
    if (len == 0) {
        return false;
    }

    char *end = NULL;
    double parsed = strtod(value, &end);
    if (!end || end == value) {
        return false;
    }
    *out = parsed;
    return true;
}

static const char *sina_quote_fields(const char *body, const char *code)
{
    if (!body || !code || !code[0]) {
        return NULL;
    }

