akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    char marker[48] = {0};
    snprintf(marker, sizeof(marker), "hq_str_%s=\"", code);
    const char *start = strstr(body, marker);
    if (!start) {
        return NULL;
    }
    start += strlen(marker);
    return *start ? start : NULL;
}

static bool parse_sina_vix_market(const char *body, double *price_out, double *change_out)
{
    const char *fields = sina_quote_fields(body, "b_VIX");
    if (!fields) {
        return false;
    }

    double price = 0.0;
    double change_pct = 0.0;
    if (!csv_field_to_double(fields, 1, &price) ||
        !csv_field_to_double(fields, 3, &change_pct)) {
        return false;
    }
    if (!update_market_row_quote(7, price, change_pct)) {
        return false;
    }
    if (price_out) {
        *price_out = price;
    }
    if (change_out) {
        *change_out = change_pct;
    }
    return true;
}

static void synthesize_quote_chart(double price, double change_pct)
{
    if (price <= 0.0) {
        g_app.chart_point_count = 0;
        return;
    }

    double previous = price;
    double divisor = 1.0 + (change_pct / 100.0);
    if (divisor > 0.05) {
        previous = price / divisor;
    }
    if (previous <= 0.0) {
        previous = price;
    }

    double delta = price - previous;
    double wiggle = delta >= 0.0 ? delta * 0.08 : -delta * 0.08;
    if (wiggle < price * 0.0008) {
        wiggle = price * 0.0008;
    }
    for (int i = 0; i < CHART_POINT_COUNT; ++i) {
        double t = (double)i / (double)(CHART_POINT_COUNT - 1);
        double smooth = t * t * (3.0 - 2.0 * t);
        double value = previous + delta * smooth;
        int phase = i % 6;
        double nudge = ((double)phase - 2.5) * wiggle * 0.08;
        if (i == 0) {
            value = previous;
        } else if (i == CHART_POINT_COUNT - 1) {
            value = price;
        } else {
            value += nudge;
        }
        if (value <= 0.0) {
            value = price;
        }
        g_app.chart_values[i] = value;
    }
    g_app.chart_point_count = CHART_POINT_COUNT;
}

static int parse_coingecko_home_market(const char *body)
{
    if (!body || !body[0]) {
        return 0;
    }
    cJSON *root = cJSON_Parse(body);
    if (!root) {
        return 0;
    }

    struct {
        const char *json_key;
        int row_index;
    } coins[] = {
        {"bitcoin", 0},
        {"ethereum", 1},
    };

    int ok_count = 0;
    for (size_t i = 0; i < sizeof(coins) / sizeof(coins[0]); i++) {
        cJSON *coin = cJSON_GetObjectItemCaseSensitive(root, coins[i].json_key);
        cJSON *usd = cJSON_IsObject(coin) ? cJSON_GetObjectItemCaseSensitive(coin, "usd") : NULL;
        cJSON *change = cJSON_IsObject(coin) ? cJSON_GetObjectItemCaseSensitive(coin, "usd_24h_change") : NULL;
        if (!cJSON_IsNumber(usd) || usd->valuedouble <= 0.0) {
            continue;
        }
        char price_text[24] = {0};
        char change_text[16] = {0};
        format_price(MARKET_DEFS[coins[i].row_index].code, usd->valuedouble,
                     price_text, sizeof(price_text));
        if (cJSON_IsNumber(change)) {
            format_change(change->valuedouble, change_text, sizeof(change_text));
        } else {
            copy_string(change_text, sizeof(change_text), "--");
        }
        copy_string(g_app.market_rows[coins[i].row_index].price,
                    sizeof(g_app.market_rows[coins[i].row_index].price), price_text);
        copy_string(g_app.market_rows[coins[i].row_index].change,
                    sizeof(g_app.market_rows[coins[i].row_index].change), change_text);
        ok_count++;
    }

    cJSON_Delete(root);
    return ok_count;
}

static bool parse_gate_crypto_ticker(const char *body, int row_index)
{
    if (!body || !body[0]) {
        return false;
    }
    cJSON *root = cJSON_Parse(body);
    if (!root) {
        return false;
    }
    cJSON *item = cJSON_IsArray(root) ? cJSON_GetArrayItem(root, 0) : NULL;
    cJSON *last = cJSON_IsObject(item) ? cJSON_GetObjectItemCaseSensitive(item, "last") : NULL;
    cJSON *change = cJSON_IsObject(item) ? cJSON_GetObjectItemCaseSensitive(item, "change_percentage") : NULL;
    double price = 0.0;
    double change_pct = 0.0;
    bool ok = json_item_to_double(last, &price) &&
              json_item_to_double(change, &change_pct) &&
              update_crypto_market_row(row_index, price, change_pct);
    cJSON_Delete(root);
    return ok;
}

static bool parse_huobi_crypto_ticker(const char *body, int row_index)
{
    if (!body || !body[0]) {
        return false;
    }
    cJSON *root = cJSON_Parse(body);
    if (!root) {
        return false;
    }
    cJSON *status = cJSON_GetObjectItemCaseSensitive(root, "status");
    cJSON *tick = cJSON_GetObjectItemCaseSensitive(root, "tick");
    cJSON *close_item = cJSON_IsObject(tick) ? cJSON_GetObjectItemCaseSensitive(tick, "close") : NULL;
    cJSON *open_item = cJSON_IsObject(tick) ? cJSON_GetObjectItemCaseSensitive(tick, "open") : NULL;
    double price = 0.0;
    double open = 0.0;
    bool status_ok = !cJSON_IsString(status) || strcmp(status->valuestring, "ok") == 0;
    bool ok = status_ok &&
              json_item_to_double(close_item, &price) &&
              json_item_to_double(open_item, &open) &&
              open > 0.0 &&
              update_crypto_market_row(row_index, price, ((price - open) / open) * 100.0);
    cJSON_Delete(root);
    return ok;
}

static bool parse_binance_crypto_ticker(const char *body, int row_index)
{
    if (!body || !body[0]) {
        return false;
    }
    cJSON *root = cJSON_Parse(body);
    if (!root) {
        return false;
    }
    cJSON *last = cJSON_GetObjectItemCaseSensitive(root, "lastPrice");
    cJSON *change = cJSON_GetObjectItemCaseSensitive(root, "priceChangePercent");
    double price = 0.0;
    double change_pct = 0.0;
    bool ok = json_item_to_double(last, &price) &&
              json_item_to_double(change, &change_pct) &&
              update_crypto_market_row(row_index, price, change_pct);
    cJSON_Delete(root);
    return ok;
}

static bool refresh_crypto_row_from_regional_sources(int row_index, const char *base_symbol,
                                                     char *body, size_t body_size)
{
    char url[192] = {0};

