akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    snprintf(url, sizeof(url), GATE_TICKER_URL_FMT, base_symbol);
    if (market_http_request_auto(url, body, body_size) == ESP_OK &&
        parse_gate_crypto_ticker(body, row_index)) {
        return true;
    }

    snprintf(url, sizeof(url), HUOBI_TICKER_URL_FMT, base_symbol);
    for (char *p = strstr(url, "symbol="); p && *p; ++p) {
        *p = (char)tolower((unsigned char)*p);
    }
    if (market_http_request_auto(url, body, body_size) == ESP_OK &&
        parse_huobi_crypto_ticker(body, row_index)) {
        return true;
    }

    snprintf(url, sizeof(url), BINANCE_TICKER_URL_FMT, base_symbol);
    if (market_http_request_auto(url, body, body_size) == ESP_OK &&
        parse_binance_crypto_ticker(body, row_index)) {
        return true;
    }

    return false;
}

static int refresh_crypto_from_regional_sources(char *body, size_t body_size)
{
    struct {
        int row_index;
        const char *base_symbol;
    } coins[] = {
        {0, "BTC"},
        {1, "ETH"},
    };

    int ok_count = 0;
    for (size_t i = 0; i < sizeof(coins) / sizeof(coins[0]); i++) {
        if (refresh_crypto_row_from_regional_sources(coins[i].row_index,
                                                     coins[i].base_symbol,
                                                     body, body_size)) {
            ok_count++;
        }
    }
    if (ok_count > 0) {
        mark_market_time_now();
    }
    return ok_count;
}

static int refresh_crypto_from_coingecko(char *body, size_t body_size)
{
    esp_err_t err = market_http_request_auto(COINGECKO_MARKET_URL, body, body_size);
    int ok_count = err == ESP_OK ? parse_coingecko_home_market(body) : 0;
    if (ok_count <= 0) {
        return 0;
    }
    mark_market_time_now();
    return ok_count;
}

static int refresh_crypto_home_market(char *body, size_t body_size)
{
    int ok_count = refresh_crypto_from_regional_sources(body, body_size);
    if (ok_count >= 2) {
        return ok_count;
    }
    int fallback_count = refresh_crypto_from_coingecko(body, body_size);
    return fallback_count > ok_count ? fallback_count : ok_count;
}

static int refresh_domestic_home_market(char *body, size_t body_size)
{
    int ok_count = 0;

    if (market_http_request_auto(EASTMONEY_HOME_URL, body, body_size) == ESP_OK) {
        ok_count += parse_eastmoney_market(body, -1, NULL, NULL);
    }

    if (market_http_request_auto(SINA_VIX_URL, body, body_size) == ESP_OK &&
        parse_sina_vix_market(body, NULL, NULL)) {
        ok_count++;
    }

    if (ok_count > 0) {
        mark_market_time_now();
    }
    return ok_count;
}

static bool refresh_domestic_market_row(int row_index, char *body, size_t body_size,
                                        bool update_chart)
{
    double price = 0.0;
    double change_pct = 0.0;

    const char *secid = eastmoney_secid_for_row(row_index);
    if (secid) {
        char url[224] = {0};
        snprintf(url, sizeof(url), EASTMONEY_QUOTE_URL_FMT, secid);
        if (market_http_request_auto(url, body, body_size) == ESP_OK &&
            parse_eastmoney_market(body, row_index, &price, &change_pct) > 0) {
            if (update_chart) {
                synthesize_quote_chart(price, change_pct);
            }
            return true;
        }
    }

    if (row_index == 7 &&
        market_http_request_auto(SINA_VIX_URL, body, body_size) == ESP_OK &&
        parse_sina_vix_market(body, &price, &change_pct)) {
        if (update_chart) {
            synthesize_quote_chart(price, change_pct);
        }
        return true;
    }

    return false;
}

static bool parse_gateway_market_full(const char *body)
{
    if (!body || !body[0]) {
        return false;
    }

    cJSON *root = cJSON_Parse(body);
    if (!root) {
        return false;
    }
    cJSON *assets = cJSON_GetObjectItemCaseSensitive(root, "assets");
    if (!cJSON_IsArray(assets)) {
        cJSON_Delete(root);
        return false;
    }

    int ok_count = 0;
    cJSON *item = NULL;
    cJSON_ArrayForEach(item, assets) {
        cJSON *code = cJSON_GetObjectItemCaseSensitive(item, "code");
        cJSON *price = cJSON_GetObjectItemCaseSensitive(item, "price");
        cJSON *change = cJSON_GetObjectItemCaseSensitive(item, "change");
        if (!cJSON_IsString(code) || !cJSON_IsString(price) || !cJSON_IsString(change)) {
            continue;
        }
        bool has_price = price->valuestring[0] != '\0' && strcmp(price->valuestring, "--") != 0;
        for (int i = 0; i < MARKET_ROW_COUNT; i++) {
            if (strcmp(code->valuestring, MARKET_DEFS[i].code) == 0) {
                copy_string(g_app.market_rows[i].price, sizeof(g_app.market_rows[i].price), price->valuestring);
                copy_string(g_app.market_rows[i].change, sizeof(g_app.market_rows[i].change), change->valuestring);
                if (has_price) {
                    ok_count++;
                }
                break;
            }
        }
    }

    cJSON *market_time = cJSON_GetObjectItemCaseSensitive(root, "market_time");
    if (cJSON_IsString(market_time) && market_time->valuestring[0]) {
        copy_string(g_app.market_time, sizeof(g_app.market_time), market_time->valuestring);
    } else if (ok_count > 0) {
        mark_market_time_now();
    }
    cJSON *status = cJSON_GetObjectItemCaseSensitive(root, "status");
    if (cJSON_IsString(status) && status->valuestring[0]) {
        copy_string(g_app.market_status, sizeof(g_app.market_status), status->valuestring);
    } else if (ok_count > 0) {
        snprintf(g_app.market_status, sizeof(g_app.market_status), "GW %d", ok_count);
    }
    cJSON_Delete(root);
    return ok_count > 0;
}

static bool refresh_market_from_gateway(char *body, size_t body_size)
{
    if (!api_url_is_local_gateway()) {
        return false;
    }
    char url[224] = {0};
    if (!build_gateway_url("/api/watch/market/full", url, sizeof(url))) {
        return false;
    }
    memset(body, 0, body_size);
    esp_err_t err = direct_http_request(url, NULL, DIRECT_HTTP_TIMEOUT_MS,
                                        true, body, body_size);
    return err == ESP_OK && parse_gateway_market_full(body);
}

static void home_market_refresh_task(void *arg)
{
    (void)arg;
    if (g_app.net_lock) {
        xSemaphoreTake(g_app.net_lock, portMAX_DELAY);
    }

    copy_string(g_app.market_status, sizeof(g_app.market_status), "WiFi");
    ui_refresh_now();
    esp_err_t net_err = wifi_sta_connect_once(WIFI_CONNECT_WAIT_MS);
    if (net_err != ESP_OK) {
        copy_string(g_app.market_status, sizeof(g_app.market_status), "NO WIFI");
        g_app.market_refresh_inflight = false;
        g_app.market_task_started_us = 0;
        wifi_sta_disconnect_when_idle();
        if (g_app.net_lock) {
            xSemaphoreGive(g_app.net_lock);
        }
        ui_refresh_now();
        vTaskDelete(NULL);
        return;
    }

    wait_for_clock_once(12000);

    char *body = http_body_alloc(DIRECT_HTTP_MAX_BODY + 1);
    if (!body) {
        copy_string(g_app.market_status, sizeof(g_app.market_status), "NO MEM");
        g_app.market_refresh_inflight = false;
        g_app.market_task_started_us = 0;
        wifi_sta_disconnect_when_idle();
        if (g_app.net_lock) {
            xSemaphoreGive(g_app.net_lock);
        }
        ui_refresh_now();
        vTaskDelete(NULL);
        return;
    }

    int ok_count = refresh_crypto_home_market(body, DIRECT_HTTP_MAX_BODY + 1);
    if (ok_count > 0) {
        snprintf(g_app.market_status, sizeof(g_app.market_status), "CN %d", ok_count);
        ui_refresh_now();
    }

