akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    int domestic_count = refresh_domestic_home_market(body, DIRECT_HTTP_MAX_BODY + 1);
    if (domestic_count > 0) {
        ok_count += domestic_count;
        snprintf(g_app.market_status, sizeof(g_app.market_status), "CN %d", ok_count);
        ui_refresh_now();
    }

    if (ok_count > 0) {
        mark_market_time_now();
        g_app.market_polled_once = true;
        snprintf(g_app.market_status, sizeof(g_app.market_status), "DIR %d", ok_count);
        (void)market_cache_save();
    } else if (refresh_market_from_gateway(body, DIRECT_HTTP_MAX_BODY + 1)) {
        g_app.market_polled_once = true;
        (void)market_cache_save();
    } else {
        copy_string(g_app.market_status, sizeof(g_app.market_status), "MKT FAIL");
    }

    http_body_free(body);
    g_app.market_refresh_inflight = false;
    g_app.market_task_started_us = 0;
    wifi_sta_disconnect_when_idle();
    if (g_app.net_lock) {
        xSemaphoreGive(g_app.net_lock);
    }
    ui_refresh_now();
    vTaskDelete(NULL);
}

static void home_market_refresh_async(void)
{
    int64_t now_us = esp_timer_get_time();
    if (g_app.market_refresh_inflight || g_app.chart_inflight ||
        g_app.ai_start_inflight || g_app.ai_tts_inflight ||
        g_app.ai_playback_inflight) {
        static int64_t last_busy_log_us;
        if (now_us - last_busy_log_us > 10000000LL) {
            last_busy_log_us = now_us;
            ESP_LOGW(TAG, "home refresh skipped: busy market=%d chart=%d ai=%d tts=%d play=%d",
                     g_app.market_refresh_inflight, g_app.chart_inflight,
                     g_app.ai_start_inflight, g_app.ai_tts_inflight,
                     g_app.ai_playback_inflight);
        }
        return;
    }
    if (!g_app.wifi_started) {
        static int64_t last_no_wifi_start_log_us;
        if (now_us - last_no_wifi_start_log_us > 10000000LL) {
            last_no_wifi_start_log_us = now_us;
            ESP_LOGW(TAG, "home refresh skipped: WiFi not started");
        }
        copy_string(g_app.market_status, sizeof(g_app.market_status), "NO WIFI");
        ui_refresh_now();
        return;
    }
    g_app.sta_configured = config_has_wifi(&g_app.cfg);
    if (!g_app.sta_configured) {
        static int64_t last_no_cfg_log_us;
        if (now_us - last_no_cfg_log_us > 10000000LL) {
            last_no_cfg_log_us = now_us;
            ESP_LOGW(TAG, "home refresh skipped: no STA WiFi config");
        }
        copy_string(g_app.market_status, sizeof(g_app.market_status), "NO CFG");
        ui_refresh_now();
        return;
    }
    g_app.last_market_refresh_us = now_us;
    g_app.market_refresh_inflight = true;
    g_app.market_task_started_us = now_us;
    copy_string(g_app.market_status, sizeof(g_app.market_status), "Starting");
    if (xTaskCreate(home_market_refresh_task, "home_market", 12288, NULL, 4, NULL) != pdPASS) {
        g_app.market_refresh_inflight = false;
        g_app.market_task_started_us = 0;
        copy_string(g_app.market_status, sizeof(g_app.market_status), "NO TASK");
    }
}

static esp_err_t perform_chat_request(const char *user_text, char *reply_out, size_t reply_out_len,
                                      char *error_out, size_t error_out_len)
{
    if (!user_text || !reply_out || reply_out_len == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    reply_out[0] = '\0';
    if (error_out && error_out_len) {
        error_out[0] = '\0';
    }

    cJSON *root = cJSON_CreateObject();
    cJSON *messages = cJSON_AddArrayToObject(root, "messages");
    cJSON *system = cJSON_CreateObject();
    cJSON *user = cJSON_CreateObject();
    if (!root || !messages || !system || !user) {
        cJSON_Delete(root);
        return ESP_ERR_NO_MEM;
    }

    cJSON_AddStringToObject(root, "model", g_app.cfg.model);
    cJSON_AddBoolToObject(root, "stream", false);
    cJSON_AddNumberToObject(root, "temperature", 0.4);
    cJSON_AddNumberToObject(root, "max_tokens", 80);
    cJSON_AddStringToObject(system, "role", "system");
    cJSON_AddStringToObject(system, "content", "你是手表里的中文助手，回复要短、直接、自然，通常不超过30个汉字；只用常用简体中文，不用 emoji、繁体字或生僻字。");
    cJSON_AddStringToObject(user, "role", "user");
    cJSON_AddStringToObject(user, "content", user_text);
    cJSON_AddItemToArray(messages, system);
    cJSON_AddItemToArray(messages, user);

    char *payload = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    if (!payload) {
        return ESP_ERR_NO_MEM;
    }

    char url[224] = {0};
    build_api_endpoint_url("chat/completions", url, sizeof(url));
    char *body = http_body_alloc(DIRECT_HTTP_MAX_BODY + 1);
    if (!body) {
        free(payload);
        return ESP_ERR_NO_MEM;
    }

    esp_err_t err = direct_http_request(url, payload, DIRECT_AI_TIMEOUT_MS, true,
                                        body, DIRECT_HTTP_MAX_BODY + 1);
    free(payload);
    if (err == ESP_OK) {
        err = parse_reply_response(body, reply_out, reply_out_len, error_out, error_out_len);
    } else if (body[0] && error_out && error_out_len) {
        char temp[192] = {0};
        if (parse_reply_response(body, temp, sizeof(temp), temp, sizeof(temp)) == ESP_OK || temp[0]) {
            copy_string(error_out, error_out_len, temp);
        }
    }
    http_body_free(body);
    return err;
}

static void voice_tts_task(void *arg)
{
    voice_tts_job_t *job = (voice_tts_job_t *)arg;
    bool created_with_caps = job ? job->created_with_caps : false;
    bool lock_taken = false;
    binary_buffer_t audio = {0};
    char error_text[192] = {0};
    esp_err_t err = ESP_OK;

    if (!job) {
        goto finish;
    }

    ESP_LOGI(TAG, "voice: background tts start");
    if (g_app.net_lock) {
        xSemaphoreTake(g_app.net_lock, portMAX_DELAY);
        lock_taken = true;
    }

    copy_string(g_app.ai_state, sizeof(g_app.ai_state), "TTS");
    ui_refresh_now();

    if (!g_app.sta_connected) {
        ESP_LOGI(TAG, "voice: tts wifi connect");
        err = wifi_sta_connect_once(WIFI_CONNECT_WAIT_MS);
        if (err != ESP_OK) {
            snprintf(error_text, sizeof(error_text), "WiFi: %s", esp_err_to_name(err));
        }
    }
    if (err == ESP_OK && api_url_uses_https()) {
        wait_for_clock_once(12000);
    }
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "voice: tts request start");
        err = perform_tts_request(job->reply, &audio, error_text, sizeof(error_text));
    }

    if (lock_taken) {
        wifi_sta_disconnect_when_idle();
        xSemaphoreGive(g_app.net_lock);
        lock_taken = false;
    }

    if (err != ESP_OK) {
        ESP_LOGE(TAG, "voice: tts failed: %s err=%s",
                 error_text[0] ? error_text : "tts failed", esp_err_to_name(err));
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "TTS ERR");
        goto finish;
    }

    ESP_LOGI(TAG, "voice: tts request done bytes=%u", (unsigned)audio.len);
    copy_string(g_app.ai_state, sizeof(g_app.ai_state), "PLAY");
    ui_refresh_now();

