akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    ESP_LOGI(TAG, "voice: play start");
    err = play_wav_audio(audio.data, audio.len, error_text, sizeof(error_text));
    if (err != ESP_OK) {
        if (g_app.ai_tts_stop_requested) {
            ESP_LOGI(TAG, "voice: tts interrupted by new recording");
            copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
            goto finish;
        }
        ESP_LOGE(TAG, "voice: play failed: %s err=%s",
                 error_text[0] ? error_text : "play failed", esp_err_to_name(err));
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "PLAY ERR");
        goto finish;
    }

    ESP_LOGI(TAG, "voice: background tts done");
    copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");

finish:
    binary_buffer_free(&audio);
    if (lock_taken) {
        wifi_sta_disconnect_when_idle();
        xSemaphoreGive(g_app.net_lock);
    }
    g_app.ai_tts_inflight = false;
    g_app.tts_task_started_us = 0;
    g_app.ai_tts_stop_requested = false;
    ui_refresh_now();
    free(job);
    if (created_with_caps) {
#if CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM
        vTaskDeleteWithCaps(NULL);
#else
        vTaskDelete(NULL);
#endif
    } else {
        vTaskDelete(NULL);
    }
}

static bool schedule_tts_reply(const char *reply)
{
    if (!reply || reply[0] == '\0') {
        return false;
    }
    if (g_app.ai_tts_inflight) {
        ESP_LOGW(TAG, "voice: tts already running, skip");
        return false;
    }

    voice_tts_job_t *job = calloc(1, sizeof(*job));
    if (!job) {
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "TTS ERR");
        return false;
    }
    copy_ai_text(job->reply, sizeof(job->reply), reply);

    g_app.ai_tts_inflight = true;
    g_app.tts_task_started_us = esp_timer_get_time();
    copy_string(g_app.ai_state, sizeof(g_app.ai_state), "TTS");
    ui_refresh_now();

    BaseType_t task_ok = pdFAIL;
#if CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM
    job->created_with_caps = true;
    task_ok = xTaskCreateWithCaps(voice_tts_task, "voice_tts",
                                  VOICE_TTS_TASK_STACK_BYTES, job, 4, NULL,
                                  MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
#endif
    if (task_ok != pdPASS) {
        ESP_LOGW(TAG, "voice: psram tts task create failed, trying internal stack");
        job->created_with_caps = false;
        task_ok = xTaskCreate(voice_tts_task, "voice_tts",
                              VOICE_TTS_TASK_FALLBACK_STACK_BYTES, job, 4, NULL);
    }
    if (task_ok != pdPASS) {
        g_app.ai_tts_inflight = false;
        g_app.tts_task_started_us = 0;
        free(job);
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "TTS ERR");
        log_voice_task_heap("tts task create failed");
        ui_refresh_now();
        return false;
    }
    return true;
}

static bool ascii_contains_case_insensitive(const char *text, const char *needle)
{
    if (!text || !needle || needle[0] == '\0') {
        return false;
    }
    size_t needle_len = strlen(needle);
    for (const char *p = text; *p; ++p) {
        size_t i = 0;
        while (i < needle_len && p[i] &&
               tolower((unsigned char)p[i]) == tolower((unsigned char)needle[i])) {
            ++i;
        }
        if (i == needle_len) {
            return true;
        }
    }
    return false;
}

static int market_index_from_voice_text(const char *text)
{
    if (!text || text[0] == '\0') {
        return -1;
    }
    for (int i = 0; i < MARKET_ROW_COUNT; ++i) {
        if (ascii_contains_case_insensitive(text, MARKET_DEFS[i].code)) {
            return i;
        }
    }
    if (strstr(text, "比特币") || strstr(text, "底特币") || strstr(text, "笔特币") ||
        strstr(text, "必特币") || strstr(text, "币特币") || strstr(text, "逼特币") ||
        ascii_contains_case_insensitive(text, "bitcoin")) return 0;
    if (strstr(text, "以太坊") || strstr(text, "以太") || strstr(text, "一太坊") ||
        strstr(text, "以太方") || strstr(text, "以太房") ||
        ascii_contains_case_insensitive(text, "ethereum")) return 1;
    if (strstr(text, "黄金") || strstr(text, "金价")) return 2;
    if (strstr(text, "原油") || strstr(text, "油价")) return 3;
    if (strstr(text, "美元指数")) return 4;
    if (strstr(text, "人民币") || strstr(text, "美元人民币")) return 5;
    if (strstr(text, "欧元")) return 6;
    if (strstr(text, "恐慌") || strstr(text, "波动率")) return 7;
    if (strstr(text, "上证") || strstr(text, "A股") || strstr(text, "沪指")) return 8;
    if (strstr(text, "恒生") || strstr(text, "港股")) return 9;
    if (strstr(text, "日经")) return 10;
    if (strstr(text, "德国") || strstr(text, "德指")) return 11;
    if (strstr(text, "英国") || strstr(text, "富时")) return 12;
    if (strstr(text, "标普") || strstr(text, "美股")) return 13;
    if (strstr(text, "纳指") || strstr(text, "纳斯达克")) return 14;
    return -1;
}

static int market_index_from_asset_code(const char *asset)
{
    if (!asset || asset[0] == '\0') {
        return -1;
    }
    for (int i = 0; i < MARKET_ROW_COUNT; ++i) {
        if (strcasecmp(asset, MARKET_DEFS[i].code) == 0) {
            return i;
        }
    }
    return market_index_from_voice_text(asset);
}

static void execute_gateway_voice_action(const voice_gateway_result_t *result)
{
    (void)result;
    /* Voice mode is pure chat: do not let model/gateway responses operate the watch. */
    return;

    if (!result || result->action[0] == '\0') {
        return;
    }

    ESP_LOGI(TAG, "voice: action=%s asset=%s brightness_delta=%d",
             result->action, result->asset, result->brightness_delta);

    if (strcmp(result->action, "sleep") == 0) {
        set_sleeping(true);
        return;
    }

    wake_screen_for_input();

    if (strcmp(result->action, "brightness") == 0) {
        int next = g_app.cfg.brightness_percent + result->brightness_delta;
        if (next < 5) {
            next = 5;
        } else if (next > 100) {
            next = 100;
        }
        if (next != g_app.cfg.brightness_percent) {
            g_app.cfg.brightness_percent = next;
            restore_display_brightness();
            esp_err_t save_err = config_save(&g_app.cfg);
            if (save_err != ESP_OK) {
                ESP_LOGW(TAG, "voice: save brightness failed: %s", esp_err_to_name(save_err));
            }
        } else {
            restore_display_brightness();
        }
        return;
    }

    if (strcmp(result->action, "refresh_market") == 0) {
        home_market_refresh_async();
        return;
    }

    bool chart_action = strcmp(result->action, "chart") == 0 ||
                        strcmp(result->action, "chart_refresh") == 0;
    if (chart_action) {
        int row_index = market_index_from_asset_code(result->asset);
        if (row_index < 0) {
            row_index = market_index_from_voice_text(result->transcript);
        }
        if (row_index < 0) {
            ESP_LOGW(TAG, "voice: chart action missing valid asset");
            return;
        }

        if (bsp_display_lock(1000)) {
            ui_show_chart(row_index);
            chart_refresh_async(row_index);
            bsp_display_unlock();
        }
        return;
    }

    if (strcmp(result->action, "home") == 0) {
        if (bsp_display_lock(1000)) {
            ui_show_home();
            bsp_display_unlock();
        }
        return;
    }

    if (strcmp(result->action, "ai") == 0) {
        if (bsp_display_lock(1000)) {
            ui_show_ai();
            bsp_display_unlock();
        }
        return;
    }

    ESP_LOGW(TAG, "voice: unknown action=%s", result->action);
}

static bool build_local_voice_reply(const char *text, char *reply_out, size_t reply_len,
                                    bool *refresh_market_out)
{
    (void)text;
    (void)reply_out;
    (void)reply_len;
    (void)refresh_market_out;
    return false;

