akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    if (!text || !reply_out || reply_len == 0) {
        return false;
    }
    if (refresh_market_out) {
        *refresh_market_out = false;
    }
    reply_out[0] = '\0';

    if (strstr(text, "刷新") &&
        (strstr(text, "行情") || strstr(text, "市场") || strstr(text, "价格"))) {
        if (refresh_market_out) {
            *refresh_market_out = true;
        }
        copy_string(reply_out, reply_len, "正在刷新行情，请稍等。");
        return true;
    }

    if (strstr(text, "几点") || strstr(text, "时间")) {
        time_t now = 0;
        struct tm tm_now = {0};
        time(&now);
        localtime_r(&now, &tm_now);
        if (tm_now.tm_year >= 120) {
            snprintf(reply_out, reply_len, "现在 %02d:%02d。", tm_now.tm_hour, tm_now.tm_min);
        } else {
            copy_string(reply_out, reply_len, "时间还没同步好。");
        }
        return true;
    }

    if (strstr(text, "电量") || strstr(text, "电池")) {
        if (g_app.battery_percent >= 0) {
            snprintf(reply_out, reply_len, "电量 %d%%。", g_app.battery_percent);
        } else {
            copy_string(reply_out, reply_len, "暂时读不到电量。");
        }
        return true;
    }

    int market_index = market_index_from_voice_text(text);
    if (market_index >= 0) {
        market_row_t *row = &g_app.market_rows[market_index];
        if (strcmp(row->price, "--") != 0) {
            snprintf(reply_out, reply_len, "%s 现在 %s，涨跌 %s，更新时间 %s。",
                     MARKET_DEFS[market_index].code,
                     row->price,
                     row->change[0] ? row->change : "--",
                     g_app.market_time[0] ? g_app.market_time : "--:--");
        } else {
            if (refresh_market_out) {
                *refresh_market_out = true;
            }
            snprintf(reply_out, reply_len, "%s 暂无行情，我先刷新。",
                     MARKET_DEFS[market_index].code);
        }
        return true;
    }

    return false;
}

static bool ai_task_generation_is_current(uint32_t generation)
{
    return generation != 0 && generation == g_app.ai_task_generation;
}

static void ai_task_set_state_if_current(uint32_t generation, const char *state)
{
    if (ai_task_generation_is_current(generation)) {
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), state);
    }
}

static void ai_task_set_reply_if_current(uint32_t generation, const char *reply)
{
    if (ai_task_generation_is_current(generation)) {
        copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), reply);
    }
}

static void direct_ai_start_task(void *arg)
{
    uintptr_t task_token = (uintptr_t)arg;
    bool created_with_caps = (task_token & 1u) != 0u;
    uint32_t generation = (uint32_t)(task_token >> 1);
    bool lock_taken = false;
    bool refresh_market_after_done = false;
    bool tts_after_done = false;
    binary_buffer_t wav = {0};
    binary_buffer_t gateway_audio = {0};
    voice_gateway_result_t gateway_result = {0};
    char error_text[192] = {0};
    char transcript[192] = {0};
    char reply[512] = {0};
    char deferred_tts_reply[512] = {0};

    if (generation == 0u) {
        generation = g_app.ai_task_generation;
    }
    ESP_LOGI(TAG, "voice: task start");
    ai_task_set_state_if_current(generation, "REC");
    copy_ai_text(g_app.ai_user, sizeof(g_app.ai_user), "");
    ai_task_set_reply_if_current(generation, "请直接说话...");
    ui_refresh_now();

    ESP_LOGI(TAG, "voice: record start");
    esp_err_t err = record_voice_wav(&wav, error_text, sizeof(error_text));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "voice: record failed: %s err=%s",
                 error_text[0] ? error_text : "record failed", esp_err_to_name(err));
        if (err == ESP_ERR_NOT_FOUND) {
            ai_task_set_state_if_current(generation, "READY");
            ai_task_set_reply_if_current(generation,
                                         error_text[0] ? error_text : "没有检测到语音，请再说一遍");
            goto done;
        }
        char display_error[256] = {0};
        snprintf(display_error, sizeof(display_error), "Record: %s",
                 error_text[0] ? error_text : esp_err_to_name(err));
        ai_task_set_state_if_current(generation, "ERROR");
        ai_task_set_reply_if_current(generation, display_error);
        goto done;
    }
    ESP_LOGI(TAG, "voice: record done bytes=%u", (unsigned)wav.len);

    if (g_app.net_lock) {
        if (xSemaphoreTake(g_app.net_lock, pdMS_TO_TICKS(VOICE_NET_LOCK_WAIT_MS)) == pdTRUE) {
            lock_taken = true;
        } else {
            ESP_LOGW(TAG, "voice: network busy timeout");
            ai_task_set_state_if_current(generation, "ERROR");
            ai_task_set_reply_if_current(generation, "网络忙，请再说一遍");
            goto done;
        }
    }

    ai_task_set_state_if_current(generation, "NET");
    ai_task_set_reply_if_current(generation,
                                 g_app.sta_connected ? "已联网，正在上传语音..." : "正在连接 WiFi...");
    ui_refresh_now();
    ESP_LOGI(TAG, "voice: wifi connect");
    err = wifi_sta_connect_once(WIFI_CONNECT_WAIT_MS);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "voice: wifi failed: %s", esp_err_to_name(err));
        char display_error[256] = {0};
        snprintf(display_error, sizeof(display_error), "WiFi: %s", esp_err_to_name(err));
        ai_task_set_state_if_current(generation, "ERROR");
        ai_task_set_reply_if_current(generation, display_error);
        goto done;
    }

    if (lock_taken) {
        xSemaphoreGive(g_app.net_lock);
        lock_taken = false;
    }

    if (api_url_uses_https()) {
        wait_for_clock_once(12000);
    }

#if VOICE_TRY_COMBINED_GATEWAY
    if (api_url_is_local_gateway()) {
        ai_task_set_state_if_current(generation, "VOICE");
        ai_task_set_reply_if_current(generation, "正在识别和回复...");
        ui_refresh_now();
        ESP_LOGI(TAG, "voice: gateway combined start");
        err = perform_gateway_voice_request(wav.data, wav.len, &gateway_result,
                                            error_text, sizeof(error_text));
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "voice: gateway combined done text=%u reply=%u local=%d refresh=%d action=%s asset=%s",
                     (unsigned)strlen(gateway_result.transcript),
                     (unsigned)strlen(gateway_result.reply),
                     gateway_result.local ? 1 : 0,
                     gateway_result.refresh_market ? 1 : 0,
                     gateway_result.action,
                     gateway_result.asset);
            if (ai_task_generation_is_current(generation)) {
                copy_ai_text(g_app.ai_user, sizeof(g_app.ai_user),
                             gateway_result.transcript[0] ? gateway_result.transcript : "(empty)");
                copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), gateway_result.reply);
            }
            refresh_market_after_done = gateway_result.refresh_market;

            ai_task_set_state_if_current(generation, "PLAY");
            if (ai_task_generation_is_current(generation)) {
                g_app.ai_playback_inflight = true;
            }
            ui_refresh_now();
            ESP_LOGI(TAG, "voice: gateway audio fetch start");
            err = fetch_gateway_audio(gateway_result.audio_url, &gateway_audio,
                                      error_text, sizeof(error_text));
            if (err == ESP_OK) {
                ESP_LOGI(TAG, "voice: gateway audio fetch done bytes=%u",
                         (unsigned)gateway_audio.len);
                if (g_app.ai_tts_stop_requested) {
                    ESP_LOGI(TAG, "voice: gateway playback cancelled before play");
                    g_app.ai_playback_inflight = false;
                    ai_task_set_state_if_current(generation, "READY");
                    goto done;
                }
                if (lock_taken) {
                    wifi_sta_disconnect_when_idle();
                    xSemaphoreGive(g_app.net_lock);
                    lock_taken = false;
                }
                ESP_LOGI(TAG, "voice: gateway play start");
                err = play_wav_audio(gateway_audio.data, gateway_audio.len,
                                     error_text, sizeof(error_text));
                g_app.ai_playback_inflight = false;
                if (err == ESP_OK) {
                    ESP_LOGI(TAG, "voice: gateway play done");
                    ai_task_set_state_if_current(generation, "READY");
                    goto done;
                }
                if (g_app.ai_tts_stop_requested) {
                    ESP_LOGI(TAG, "voice: gateway play interrupted by new recording");
                    ai_task_set_state_if_current(generation, "READY");
                    goto done;
                }
                ESP_LOGE(TAG, "voice: gateway play failed: %s err=%s",
                         error_text[0] ? error_text : "play failed", esp_err_to_name(err));
            } else {
                g_app.ai_playback_inflight = false;
                if (g_app.ai_tts_stop_requested) {
                    ESP_LOGI(TAG, "voice: gateway audio fetch interrupted by new recording");
                    ai_task_set_state_if_current(generation, "READY");
                    goto done;
                }
                ESP_LOGW(TAG, "voice: gateway audio fetch failed: %s err=%s",
                         error_text[0] ? error_text : "audio failed", esp_err_to_name(err));
            }

            if (ai_task_generation_is_current(generation) && !schedule_tts_reply(gateway_result.reply)) {
                ai_task_set_state_if_current(generation, "PLAY ERR");
            }
            goto done;
        } else {
            ESP_LOGW(TAG, "voice: gateway combined failed, fallback: %s err=%s",
                     error_text[0] ? error_text : "combined failed", esp_err_to_name(err));
            char gateway_display_error[256] = {0};
            snprintf(gateway_display_error, sizeof(gateway_display_error), "网关错误：%s",
                     error_text[0] ? error_text : esp_err_to_name(err));
            ai_task_set_state_if_current(generation, "ERROR");
            ai_task_set_reply_if_current(generation, gateway_display_error);
            goto done;
        }
    } else {
        ESP_LOGI(TAG, "voice: public API mode, skip combined gateway");
    }
#endif

