akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    copy_string(g_app.ai_state, sizeof(g_app.ai_state), "STT");
    copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), "正在识别...");
    ui_refresh_now();
    ESP_LOGI(TAG, "voice: stt start");
    err = perform_stt_request(wav.data, wav.len, transcript, sizeof(transcript),
                              error_text, sizeof(error_text));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "voice: stt failed: %s err=%s",
                 error_text[0] ? error_text : "stt failed", esp_err_to_name(err));
        if (strstr(error_text, "没有识别到有效语音")) {
            copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
            copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), "没有识别到有效语音，请再说一遍");
            goto done;
        }
        char display_error[256] = {0};
        snprintf(display_error, sizeof(display_error), "STT: %s",
                 error_text[0] ? error_text : esp_err_to_name(err));
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "ERROR");
        copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), display_error);
        goto done;
    }
    ESP_LOGI(TAG, "voice: stt done chars=%u", (unsigned)strlen(transcript));
    if (stt_text_is_empty_or_prompt_hallucination(transcript)) {
        ESP_LOGW(TAG, "voice: stt ignored empty/prompt hallucination");
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
        copy_ai_text(g_app.ai_user, sizeof(g_app.ai_user), "");
        copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), "没有识别到有效语音，请再说一遍");
        goto done;
    }
    copy_ai_text(g_app.ai_user, sizeof(g_app.ai_user), transcript[0] ? transcript : "(empty)");

    bool local_refresh_market = false;
    if (build_local_voice_reply(transcript, reply, sizeof(reply), &local_refresh_market)) {
        ESP_LOGI(TAG, "voice: local command reply");
        copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), reply);
        if (local_refresh_market) {
            refresh_market_after_done = true;
            tts_after_done = true;
            copy_ai_text(deferred_tts_reply, sizeof(deferred_tts_reply), reply);
            copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
        } else if (!schedule_tts_reply(reply)) {
            copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
        }
        goto done;
    }

    copy_string(g_app.ai_state, sizeof(g_app.ai_state), "AI");
    copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), "正在思考...");
    ui_refresh_now();
    ESP_LOGI(TAG, "voice: chat start");
    err = perform_chat_request(transcript, reply, sizeof(reply), error_text, sizeof(error_text));
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "voice: chat failed: %s err=%s",
                 error_text[0] ? error_text : "chat failed", esp_err_to_name(err));
        char display_error[256] = {0};
        snprintf(display_error, sizeof(display_error), "AI: %s",
                 error_text[0] ? error_text : esp_err_to_name(err));
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "ERROR");
        copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), display_error);
        goto done;
    }
    ESP_LOGI(TAG, "voice: chat done chars=%u", (unsigned)strlen(reply));
    copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), reply);
    if (!schedule_tts_reply(reply)) {
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
    }

done:
    binary_buffer_free(&gateway_audio);
    binary_buffer_free(&wav);
    if (lock_taken) {
        wifi_sta_disconnect_when_idle();
        xSemaphoreGive(g_app.net_lock);
    }
    bool current_generation = ai_task_generation_is_current(generation);
    if (current_generation) {
        g_app.ai_playback_inflight = false;
        g_app.ai_start_inflight = false;
        g_app.ai_tts_stop_requested = false;
        g_app.ai_task_started_us = 0;
    }
    bool gateway_action_refreshes_market = strcmp(gateway_result.action, "refresh_market") == 0;
    if (current_generation) {
        execute_gateway_voice_action(&gateway_result);
    }
    if (current_generation && refresh_market_after_done && !gateway_action_refreshes_market) {
        home_market_refresh_async();
    }
    if (current_generation && tts_after_done && deferred_tts_reply[0]) {
        (void)schedule_tts_reply(deferred_tts_reply);
    }
    if (current_generation) {
        ui_refresh_now();
    }
    if (created_with_caps) {
#if CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM
        vTaskDeleteWithCaps(NULL);
#else
        vTaskDelete(NULL);
#endif
    } else {
        vTaskDelete(NULL);
    }
}

static bool direct_ai_start_request(const char *source)
{
    if (g_app.ai_start_inflight) {
        int64_t now_us = esp_timer_get_time();
        bool stale = g_app.ai_task_started_us > 0 &&
                     (now_us - g_app.ai_task_started_us) > ((int64_t)VOICE_STALE_RESET_MS * 1000LL);
        if (stale && !g_app.ai_playback_inflight) {
            ESP_LOGW(TAG, "voice: stale recognition reset before new recording");
            g_app.ai_task_generation++;
            g_app.ai_start_inflight = false;
            g_app.ai_playback_inflight = false;
            g_app.ai_tts_stop_requested = true;
            g_app.ai_task_started_us = 0;
            copy_string(g_app.ai_state, sizeof(g_app.ai_state), "READY");
        } else if (!g_app.ai_playback_inflight) {
            ESP_LOGW(TAG, "voice: start ignored, recognition already running");
            return false;
        } else {
            ESP_LOGI(TAG, "voice: interrupt gateway playback before new recording");
            g_app.ai_tts_stop_requested = true;
            for (int i = 0; i < 60 &&
                 (g_app.ai_playback_inflight || g_app.ai_start_inflight); ++i) {
                vTaskDelay(pdMS_TO_TICKS(50));
            }
            if (g_app.ai_playback_inflight || g_app.ai_start_inflight) {
                ESP_LOGW(TAG, "voice: start ignored, playback did not stop in time");
                return false;
            }
        }
    }
    if (g_app.ai_tts_inflight) {
        ESP_LOGI(TAG, "voice: interrupt tts before new recording");
        g_app.ai_tts_stop_requested = true;
        for (int i = 0; i < 30 && g_app.ai_tts_inflight; ++i) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        if (g_app.ai_tts_inflight) {
            ESP_LOGW(TAG, "voice: start ignored, tts did not stop in time");
            return false;
        }
    }
    ESP_LOGI(TAG, "voice: start requested by %s", source ? source : "unknown");
    wake_screen_for_input();
    if (!api_url_is_local_gateway() && g_app.cfg.api_key[0] == '\0') {
        const ai_profile_t *profile = ai_profile_active();
        ESP_LOGW(TAG, "voice: missing API key for profile %s", profile->name);
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "NO KEY");
        copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply),
                     "这个 AI 档还没配置 API Key。\n请到配置页给当前模型填 key，或先用已经配置好的自定/GPT。");
        if (source && strcmp(source, "ui") == 0) {
            ui_refresh_locked();
        } else if (bsp_display_lock(1000)) {
            ui_show_ai();
            bsp_display_unlock();
        } else {
            ui_refresh_now();
        }
        return false;
    }
    g_app.ai_tts_stop_requested = false;
    g_app.ai_start_inflight = true;
    uint32_t generation = ++g_app.ai_task_generation;
    if (generation == 0) {
        generation = ++g_app.ai_task_generation;
    }
    g_app.ai_task_started_us = esp_timer_get_time();
    copy_string(g_app.ai_state, sizeof(g_app.ai_state), "REC");
    copy_string(g_app.ai_user, sizeof(g_app.ai_user), "");
    copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), "请直接说话...");
    if (source && strcmp(source, "ui") == 0) {
        ui_refresh_locked();
    } else if (bsp_display_lock(1000)) {
        ui_show_ai();
        bsp_display_unlock();
    } else {
        ui_refresh_now();
    }
    BaseType_t task_ok = pdFAIL;
#if CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM
    task_ok = xTaskCreateWithCaps(direct_ai_start_task, "voice_ai",
                                  VOICE_TASK_STACK_BYTES,
                                  (void *)(((uintptr_t)generation << 1) | 1u), 4, NULL,
                                  MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
#endif
    if (task_ok != pdPASS) {
        ESP_LOGW(TAG, "voice: psram task create failed, trying internal stack");
        task_ok = xTaskCreate(direct_ai_start_task, "voice_ai",
                              VOICE_TASK_FALLBACK_STACK_BYTES,
                              (void *)((uintptr_t)generation << 1), 4, NULL);
    }
    if (task_ok != pdPASS) {
        g_app.ai_start_inflight = false;
        g_app.ai_task_started_us = 0;
        copy_string(g_app.ai_state, sizeof(g_app.ai_state), "ERROR");
        copy_ai_text(g_app.ai_reply, sizeof(g_app.ai_reply), "创建语音任务失败");
        if (source && strcmp(source, "ui") == 0) {
            ui_refresh_locked();
        } else {
            ui_refresh_now();
        }
        log_voice_task_heap("task create failed");
        return false;
    }
    return true;
}

static void chart_refresh_task(void *arg)
{
    int row_index = (int)(uintptr_t)arg;
    if (row_index < 0 || row_index >= MARKET_ROW_COUNT) {
        g_app.chart_inflight = false;
        g_app.chart_task_started_us = 0;
        vTaskDelete(NULL);
        return;
    }

