akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    if (g_app.net_lock) {
        xSemaphoreTake(g_app.net_lock, portMAX_DELAY);
    }

    copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "WiFi");
    ui_refresh_now();
    esp_err_t net_err = wifi_sta_connect_once(WIFI_CONNECT_WAIT_MS);
    if (net_err != ESP_OK) {
        copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "NO WIFI");
        g_app.chart_inflight = false;
        g_app.chart_task_started_us = 0;
        wifi_sta_disconnect_when_idle();
        if (g_app.net_lock) {
            xSemaphoreGive(g_app.net_lock);
        }
        ui_refresh_now();
        vTaskDelete(NULL);
        return;
    }

    wait_for_clock_once(12000);

    char *body = http_body_alloc(DIRECT_HTTP_MAX_BODY + 1);
    if (!body) {
        copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "NO MEM");
        g_app.chart_inflight = false;
        g_app.chart_task_started_us = 0;
        wifi_sta_disconnect_when_idle();
        if (g_app.net_lock) {
            xSemaphoreGive(g_app.net_lock);
        }
        ui_refresh_now();
        vTaskDelete(NULL);
        return;
    }

    copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "Loading");
    ui_refresh_now();

    bool parsed = refresh_domestic_market_row(row_index, body, DIRECT_HTTP_MAX_BODY + 1, true);
    if (!parsed) {
        char url[192] = {0};
        snprintf(url, sizeof(url), YAHOO_CHART_URL_FMT, MARKET_DEFS[row_index].chart_symbol);
        esp_err_t err = market_http_request_auto(url, body, DIRECT_HTTP_MAX_BODY + 1);
        parsed = err == ESP_OK && parse_yahoo_chart(body, row_index, true);
    }
    if (parsed) {
        mark_market_time_now();
        g_app.market_polled_once = true;
        snprintf(g_app.market_status, sizeof(g_app.market_status), "OK %s", MARKET_DEFS[row_index].code);
        copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "OK");
        (void)market_cache_save();
    } else {
        copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "FAIL");
        snprintf(g_app.market_status, sizeof(g_app.market_status), "FAIL %s", MARKET_DEFS[row_index].code);
    }

    http_body_free(body);
    g_app.chart_inflight = false;
    g_app.chart_task_started_us = 0;
    wifi_sta_disconnect_when_idle();
    if (g_app.net_lock) {
        xSemaphoreGive(g_app.net_lock);
    }
    ui_refresh_now();
    vTaskDelete(NULL);
}

static void chart_refresh_async(int row_index)
{
    if (row_index < 0 || row_index >= MARKET_ROW_COUNT) {
        return;
    }
    if (g_app.chart_inflight || g_app.ai_start_inflight || g_app.ai_tts_inflight) {
        copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "WAIT");
        ui_refresh_locked();
        return;
    }
    g_app.chart_selected_index = row_index;
    g_app.chart_inflight = true;
    g_app.chart_task_started_us = esp_timer_get_time();
    copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "Starting");
    ui_refresh_locked();
    if (xTaskCreate(chart_refresh_task, "chart_refresh", 12288,
                    (void *)(uintptr_t)row_index, 4, NULL) != pdPASS) {
        g_app.chart_inflight = false;
        g_app.chart_task_started_us = 0;
        copy_string(g_app.chart_hint, sizeof(g_app.chart_hint), "NO TASK");
        ui_refresh_locked();
    }
}

static void html_escape(const char *src, char *dst, size_t dst_size)
{
    size_t j = 0;
    for (size_t i = 0; src && src[i] && j + 1 < dst_size; i++) {
        const char *rep = NULL;
        if (src[i] == '&') {
            rep = "&amp;";
        } else if (src[i] == '<') {
            rep = "&lt;";
        } else if (src[i] == '>') {
            rep = "&gt;";
        } else if (src[i] == '"') {
            rep = "&quot;";
        }
        if (rep) {
            size_t n = strlen(rep);
            if (j + n >= dst_size) {
                break;
            }
            memcpy(&dst[j], rep, n);
            j += n;
        } else {
            dst[j++] = src[i];
        }
    }
    dst[j] = '\0';
}

static int hex_value(char c)
{
    if (c >= '0' && c <= '9') {
        return c - '0';
    }
    if (c >= 'A' && c <= 'F') {
        return c - 'A' + 10;
    }
    if (c >= 'a' && c <= 'f') {
        return c - 'a' + 10;
    }
    return -1;
}

static void url_decode(char *s)
{
    char *w = s;
    for (char *r = s; *r; r++) {
        if (*r == '+') {
            *w++ = ' ';
        } else if (*r == '%' && isxdigit((unsigned char)r[1]) && isxdigit((unsigned char)r[2])) {
            int hi = hex_value(r[1]);
            int lo = hex_value(r[2]);
            *w++ = (char)((hi << 4) | lo);
            r += 2;
        } else {
            *w++ = *r;
        }
    }
    *w = '\0';
}

static void form_get_value(char *body, const char *key, char *out, size_t out_size)
{
    if (!body || !key || !out || out_size == 0) {
        return;
    }
    out[0] = '\0';

    size_t key_len = strlen(key);
    char *p = body;
    while (p && *p) {
        char *next = strchr(p, '&');
        if (next) {
            *next = '\0';
        }
        char *eq = strchr(p, '=');
        if (eq) {
            *eq = '\0';
            if (strlen(p) == key_len && strcmp(p, key) == 0) {
                copy_string(out, out_size, eq + 1);
                url_decode(out);
                if (next) {
                    *next = '&';
                }
                *eq = '=';
                return;
            }
            *eq = '=';
        }
        if (!next) {
            break;
        }
        *next = '&';
        p = next + 1;
    }
}

static bool form_body_has_key(const char *body, const char *key)
{
    if (!body || !key || key[0] == '\0') {
        return false;
    }

    size_t key_len = strlen(key);
    const char *p = body;
    while (p && *p) {
        if (strncmp(p, key, key_len) == 0 && p[key_len] == '=') {
            return true;
        }
        p = strchr(p, '&');
        if (p) {
            p++;
        }
    }
    return false;
}

static esp_err_t httpd_sendf_chunk(httpd_req_t *req, const char *fmt, ...)
{
    char stack_buf[1024];
    va_list ap;
    va_start(ap, fmt);
    int n = vsnprintf(stack_buf, sizeof(stack_buf), fmt, ap);
    va_end(ap);
    if (n < 0) {
        return ESP_FAIL;
    }
    if (n < (int)sizeof(stack_buf)) {
        return httpd_resp_send_chunk(req, stack_buf, n);
    }

    char *heap_buf = malloc((size_t)n + 1u);
    if (!heap_buf) {
        return ESP_ERR_NO_MEM;
    }
    va_start(ap, fmt);
    (void)vsnprintf(heap_buf, (size_t)n + 1u, fmt, ap);
    va_end(ap);
    esp_err_t err = httpd_resp_send_chunk(req, heap_buf, n);
    free(heap_buf);
    return err;
}

static esp_err_t index_get_handler(httpd_req_t *req)
{
    char ssid1[96] = {0};
    char ssid2[96] = {0};
    char ssid3[96] = {0};
    char ssid4[96] = {0};
    char ssid5[96] = {0};
    char slot_ip[WIFI_SLOT_COUNT][32] = {{0}};
    char slot_netmask[WIFI_SLOT_COUNT][32] = {{0}};
    char slot_gateway[WIFI_SLOT_COUNT][32] = {{0}};
    char slot_dns1[WIFI_SLOT_COUNT][32] = {{0}};
    char slot_dns2[WIFI_SLOT_COUNT][32] = {{0}};
    char ai_url[AI_PROFILE_COUNT][224] = {{0}};
    char ai_model[AI_PROFILE_COUNT][96] = {{0}};
    char prompt[256] = {0};
    char market_provider[32] = {0};
    char active_ssid[96] = {0};
    char preferred_ssid[96] = {0};
    html_escape(config_wifi_ssid_const(&g_app.cfg, 0), ssid1, sizeof(ssid1));
    html_escape(config_wifi_ssid_const(&g_app.cfg, 1), ssid2, sizeof(ssid2));
    html_escape(config_wifi_ssid_const(&g_app.cfg, 2), ssid3, sizeof(ssid3));
    html_escape(config_wifi_ssid_const(&g_app.cfg, 3), ssid4, sizeof(ssid4));
    html_escape(config_wifi_ssid_const(&g_app.cfg, 4), ssid5, sizeof(ssid5));
    for (int i = 0; i < AI_PROFILE_COUNT; i++) {
        html_escape(g_app.ai_profiles.profiles[i].server_url,
                    ai_url[i], sizeof(ai_url[i]));
        html_escape(g_app.ai_profiles.profiles[i].model,
                    ai_model[i], sizeof(ai_model[i]));
    }
    html_escape(g_app.cfg.starter_prompt, prompt, sizeof(prompt));
    html_escape(g_app.cfg.market_provider, market_provider, sizeof(market_provider));
    for (int i = 0; i < WIFI_SLOT_COUNT; i++) {
        const wifi_ip_config_t *net = config_wifi_net_const(&g_app.cfg, i);
        if (!net) {
            continue;
        }
        html_escape(net->static_ip, slot_ip[i], sizeof(slot_ip[i]));
        html_escape(net->static_netmask, slot_netmask[i], sizeof(slot_netmask[i]));
        html_escape(net->static_gateway, slot_gateway[i], sizeof(slot_gateway[i]));
        html_escape(net->dns1, slot_dns1[i], sizeof(slot_dns1[i]));
        html_escape(net->dns2, slot_dns2[i], sizeof(slot_dns2[i]));
    }
    int active_slot = wifi_current_connected_slot();
    if (active_slot >= 0 && active_slot < WIFI_SLOT_COUNT) {
        html_escape(config_wifi_ssid_const(&g_app.cfg, active_slot),
                    active_ssid, sizeof(active_ssid));
    }
    if (g_app.preferred_wifi_slot >= 0 && g_app.preferred_wifi_slot < WIFI_SLOT_COUNT) {
        html_escape(config_wifi_ssid_const(&g_app.cfg, g_app.preferred_wifi_slot),
                    preferred_ssid, sizeof(preferred_ssid));
    }

    httpd_resp_set_type(req, "text/html; charset=utf-8");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store");

    esp_err_t err = httpd_resp_sendstr_chunk(req,
        "<!doctype html><html><head><meta charset='utf-8'>"
        "<meta name='viewport' content='width=device-width,initial-scale=1'>"
        "<title>WatchLite WiFi</title><style>"
        "body{margin:0;background:linear-gradient(160deg,#06111f,#102039 56%,#06111f);"
        "color:#eaf1ff;font-family:-apple-system,BlinkMacSystemFont,'Segoe UI',sans-serif}"
        ".wrap{max-width:680px;margin:0 auto;padding:18px}"
        ".card{background:rgba(16,29,46,.92);border:1px solid #263a58;border-radius:22px;padding:18px;margin:14px 0;"
        "box-shadow:0 16px 38px rgba(0,0,0,.22)}"
        "h2{margin:6px 0 14px}h3{margin:6px 0 12px}"
        "label{display:block;margin:13px 0 6px;color:#91a3bf}"
        "input,textarea,select{width:100%;box-sizing:border-box;border:1px solid #314a70;border-radius:14px;"
        "padding:13px;background:#07111f;color:#fff;font-size:16px}"
        "textarea{min-height:74px}button{width:100%;border:0;border-radius:16px;padding:14px;margin-top:14px;"
        "background:#335cff;color:white;font-weight:700;font-size:16px}"
        "button.secondary{background:#223653}.slot{border:1px solid #263a58;border-radius:18px;padding:13px;margin-top:13px;background:#0b1728}"
        ".slotHead{display:flex;gap:10px;align-items:center;justify-content:space-between}.slotHead b{font-size:17px}"
        ".slotHead button{width:auto;margin:0;padding:9px 12px;border-radius:12px;background:#1f8f72;font-size:14px}"
        ".scan{display:grid;gap:9px;margin-top:12px}.net{margin:0;text-align:left;background:#172942;border:1px solid #36537c;"
        "font-weight:650}.muted{color:#91a3bf;font-size:14px;line-height:1.5}.ok{color:#7be0c3}.warn{color:#f7c873}"
        ".pill{display:inline-block;border:1px solid #36537c;border-radius:999px;padding:3px 8px;margin-left:5px;color:#bcd0ee;font-size:12px}"
        "</style></head><body><div class='wrap'><h2>WatchLite WiFi</h2>");
    if (err != ESP_OK) {
        return err;
    }

