akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    err = httpd_sendf_chunk(req,
        "<div class='card muted'>AP <b class='ok'>%s</b> / PASS <b>%s</b><br>"
        "AP 后台: <b>http://192.168.4.1/</b><br>"
        "STA <b>%s</b> %s<br>当前: <b>%s</b> / 默认: <b>%s</b><br>API key: <b>%s</b></div>",
        g_app.ap_ssid, AP_PASSWORD,
        g_app.sta_connected ? "connected" : "not connected",
        g_app.sta_connected ? g_app.sta_ip : "",
        active_ssid[0] ? active_ssid : "-",
        preferred_ssid[0] ? preferred_ssid : "auto",
        g_app.cfg.api_key[0] ? "set" : "not set");
    if (err != ESP_OK) {
        return err;
    }

    err = httpd_resp_sendstr_chunk(req,
        "<form class='card' method='post' action='/save'>"
        "<h3>WiFi</h3>"
        "<p id='wifiNow' class='muted'>扫描附近 WiFi，点一个网络填入下面指定槽位；填密码后保存重启。"
        "已保存的槽位可以直接点 Switch 立即切换。</p>"
        "<label>扫描填入到</label><select id='targetSlot'>");
    if (err != ESP_OK) {
        return err;
    }
    int target_slot = (g_app.preferred_wifi_slot >= 0 && g_app.preferred_wifi_slot < WIFI_SLOT_COUNT) ?
                      g_app.preferred_wifi_slot + 1 : 1;
    for (int i = 1; i <= WIFI_SLOT_COUNT; i++) {
        err = httpd_sendf_chunk(req, "<option value='%d' %s>WiFi %d</option>",
                                i, i == target_slot ? "selected" : "", i);
        if (err != ESP_OK) {
            return err;
        }
    }
    err = httpd_resp_sendstr_chunk(req,
        "</select><button type='button' onclick='scanWifi()'>扫描附近 WiFi</button>"
        "<div id='scanResults' class='scan muted'>还没有扫描。</div>"
        "<label>默认使用</label><select name='preferred_slot'>");
    if (err != ESP_OK) {
        return err;
    }
    err = httpd_sendf_chunk(req, "<option value='0' %s>自动: 按保存顺序</option>",
                            g_app.preferred_wifi_slot < 0 ? "selected" : "");
    if (err != ESP_OK) {
        return err;
    }
    const char *ssid_values[WIFI_SLOT_COUNT] = {ssid1, ssid2, ssid3, ssid4, ssid5};
    for (int i = 0; i < WIFI_SLOT_COUNT; i++) {
        err = httpd_sendf_chunk(req,
            "<option value='%d' %s>WiFi %d%s%s</option>",
            i + 1,
            g_app.preferred_wifi_slot == i ? "selected" : "",
            i + 1,
            ssid_values[i][0] ? ": " : "",
            ssid_values[i][0] ? ssid_values[i] : "");
        if (err != ESP_OK) {
            return err;
        }
    }
    err = httpd_resp_sendstr_chunk(req, "</select>");
    if (err != ESP_OK) {
        return err;
    }

    for (int i = 0; i < WIFI_SLOT_COUNT; i++) {
        err = httpd_sendf_chunk(req,
            "<div class='slot'><div class='slotHead'><b>WiFi %d%s</b>"
            "<button type='button' onclick='switchWifi(%d)'>Switch</button></div>"
            "<label>SSID</label><input name='ssid%d' maxlength='32' value=\"%s\">"
            "<label>Password</label><input name='password%d' maxlength='64' type='password' "
            "placeholder='空着=保留旧密码；换新SSID后空着=无密码'>"
            "<label>Static IP (blank = DHCP)</label><input name='static_ip%d' maxlength='15' value=\"%s\" placeholder='192.168.1.88'>"
            "<label>Netmask</label><input name='static_netmask%d' maxlength='15' value=\"%s\" placeholder='255.255.255.0'>"
            "<label>Gateway</label><input name='static_gateway%d' maxlength='15' value=\"%s\" placeholder='192.168.1.1'>"
            "<label>DNS 1</label><input name='dns1_%d' maxlength='15' value=\"%s\" placeholder='192.168.1.1'>"
            "<label>DNS 2</label><input name='dns2_%d' maxlength='15' value=\"%s\" placeholder='1.1.1.1'></div>",
            i + 1,
            active_slot == i ? " <span class='pill ok'>connected</span>" :
            (g_app.preferred_wifi_slot == i ? " <span class='pill'>default</span>" : ""),
            i + 1,
            i + 1, ssid_values[i],
            i + 1,
            i + 1, slot_ip[i],
            i + 1, slot_netmask[i],
            i + 1, slot_gateway[i],
            i + 1, slot_dns1[i],
            i + 1, slot_dns2[i]);
        if (err != ESP_OK) {
            return err;
        }
    }

    err = httpd_resp_sendstr_chunk(req,
        "<h3>AI</h3>"
        "<label>首页默认 AI</label><select name='ai_profile'>");
    if (err != ESP_OK) {
        return err;
    }
    for (int i = 0; i < AI_PROFILE_COUNT; i++) {
        err = httpd_sendf_chunk(req, "<option value='%d' %s>%s%s</option>",
                                i + 1,
                                g_app.ai_profiles.active_index == i ? "selected" : "",
                                g_app.ai_profiles.profiles[i].name,
                                g_app.ai_profiles.profiles[i].api_key[0] ? " / key set" : "");
        if (err != ESP_OK) {
            return err;
        }
    }
    err = httpd_resp_sendstr_chunk(req, "</select>");
    if (err != ESP_OK) {
        return err;
    }
    for (int i = 0; i < AI_PROFILE_COUNT; i++) {
        err = httpd_sendf_chunk(req,
            "<div class='slot'><div class='slotHead'><b>%s</b><span class='pill'>%s</span></div>"
            "<label>API URL</label><input name='ai_url%d' maxlength='159' value=\"%s\" "
            "placeholder='https://example.com/v1'>"
            "<label>API Key</label><input name='ai_key%d' maxlength='191' type='password' "
            "placeholder='blank = keep old key'>"
            "<label>Model</label><input name='ai_model%d' maxlength='63' value=\"%s\"></div>",
            g_app.ai_profiles.profiles[i].name,
            g_app.ai_profiles.profiles[i].api_key[0] ? "key set" : "no key",
            i + 1, ai_url[i],
            i + 1,
            i + 1, ai_model[i]);
        if (err != ESP_OK) {
            return err;
        }
    }
    err = httpd_sendf_chunk(req,
        "<label>AI Prompt</label><textarea name='starter_prompt' maxlength='159'>%s</textarea>"
        "<label>Market</label><select name='market_provider'>"
        "<option value='coingecko' %s>auto-cn</option><option value='mock' %s>mock</option></select>"
        "<h3>Common</h3>"
        "<p class='muted'>每个 WiFi 的 Static IP/Gateway/DNS 在对应 WiFi 卡片里单独保存；留空就是 DHCP。</p>"
        "<p class='muted'>行情默认直连，BTC/ETH 走 Gate/Huobi/Binance，指数/黄金/原油/外汇走东方财富/新浪；旧版保存过的 Clash 代理会自动清空。</p>"
        "<label>Auto Sleep Seconds</label><input name='sleep' type='number' min='0' max='86400' value='%d'>"
        "<label>Brightness Percent</label><input name='brightness' type='number' min='5' max='100' value='%d'>"
        "<label>Shake Wake</label><select name='motion_wake'>"
        "<option value='1' %s>enabled</option><option value='0' %s>disabled</option></select>"
        "<label>Shake Threshold mg</label><input name='motion_threshold' type='number' min='%d' max='%d' value='%d'>"
        "<button type='submit'>Save and Reboot</button></form>"
        "<div class='card muted warn'>静态 IP/Gateway/DNS 仍按原逻辑保存；WiFi 扫描和 Switch 不需要外网。</div>",
        prompt,
        strcasecmp(market_provider, "coingecko") == 0 ? "selected" : "",
        strcasecmp(market_provider, "mock") == 0 ? "selected" : "",
        g_app.cfg.auto_sleep_s,
        g_app.cfg.brightness_percent,
        g_app.cfg.motion_wake_enabled ? "selected" : "",
        g_app.cfg.motion_wake_enabled ? "" : "selected",
        MIN_MOTION_WAKE_THRESHOLD_MG, MAX_MOTION_WAKE_THRESHOLD_MG,
        g_app.cfg.motion_wake_threshold_mg);
    if (err != ESP_OK) {
        return err;
    }

    err = httpd_resp_sendstr_chunk(req,
        "<script>"
        "const $=s=>document.querySelector(s);"
        "function fillWifi(ssid,secure){const n=$('#targetSlot').value||'1';"
        "$('[name=ssid'+n+']').value=ssid;"
        "$('[name=preferred_slot]').value=n;"
        "const p=$('[name=password'+n+']');"
        "if(secure){p.placeholder='输入这个 WiFi 的密码';p.focus();}else{p.value='';p.placeholder='开放网络，无需密码';}"
        "}"
        "async function scanWifi(){const box=$('#scanResults');box.textContent='扫描中...';"
        "try{const r=await fetch('/api/wifi/scan',{cache:'no-store'});const j=await r.json();"
        "if(!j.ok){box.textContent='扫描失败: '+(j.error||'unknown');return;}"
        "box.innerHTML='';if(!j.networks||!j.networks.length){box.textContent='没有扫到 WiFi';return;}"
        "j.networks.forEach(n=>{const b=document.createElement('button');b.type='button';b.className='net';"
        "b.textContent=n.ssid+'  '+n.rssi+'dBm  '+(n.security||'');b.onclick=()=>fillWifi(n.ssid,n.secure);box.appendChild(b);});"
        "}catch(e){box.textContent='扫描失败: '+e;}}"
        "async function refreshStatus(){try{const r=await fetch('/api/status',{cache:'no-store'});const s=await r.json();"
        "$('#wifiNow').innerHTML='当前: <b>'+(s.active_wifi_ssid||'-')+'</b> '+(s.sta_connected?s.sta_ip:'not connected')+"
        "' / 默认: <b>'+(s.preferred_wifi_ssid||'auto')+'</b>';}"
        "catch(e){}}"
        "async function switchWifi(slot){const box=$('#scanResults');box.textContent='正在切换到 WiFi '+slot+'...';"
        "try{const r=await fetch('/api/wifi/select?slot='+slot,{cache:'no-store'});const j=await r.json();"
        "box.textContent=j.ok?('已开始切换到 WiFi '+slot+'，稍等几秒看状态'):('切换失败: '+(j.error||'unknown'));"
        "if(j.ok){$('[name=preferred_slot]').value=String(slot);setTimeout(refreshStatus,1500);setTimeout(refreshStatus,4500);}}"
        "catch(e){box.textContent='切换失败: '+e;}}"
        "refreshStatus();"
        "</script></div></body></html>");
    if (err != ESP_OK) {
        return err;
    }
    return httpd_resp_send_chunk(req, NULL, 0);
}

static void reboot_task(void *arg)
{
    (void)arg;
    vTaskDelay(pdMS_TO_TICKS(900));
    esp_restart();
}

static void form_update_string(char *body, const char *key, char *dst, size_t dst_size, bool keep_blank)
{
    char *work = malloc(strlen(body) + 1);
    char value[256] = {0};
    if (!work) {
        return;
    }
    strcpy(work, body);
    form_get_value(work, key, value, sizeof(value));
    free(work);
    if (value[0] || !keep_blank) {
        copy_string(dst, dst_size, value);
    }
}

