akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static void form_update_string_if_present(char *body, const char *key, char *dst, size_t dst_size,
                                          bool keep_blank)
{
    if (!form_body_has_key(body, key)) {
        return;
    }
    form_update_string(body, key, dst, dst_size, keep_blank);
}

static esp_err_t save_post_handler(httpd_req_t *req)
{
    if (req->content_len > 12287) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "body too large");
        return ESP_FAIL;
    }

    char *body = calloc(1, req->content_len + 1);
    if (!body) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "no memory");
        return ESP_ERR_NO_MEM;
    }
    int received = 0;
    while (received < req->content_len) {
        int ret = httpd_req_recv(req, body + received, req->content_len - received);
        if (ret <= 0) {
            if (ret == HTTPD_SOCK_ERR_TIMEOUT) {
                continue;
            }
            free(body);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "recv failed");
            return ESP_FAIL;
        }
        received += ret;
    }
    body[received] = '\0';

    watch_lite_config_t next = g_app.cfg;
    ai_profile_store_t next_profiles = g_app.ai_profiles;
    next.magic = CONFIG_MAGIC;
    next.version = CONFIG_VERSION;
    next_profiles.magic = AI_PROFILE_MAGIC;
    next_profiles.version = AI_PROFILE_VERSION;

    char *work = malloc(strlen(body) + 1);
    char value[256] = {0};
    if (!work) {
        free(body);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "no memory");
        return ESP_ERR_NO_MEM;
    }

    for (int i = 0; i < WIFI_SLOT_COUNT; i++) {
        char ssid_key[16] = {0};
        char password_key[16] = {0};
        char static_ip_key[24] = {0};
        char static_netmask_key[24] = {0};
        char static_gateway_key[24] = {0};
        char dns1_key[16] = {0};
        char dns2_key[16] = {0};
        char new_ssid[33] = {0};
        char new_password[65] = {0};
        snprintf(ssid_key, sizeof(ssid_key), "ssid%d", i + 1);
        snprintf(password_key, sizeof(password_key), "password%d", i + 1);
        snprintf(static_ip_key, sizeof(static_ip_key), "static_ip%d", i + 1);
        snprintf(static_netmask_key, sizeof(static_netmask_key), "static_netmask%d", i + 1);
        snprintf(static_gateway_key, sizeof(static_gateway_key), "static_gateway%d", i + 1);
        snprintf(dns1_key, sizeof(dns1_key), "dns1_%d", i + 1);
        snprintf(dns2_key, sizeof(dns2_key), "dns2_%d", i + 1);

        bool ssid_present = form_body_has_key(body, ssid_key);
        bool password_present = form_body_has_key(body, password_key);
        char *ssid_dst = config_wifi_ssid(&next, i);
        char *password_dst = config_wifi_password(&next, i);
        wifi_ip_config_t *net_dst = config_wifi_net(&next, i);
        bool ssid_changed = false;

        if (ssid_present && ssid_dst) {
            strcpy(work, body);
            form_get_value(work, ssid_key, new_ssid, sizeof(new_ssid));
            ssid_changed = strcmp(ssid_dst, new_ssid) != 0;
            copy_string(ssid_dst, 33, new_ssid);
        }

        if (password_present && password_dst) {
            strcpy(work, body);
            form_get_value(work, password_key, new_password, sizeof(new_password));
            if (new_password[0]) {
                copy_string(password_dst, 65, new_password);
            } else if (ssid_changed) {
                password_dst[0] = '\0';
            }
        } else if (ssid_changed && password_dst) {
            password_dst[0] = '\0';
        }

        if (net_dst) {
            form_update_string_if_present(body, static_ip_key, net_dst->static_ip,
                                          sizeof(net_dst->static_ip), false);
            form_update_string_if_present(body, static_netmask_key, net_dst->static_netmask,
                                          sizeof(net_dst->static_netmask), false);
            form_update_string_if_present(body, static_gateway_key, net_dst->static_gateway,
                                          sizeof(net_dst->static_gateway), false);
            form_update_string_if_present(body, dns1_key, net_dst->dns1,
                                          sizeof(net_dst->dns1), false);
            form_update_string_if_present(body, dns2_key, net_dst->dns2,
                                          sizeof(net_dst->dns2), false);
        }
    }
    form_update_string_if_present(body, "ssid", next.wifi_ssid, sizeof(next.wifi_ssid), false);
    form_update_string_if_present(body, "password", next.wifi_password, sizeof(next.wifi_password), true);
    for (int i = 0; i < AI_PROFILE_COUNT; i++) {
        char url_key[16] = {0};
        char api_key_key[16] = {0};
        char model_key[18] = {0};
        snprintf(url_key, sizeof(url_key), "ai_url%d", i + 1);
        snprintf(api_key_key, sizeof(api_key_key), "ai_key%d", i + 1);
        snprintf(model_key, sizeof(model_key), "ai_model%d", i + 1);
        form_update_string_if_present(body, url_key, next_profiles.profiles[i].server_url,
                                      sizeof(next_profiles.profiles[i].server_url), true);
        form_update_string_if_present(body, api_key_key, next_profiles.profiles[i].api_key,
                                      sizeof(next_profiles.profiles[i].api_key), true);
        form_update_string_if_present(body, model_key, next_profiles.profiles[i].model,
                                      sizeof(next_profiles.profiles[i].model), true);
    }
    strcpy(work, body);
    form_get_value(work, "ai_profile", value, sizeof(value));
    if (value[0]) {
        int requested_profile = atoi(value) - 1;
        next_profiles.active_index = (requested_profile >= 0 &&
                                      requested_profile < AI_PROFILE_COUNT) ?
                                     requested_profile : AI_PROFILE_CUSTOM_INDEX;
    }
    ai_profiles_sanitize(&next_profiles);
    const ai_profile_t *active_profile = &next_profiles.profiles[next_profiles.active_index];
    copy_string(next.server_url, sizeof(next.server_url), active_profile->server_url);
    copy_string(next.api_key, sizeof(next.api_key), active_profile->api_key);
    copy_string(next.model, sizeof(next.model), active_profile->model);
    form_update_string_if_present(body, "api_url", next.server_url, sizeof(next.server_url), true);
    form_update_string_if_present(body, "api_key", next.api_key, sizeof(next.api_key), true);
    form_update_string_if_present(body, "model", next.model, sizeof(next.model), true);
    form_update_string(body, "starter_prompt", next.starter_prompt, sizeof(next.starter_prompt), true);
    form_update_string(body, "market_provider", next.market_provider, sizeof(next.market_provider), true);
    form_update_string(body, "static_ip", next.static_ip, sizeof(next.static_ip), false);
    form_update_string(body, "static_netmask", next.static_netmask, sizeof(next.static_netmask), false);
    form_update_string(body, "static_gateway", next.static_gateway, sizeof(next.static_gateway), false);
    form_update_string(body, "dns1", next.dns1, sizeof(next.dns1), false);
    form_update_string(body, "dns2", next.dns2, sizeof(next.dns2), false);
    next.proxy_host[0] = '\0';
    next.proxy_port = 0;
    if (form_body_has_key(body, "static_ip") ||
        form_body_has_key(body, "static_netmask") ||
        form_body_has_key(body, "static_gateway") ||
        form_body_has_key(body, "dns1") ||
        form_body_has_key(body, "dns2")) {
        copy_string(next.wifi_net[0].static_ip, sizeof(next.wifi_net[0].static_ip), next.static_ip);
        copy_string(next.wifi_net[0].static_netmask, sizeof(next.wifi_net[0].static_netmask), next.static_netmask);
        copy_string(next.wifi_net[0].static_gateway, sizeof(next.wifi_net[0].static_gateway), next.static_gateway);
        copy_string(next.wifi_net[0].dns1, sizeof(next.wifi_net[0].dns1), next.dns1);
        copy_string(next.wifi_net[0].dns2, sizeof(next.wifi_net[0].dns2), next.dns2);
    }

    strcpy(work, body);
    form_get_value(work, "sleep", value, sizeof(value));
    if (value[0]) {
        next.auto_sleep_s = atoi(value);
    }

    strcpy(work, body);
    form_get_value(work, "brightness", value, sizeof(value));
    if (value[0]) {
        next.brightness_percent = atoi(value);
    }

    strcpy(work, body);
    form_get_value(work, "motion_wake", value, sizeof(value));
    if (value[0]) {
        next.motion_wake_enabled = atoi(value) ? 1 : 0;
    }

    strcpy(work, body);
    form_get_value(work, "motion_threshold", value, sizeof(value));
    if (value[0]) {
        next.motion_wake_threshold_mg = atoi(value);
    }
    config_sanitize(&next);

    int next_preferred_slot = g_app.preferred_wifi_slot;
    strcpy(work, body);
    form_get_value(work, "preferred_slot", value, sizeof(value));
    if (value[0]) {
        int requested_slot = atoi(value) - 1;
        next_preferred_slot = (requested_slot >= 0 &&
                               requested_slot < WIFI_SLOT_COUNT &&
                               config_wifi_slot_used(&next, requested_slot)) ?
                              requested_slot : -1;
    } else if (next_preferred_slot >= 0 &&
               !config_wifi_slot_used(&next, next_preferred_slot)) {
        next_preferred_slot = -1;
    }
    free(work);

    esp_err_t err = config_save(&next);
    if (err != ESP_OK) {
        free(body);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "save failed");
        return ESP_FAIL;
    }
    err = ai_profiles_save(&next_profiles);
    if (err != ESP_OK) {
        free(body);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "save ai profiles failed");
        return ESP_FAIL;
    }
    err = wifi_preferred_slot_save(next_preferred_slot);
    if (err != ESP_OK) {
        free(body);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "save wifi slot failed");
        return ESP_FAIL;
    }

