akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    g_app.cfg = next;
    g_app.ai_profiles = next_profiles;
    g_app.sta_configured = config_has_wifi(&g_app.cfg);
    g_app.preferred_wifi_slot = next_preferred_slot;
    free(body);
    httpd_resp_set_type(req, "text/html; charset=utf-8");
    httpd_resp_sendstr(req, "<html><body style='font-family:sans-serif;background:#07111f;color:#eaf1ff'>"
                            "<h3>Saved. Watch is rebooting...</h3></body></html>");
    xTaskCreate(reboot_task, "reboot_task", 2048, NULL, 1, NULL);
    return ESP_OK;
}

static esp_err_t status_get_handler(httpd_req_t *req)
{
    char active_ssid[48] = {0};
    char preferred_ssid[48] = {0};
    int active_slot = wifi_current_connected_slot();
    int preferred_slot = g_app.preferred_wifi_slot;
    const wifi_ip_config_t *active_net = config_wifi_net_const(&g_app.cfg, active_slot);
    int ai_elapsed_ms = (g_app.ai_start_inflight && g_app.ai_task_started_us > 0) ?
                        (int)((esp_timer_get_time() - g_app.ai_task_started_us) / 1000LL) : 0;
    if (active_slot >= 0 && active_slot < WIFI_SLOT_COUNT) {
        html_escape(config_wifi_ssid_const(&g_app.cfg, active_slot), active_ssid, sizeof(active_ssid));
    }
    if (preferred_slot >= 0 && preferred_slot < WIFI_SLOT_COUNT) {
        html_escape(config_wifi_ssid_const(&g_app.cfg, preferred_slot), preferred_ssid, sizeof(preferred_ssid));
    }

    char json[1408];
    snprintf(json, sizeof(json),
             "{\"ap_ssid\":\"%s\",\"ap_ip\":\"192.168.4.1\",\"sta_connected\":%s,\"sta_ip\":\"%s\","
             "\"active_wifi_slot\":%d,\"active_wifi_ssid\":\"%s\","
             "\"preferred_wifi_slot\":%d,\"preferred_wifi_ssid\":\"%s\","
             "\"active_static_ip\":\"%s\",\"active_gateway\":\"%s\",\"active_dns1\":\"%s\","
             "\"ai_profile\":\"%s\",\"api_url\":\"%s\",\"api_key_set\":%s,\"model\":\"%s\","
             "\"auto_sleep_s\":%d,\"brightness_percent\":%d,"
             "\"motion_wake_enabled\":%d,\"motion_wake_threshold_mg\":%d,"
             "\"market_polled_once\":%s,\"ai_state\":\"%s\",\"ai_elapsed_ms\":%d,"
             "\"ai_inflight\":%s,\"tts_inflight\":%s}",
             g_app.ap_ssid,
             g_app.sta_connected ? "true" : "false",
             g_app.sta_connected ? g_app.sta_ip : "",
             active_slot >= 0 ? active_slot + 1 : 0,
             active_ssid,
             preferred_slot >= 0 ? preferred_slot + 1 : 0,
             preferred_ssid,
             active_net ? active_net->static_ip : "",
             active_net ? active_net->static_gateway : "",
             active_net ? active_net->dns1 : "",
             ai_profile_active()->name,
             g_app.cfg.server_url,
             g_app.cfg.api_key[0] ? "true" : "false",
             g_app.cfg.model,
             g_app.cfg.auto_sleep_s,
             g_app.cfg.brightness_percent,
             g_app.cfg.motion_wake_enabled,
             g_app.cfg.motion_wake_threshold_mg,
             g_app.market_polled_once ? "true" : "false",
             g_app.ai_state,
             ai_elapsed_ms,
             g_app.ai_start_inflight ? "true" : "false",
             (g_app.ai_tts_inflight || g_app.ai_playback_inflight) ? "true" : "false");
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_sendstr(req, json);
}

static const char *wifi_auth_mode_name(wifi_auth_mode_t authmode)
{
    switch (authmode) {
    case WIFI_AUTH_OPEN:
        return "OPEN";
    case WIFI_AUTH_WEP:
        return "WEP";
    case WIFI_AUTH_WPA_PSK:
        return "WPA";
    case WIFI_AUTH_WPA2_PSK:
        return "WPA2";
    case WIFI_AUTH_WPA_WPA2_PSK:
        return "WPA/WPA2";
    case WIFI_AUTH_WPA3_PSK:
        return "WPA3";
    case WIFI_AUTH_WPA2_WPA3_PSK:
        return "WPA2/WPA3";
    case WIFI_AUTH_WAPI_PSK:
        return "WAPI";
    default:
        return "SECURE";
    }
}

static void wifi_scan_sort_and_dedupe(wifi_ap_record_t *records, uint16_t *count)
{
    if (!records || !count) {
        return;
    }

    for (uint16_t i = 1; i < *count; i++) {
        wifi_ap_record_t key = records[i];
        int j = (int)i - 1;
        while (j >= 0 && records[j].rssi < key.rssi) {
            records[j + 1] = records[j];
            j--;
        }
        records[j + 1] = key;
    }

    uint16_t out = 0;
    for (uint16_t i = 0; i < *count; i++) {
        if (records[i].ssid[0] == '\0') {
            continue;
        }
        bool seen = false;
        for (uint16_t j = 0; j < out; j++) {
            if (strncmp((const char *)records[j].ssid, (const char *)records[i].ssid,
                        sizeof(records[i].ssid)) == 0) {
                seen = true;
                break;
            }
        }
        if (!seen) {
            records[out++] = records[i];
        }
    }
    *count = out;
}

static esp_err_t wifi_ensure_scan_mode(void)
{
    if (!g_app.wifi_started) {
        return ESP_ERR_INVALID_STATE;
    }
    return wifi_enable_config_ap();
}

static esp_err_t wifi_scan_get_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store");

    esp_err_t err = wifi_ensure_scan_mode();
    if (err != ESP_OK) {
        char error_json[96];
        snprintf(error_json, sizeof(error_json),
                 "{\"ok\":false,\"error\":\"%s\"}", esp_err_to_name(err));
        return httpd_resp_sendstr(req, error_json);
    }

    bool lock_taken = false;
    if (g_app.net_lock) {
        if (xSemaphoreTake(g_app.net_lock, pdMS_TO_TICKS(12000)) != pdTRUE) {
            return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"network busy\"}");
        }
        lock_taken = true;
    }

    wifi_scan_config_t scan_config = {
        .ssid = NULL,
        .bssid = NULL,
        .channel = 0,
        .show_hidden = false,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE,
    };
    err = esp_wifi_scan_start(&scan_config, true);

    uint16_t ap_count = 0;
    wifi_ap_record_t records[WIFI_SCAN_MAX_RESULTS] = {0};
    if (err == ESP_OK) {
        (void)esp_wifi_scan_get_ap_num(&ap_count);
        if (ap_count > WIFI_SCAN_MAX_RESULTS) {
            ap_count = WIFI_SCAN_MAX_RESULTS;
        }
        err = esp_wifi_scan_get_ap_records(&ap_count, records);
    }
    if (lock_taken) {
        xSemaphoreGive(g_app.net_lock);
    }

    if (err != ESP_OK) {
        char error_json[96];
        snprintf(error_json, sizeof(error_json),
                 "{\"ok\":false,\"error\":\"%s\"}", esp_err_to_name(err));
        return httpd_resp_sendstr(req, error_json);
    }

