akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    wifi_scan_sort_and_dedupe(records, &ap_count);

    cJSON *root = cJSON_CreateObject();
    cJSON *networks = root ? cJSON_AddArrayToObject(root, "networks") : NULL;
    if (!root || !networks) {
        cJSON_Delete(root);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "no memory");
        return ESP_ERR_NO_MEM;
    }
    cJSON_AddBoolToObject(root, "ok", true);
    cJSON_AddNumberToObject(root, "count", ap_count);
    for (uint16_t i = 0; i < ap_count; i++) {
        cJSON *item = cJSON_CreateObject();
        if (!item) {
            continue;
        }
        cJSON_AddStringToObject(item, "ssid", (const char *)records[i].ssid);
        cJSON_AddNumberToObject(item, "rssi", records[i].rssi);
        cJSON_AddNumberToObject(item, "channel", records[i].primary);
        cJSON_AddNumberToObject(item, "auth", records[i].authmode);
        cJSON_AddBoolToObject(item, "secure", records[i].authmode != WIFI_AUTH_OPEN);
        cJSON_AddStringToObject(item, "security", wifi_auth_mode_name(records[i].authmode));
        cJSON_AddItemToArray(networks, item);
    }

    char *json = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    if (!json) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "no memory");
        return ESP_ERR_NO_MEM;
    }
    esp_err_t send_err = httpd_resp_sendstr(req, json);
    free(json);
    return send_err;
}

static void wifi_select_task(void *arg)
{
    int slot = (int)(intptr_t)arg;
    bool lock_taken = false;
    if (g_app.net_lock) {
        xSemaphoreTake(g_app.net_lock, portMAX_DELAY);
        lock_taken = true;
    }

    g_app.sta_configured = config_has_wifi(&g_app.cfg);
    if (g_app.wifi_started && g_app.sta_configured &&
        slot >= 0 && slot < WIFI_SLOT_COUNT &&
        config_wifi_slot_used(&g_app.cfg, slot)) {
        (void)wifi_enable_config_ap();
        if (wifi_current_connected_slot() != slot) {
            (void)wifi_apply_sta_slot(slot);
            wifi_sta_disconnect_now();
            apply_ip_config_for_slot(slot);
            g_app.sta_connect_requested = true;
            g_app.pending_wifi_slot = slot;
            (void)esp_wifi_connect();
        } else {
            g_app.active_wifi_slot = slot;
        }
    }

    if (lock_taken) {
        xSemaphoreGive(g_app.net_lock);
    }
    ui_refresh_now();
    vTaskDelete(NULL);
}

static esp_err_t wifi_select_get_handler(httpd_req_t *req)
{
    char query[64] = {0};
    char slot_text[16] = {0};
    if (httpd_req_get_url_query_str(req, query, sizeof(query)) != ESP_OK ||
        httpd_query_key_value(query, "slot", slot_text, sizeof(slot_text)) != ESP_OK) {
        httpd_resp_set_type(req, "application/json");
        return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"missing slot\"}");
    }

    int slot = atoi(slot_text) - 1;
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store");
    if (slot < 0 || slot >= WIFI_SLOT_COUNT || !config_wifi_slot_used(&g_app.cfg, slot)) {
        return httpd_resp_sendstr(req, "{\"ok\":false,\"error\":\"invalid slot\"}");
    }

    esp_err_t err = wifi_preferred_slot_save(slot);
    if (err == ESP_OK) {
        g_app.preferred_wifi_slot = slot;
    }
    if (err != ESP_OK) {
        char error_json[96];
        snprintf(error_json, sizeof(error_json),
                 "{\"ok\":false,\"error\":\"%s\"}", esp_err_to_name(err));
        return httpd_resp_sendstr(req, error_json);
    }

    bool already_connected = wifi_current_connected_slot() == slot;
    bool task_started = already_connected;
    if (!already_connected) {
        task_started = xTaskCreate(wifi_select_task, "wifi_select", 4096,
                                   (void *)(intptr_t)slot, 4, NULL) == pdPASS;
    }

    char ssid[80] = {0};
    html_escape(config_wifi_ssid_const(&g_app.cfg, slot), ssid, sizeof(ssid));
    char json[192];
    snprintf(json, sizeof(json),
             "{\"ok\":%s,\"slot\":%d,\"ssid\":\"%s\",\"already_connected\":%s,\"error\":\"%s\"}",
             task_started ? "true" : "false",
             slot + 1,
             ssid,
             already_connected ? "true" : "false",
             task_started ? "" : "no task");
    return httpd_resp_sendstr(req, json);
}

static esp_err_t ui_debug_get_handler(httpd_req_t *req)
{
    char query[128] = {0};
    char screen[32] = {0};
    char row[16] = {0};

    if (httpd_req_get_url_query_str(req, query, sizeof(query)) == ESP_OK) {
        (void)httpd_query_key_value(query, "screen", screen, sizeof(screen));
        (void)httpd_query_key_value(query, "row", row, sizeof(row));
    }

    bool switched = false;
    if (screen[0]) {
        if (!bsp_display_lock(1000)) {
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "display lock failed");
            return ESP_FAIL;
        }

        if (strcmp(screen, "home") == 0) {
            ui_show_home();
            switched = true;
        } else if (strcmp(screen, "ai") == 0) {
            ui_show_ai();
            switched = true;
        } else if (strcmp(screen, "chart") == 0) {
            int row_index = row[0] ? atoi(row) : 0;
            if (row_index < 0) {
                row_index = 0;
            } else if (row_index >= MARKET_ROW_COUNT) {
                row_index = MARKET_ROW_COUNT - 1;
            }
            ui_show_chart(row_index);
            switched = true;
        }
        lv_refr_now(NULL);
        bsp_display_unlock();
    }

    char *ai_dialog = heap_caps_calloc(1, sizeof(g_app.ai_dialog), MALLOC_CAP_8BIT);
    char *ai_reply = heap_caps_calloc(1, sizeof(g_app.ai_reply), MALLOC_CAP_8BIT);
    char *ai_user = heap_caps_calloc(1, sizeof(g_app.ai_user), MALLOC_CAP_8BIT);
    char *json = heap_caps_calloc(1, 2048, MALLOC_CAP_8BIT);
    if (!ai_dialog || !ai_reply || !ai_user || !json) {
        free(ai_dialog);
        free(ai_reply);
        free(ai_user);
        free(json);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "no memory");
        return ESP_ERR_NO_MEM;
    }

