akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    display_safe_text_copy(g_app.ai_dialog, ai_dialog, sizeof(g_app.ai_dialog));
    display_safe_text_copy(g_app.ai_reply, ai_reply, sizeof(g_app.ai_reply));
    display_safe_text_copy(g_app.ai_user, ai_user, sizeof(g_app.ai_user));

    snprintf(json, 2048,
             "{\"ok\":true,\"switched\":%s,\"screen\":\"%s\",\"ai_state\":\"%s\","
             "\"ai_inflight\":%s,\"tts_inflight\":%s,"
             "\"ai_user\":\"%s\",\"ai_reply\":\"%s\",\"ai_dialog\":\"%s\"}",
             switched ? "true" : "false",
             ui_current_screen_name(),
             g_app.ai_state,
             g_app.ai_start_inflight ? "true" : "false",
             (g_app.ai_tts_inflight || g_app.ai_playback_inflight) ? "true" : "false",
             ai_user,
             ai_reply,
             ai_dialog);
    httpd_resp_set_type(req, "application/json");
    esp_err_t err = httpd_resp_sendstr(req, json);
    free(ai_dialog);
    free(ai_reply);
    free(ai_user);
    free(json);
    return err;
}

static esp_err_t screen_bmp_get_handler(httpd_req_t *req)
{
    esp_err_t result = ESP_FAIL;
    lv_draw_buf_t *snap = NULL;
    uint8_t *bmp = NULL;

    if (!bsp_display_lock(2000)) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "display lock failed");
        return ESP_FAIL;
    }

    lv_refr_now(NULL);
    snap = lv_snapshot_take(lv_screen_active(), LV_COLOR_FORMAT_RGB565);
    bsp_display_unlock();

    if (!snap || !snap->data) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "snapshot failed");
        goto done;
    }

    uint32_t width = snap->header.w;
    uint32_t height = snap->header.h;
    uint32_t row_size = ((width * 3u) + 3u) & ~3u;
    uint32_t pixel_bytes = row_size * height;
    uint32_t file_size = 54u + pixel_bytes;

    bmp = heap_caps_malloc(file_size, MALLOC_CAP_8BIT);
    if (!bmp) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "no memory");
        goto done;
    }

    memset(bmp, 0, file_size);
    bmp[0] = 'B';
    bmp[1] = 'M';
    bmp[2] = (uint8_t)(file_size & 0xFFu);
    bmp[3] = (uint8_t)((file_size >> 8) & 0xFFu);
    bmp[4] = (uint8_t)((file_size >> 16) & 0xFFu);
    bmp[5] = (uint8_t)((file_size >> 24) & 0xFFu);
    bmp[10] = 54;
    bmp[14] = 40;
    bmp[18] = (uint8_t)(width & 0xFFu);
    bmp[19] = (uint8_t)((width >> 8) & 0xFFu);
    bmp[20] = (uint8_t)((width >> 16) & 0xFFu);
    bmp[21] = (uint8_t)((width >> 24) & 0xFFu);
    bmp[22] = (uint8_t)(height & 0xFFu);
    bmp[23] = (uint8_t)((height >> 8) & 0xFFu);
    bmp[24] = (uint8_t)((height >> 16) & 0xFFu);
    bmp[25] = (uint8_t)((height >> 24) & 0xFFu);
    bmp[26] = 1;
    bmp[28] = 24;
    bmp[34] = (uint8_t)(pixel_bytes & 0xFFu);
    bmp[35] = (uint8_t)((pixel_bytes >> 8) & 0xFFu);
    bmp[36] = (uint8_t)((pixel_bytes >> 16) & 0xFFu);
    bmp[37] = (uint8_t)((pixel_bytes >> 24) & 0xFFu);

    const uint8_t *src = snap->data;
    for (uint32_t y = 0; y < height; ++y) {
        const uint8_t *src_row = src + (size_t)y * snap->header.stride;
        uint8_t *dst_row = bmp + 54u + (size_t)(height - 1u - y) * row_size;
        for (uint32_t x = 0; x < width; ++x) {
            uint16_t px = ((uint16_t)src_row[x * 2u] << 8) | src_row[x * 2u + 1u];
            uint8_t r5 = (px >> 11) & 0x1Fu;
            uint8_t g6 = (px >> 5) & 0x3Fu;
            uint8_t b5 = px & 0x1Fu;
            dst_row[x * 3u + 2u] = (uint8_t)((r5 * 255u) / 31u);
            dst_row[x * 3u + 1u] = (uint8_t)((g6 * 255u) / 63u);
            dst_row[x * 3u + 0u] = (uint8_t)((b5 * 255u) / 31u);
        }
    }

    httpd_resp_set_type(req, "image/bmp");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store");
    result = httpd_resp_send(req, (const char *)bmp, file_size);

done:
    if (snap) {
        lv_draw_buf_destroy(snap);
    }
    if (bmp) {
        heap_caps_free(bmp);
    }
    return result;
}

static esp_err_t voice_start_handler(httpd_req_t *req)
{
    bool started = direct_ai_start_request("http");
    httpd_resp_set_type(req, "application/json");
    if (started) {
        return httpd_resp_sendstr(req, "{\"ok\":true,\"state\":\"REC\"}");
    }
    return httpd_resp_sendstr(req, "{\"ok\":false,\"state\":\"busy\"}");
}

static esp_err_t http_server_start(void)
{
    if (g_app.httpd) {
        return ESP_OK;
    }
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.lru_purge_enable = true;
    config.stack_size = 16384;

    esp_err_t err = httpd_start(&g_app.httpd, &config);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "HTTP server start failed: %s", esp_err_to_name(err));
        return err;
    }

    httpd_uri_t index_uri = {
        .uri = "/",
        .method = HTTP_GET,
        .handler = index_get_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &index_uri);

    httpd_uri_t save_uri = {
        .uri = "/save",
        .method = HTTP_POST,
        .handler = save_post_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &save_uri);

    httpd_uri_t status_uri = {
        .uri = "/api/status",
        .method = HTTP_GET,
        .handler = status_get_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &status_uri);

    httpd_uri_t wifi_scan_uri = {
        .uri = "/api/wifi/scan",
        .method = HTTP_GET,
        .handler = wifi_scan_get_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &wifi_scan_uri);

    httpd_uri_t wifi_select_uri = {
        .uri = "/api/wifi/select",
        .method = HTTP_GET,
        .handler = wifi_select_get_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &wifi_select_uri);

    httpd_uri_t ui_debug_uri = {
        .uri = "/api/ui",
        .method = HTTP_GET,
        .handler = ui_debug_get_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &ui_debug_uri);

    httpd_uri_t screen_bmp_uri = {
        .uri = "/api/screen.bmp",
        .method = HTTP_GET,
        .handler = screen_bmp_get_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &screen_bmp_uri);

    httpd_uri_t voice_start_get_uri = {
        .uri = "/api/voice/start",
        .method = HTTP_GET,
        .handler = voice_start_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &voice_start_get_uri);

    httpd_uri_t voice_start_post_uri = {
        .uri = "/api/voice/start",
        .method = HTTP_POST,
        .handler = voice_start_handler,
    };
    httpd_register_uri_handler(g_app.httpd, &voice_start_post_uri);
    return ESP_OK;
}

static bool str_to_ip4(const char *src, esp_ip4_addr_t *dst)
{
    return src && src[0] && dst && esp_netif_str_to_ip4(src, dst) == ESP_OK;
}

