akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
static void apply_dns_config_for_slot(int slot)
{
    if (!g_app.sta_netif) {
        return;
    }

    const wifi_ip_config_t *net = config_wifi_net_const(&g_app.cfg, slot);
    if (!net) {
        return;
    }

    esp_netif_dns_info_t dns = {0};
    dns.ip.type = ESP_IPADDR_TYPE_V4;
    if (str_to_ip4(net->dns1, &dns.ip.u_addr.ip4)) {
        (void)esp_netif_set_dns_info(g_app.sta_netif, ESP_NETIF_DNS_MAIN, &dns);
    }
    if (str_to_ip4(net->dns2, &dns.ip.u_addr.ip4)) {
        (void)esp_netif_set_dns_info(g_app.sta_netif, ESP_NETIF_DNS_BACKUP, &dns);
    }
}

static void apply_ip_config_for_slot(int slot)
{
    if (!g_app.sta_netif) {
        return;
    }

    const wifi_ip_config_t *net = config_wifi_net_const(&g_app.cfg, slot);
    if (!net) {
        return;
    }

    esp_netif_ip_info_t ip = {0};
    if (!str_to_ip4(net->static_ip, &ip.ip) ||
        !str_to_ip4(net->static_netmask, &ip.netmask) ||
        !str_to_ip4(net->static_gateway, &ip.gw)) {
        esp_err_t err = esp_netif_dhcpc_start(g_app.sta_netif);
        if (err != ESP_OK && err != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STARTED) {
            ESP_LOGW(TAG, "dhcp start failed: %s", esp_err_to_name(err));
        }
        apply_dns_config_for_slot(slot);
        return;
    }

    esp_err_t err = esp_netif_dhcpc_stop(g_app.sta_netif);
    if (err != ESP_OK && err != ESP_ERR_ESP_NETIF_DHCP_ALREADY_STOPPED) {
        ESP_LOGW(TAG, "dhcp stop failed: %s", esp_err_to_name(err));
    }
    err = esp_netif_set_ip_info(g_app.sta_netif, &ip);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "static ip failed: %s", esp_err_to_name(err));
    }
    apply_dns_config_for_slot(slot);
}

static void configure_timezone_once(void)
{
    static bool timezone_configured;
    if (timezone_configured) {
        return;
    }
    timezone_configured = true;
    setenv("TZ", "CST-8", 1);
    tzset();
}

static void start_sntp_once(void)
{
    if (g_app.sntp_started) {
        return;
    }
    g_app.sntp_started = true;
    configure_timezone_once();
    esp_sntp_setoperatingmode(SNTP_OPMODE_POLL);
    esp_sntp_setservername(0, "ntp.aliyun.com");
#if CONFIG_LWIP_SNTP_MAX_SERVERS > 1
    esp_sntp_setservername(1, "pool.ntp.org");
#endif
#if CONFIG_LWIP_SNTP_MAX_SERVERS > 2
    esp_sntp_setservername(2, "time.cloudflare.com");
#endif
    esp_sntp_init();
}

static int configured_wifi_slot_count(void)
{
    int count = 0;
    for (int i = 0; i < WIFI_SLOT_COUNT; i++) {
        if (config_wifi_slot_used(&g_app.cfg, i)) {
            count++;
        }
    }
    return count;
}

static int wifi_slot_at_try_index(int index)
{
    if (g_app.preferred_wifi_slot >= 0 &&
        g_app.preferred_wifi_slot < WIFI_SLOT_COUNT &&
        config_wifi_slot_used(&g_app.cfg, g_app.preferred_wifi_slot)) {
        if (index == 0) {
            return g_app.preferred_wifi_slot;
        }
        index--;
    }

    for (int slot = 0; slot < WIFI_SLOT_COUNT; slot++) {
        if (slot == g_app.preferred_wifi_slot || !config_wifi_slot_used(&g_app.cfg, slot)) {
            continue;
        }
        if (index == 0) {
            return slot;
        }
        index--;
    }
    return -1;
}

static int wifi_slot_from_ssid(const char *ssid)
{
    if (!ssid || !ssid[0]) {
        return -1;
    }
    for (int slot = 0; slot < WIFI_SLOT_COUNT; slot++) {
        const char *slot_ssid = config_wifi_ssid_const(&g_app.cfg, slot);
        if (slot_ssid && strcmp(slot_ssid, ssid) == 0) {
            return slot;
        }
    }
    return -1;
}

static int wifi_current_connected_slot(void)
{
    if (!g_app.sta_connected) {
        return -1;
    }
    if (g_app.active_wifi_slot >= 0 && g_app.active_wifi_slot < WIFI_SLOT_COUNT) {
        return g_app.active_wifi_slot;
    }

    wifi_ap_record_t ap_info = {0};
    if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
        int slot = wifi_slot_from_ssid((const char *)ap_info.ssid);
        if (slot >= 0) {
            g_app.active_wifi_slot = slot;
            return slot;
        }
    }
    return -1;
}

static esp_err_t wifi_apply_sta_slot(int slot)
{
    const char *ssid = config_wifi_ssid_const(&g_app.cfg, slot);
    const char *password = config_wifi_password_const(&g_app.cfg, slot);
    if (!ssid || ssid[0] == '\0') {
        return ESP_ERR_INVALID_ARG;
    }

    wifi_config_t sta_cfg = {0};
    copy_string((char *)sta_cfg.sta.ssid, sizeof(sta_cfg.sta.ssid), ssid);
    copy_string((char *)sta_cfg.sta.password, sizeof(sta_cfg.sta.password), password);
    sta_cfg.sta.threshold.authmode = password && password[0] ? WIFI_AUTH_WPA2_PSK : WIFI_AUTH_OPEN;
    sta_cfg.sta.scan_method = WIFI_FAST_SCAN;
    sta_cfg.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
    return esp_wifi_set_config(WIFI_IF_STA, &sta_cfg);
}

static esp_err_t wifi_sta_connect_once(int timeout_ms)
{
    if (!g_app.wifi_started || !g_app.sta_configured) {
        return ESP_ERR_INVALID_STATE;
    }
    if (g_app.sta_connected) {
        return ESP_OK;
    }

    int slot_count = configured_wifi_slot_count();
    if (slot_count <= 0) {
        return ESP_ERR_INVALID_STATE;
    }

    int slot_timeout_ms = timeout_ms / slot_count;
    if (slot_timeout_ms < 3000) {
        slot_timeout_ms = 3000;
    }

    esp_err_t last_err = ESP_ERR_TIMEOUT;
    for (int try_index = 0; try_index < slot_count; try_index++) {
        int slot = wifi_slot_at_try_index(try_index);
        if (slot < 0) {
            continue;
        }

        g_app.sta_connect_requested = false;
        (void)esp_wifi_disconnect();
        g_app.sta_connected = false;
        g_app.sta_link_connected = false;
        g_app.sta_disconnect_reason = 0;
        g_app.active_wifi_slot = -1;
        g_app.sta_ip[0] = '\0';
        vTaskDelay(pdMS_TO_TICKS(120));

        apply_ip_config_for_slot(slot);

        esp_err_t err = wifi_apply_sta_slot(slot);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "sta slot %d config failed: %s", slot + 1, esp_err_to_name(err));
            last_err = err;
            continue;
        }

        ESP_LOGI(TAG, "trying WiFi slot %d ssid=%s", slot + 1,
                 config_wifi_ssid_const(&g_app.cfg, slot));
        g_app.sta_connect_requested = true;
        g_app.sta_disconnect_reason = 0;
        g_app.pending_wifi_slot = slot;
        err = esp_wifi_connect();
        if (err != ESP_OK && err != ESP_ERR_WIFI_CONN) {
            g_app.sta_connect_requested = false;
            ESP_LOGW(TAG, "sta slot %d connect start failed: %s", slot + 1, esp_err_to_name(err));
            last_err = err;
            continue;
        }

        int waited_ms = 0;
        int retry_ms = 0;
        while (!g_app.sta_connected && waited_ms < slot_timeout_ms) {
            vTaskDelay(pdMS_TO_TICKS(200));
            waited_ms += 200;
            retry_ms += 200;
            if (!g_app.sta_connected && !g_app.sta_link_connected &&
                g_app.sta_disconnect_reason != 0) {
                ESP_LOGI(TAG, "sta slot %d failed early reason=%u",
                         slot + 1, (unsigned)g_app.sta_disconnect_reason);
                break;
            }
            if (!g_app.sta_connected && !g_app.sta_link_connected &&
                retry_ms >= WIFI_CONNECT_RETRY_MS) {
                retry_ms = 0;
                ESP_LOGI(TAG, "retry WiFi slot %d ssid=%s", slot + 1,
                         config_wifi_ssid_const(&g_app.cfg, slot));
                err = esp_wifi_connect();
                if (err != ESP_OK && err != ESP_ERR_WIFI_CONN) {
                    ESP_LOGW(TAG, "sta slot %d retry failed: %s",
                             slot + 1, esp_err_to_name(err));
                }
            }
        }
        if (g_app.sta_connected) {
            g_app.active_wifi_slot = slot;
            g_app.pending_wifi_slot = -1;
            return ESP_OK;
        }
        last_err = ESP_ERR_TIMEOUT;
    }

