akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
    g_app.sta_connect_requested = false;
    g_app.pending_wifi_slot = -1;
    g_app.active_wifi_slot = -1;
    return g_app.sta_connected ? ESP_OK : last_err;
}

static void wifi_sta_disconnect_now(void)
{
    g_app.sta_connect_requested = false;
    if (g_app.wifi_started && g_app.sta_configured) {
        (void)esp_wifi_disconnect();
    }
    g_app.sta_connected = false;
    g_app.sta_link_connected = false;
    g_app.sta_disconnect_reason = 0;
    g_app.pending_wifi_slot = -1;
    g_app.active_wifi_slot = -1;
    g_app.sta_ip[0] = '\0';
}

static void wifi_sta_disconnect_when_idle(void)
{
    if (VOICE_KEEP_STA_CONNECTED) {
        g_app.sta_connect_requested = false;
        ESP_LOGI(TAG, "wifi: keeping STA connected for voice debug");
        return;
    }
    wifi_sta_disconnect_now();
    (void)wifi_apply_power_save_mode();
}

static esp_err_t wifi_configure_ap(void)
{
    wifi_config_t ap_cfg = {0};
    copy_string((char *)ap_cfg.ap.ssid, sizeof(ap_cfg.ap.ssid), g_app.ap_ssid);
    ap_cfg.ap.ssid_len = strlen(g_app.ap_ssid);
    copy_string((char *)ap_cfg.ap.password, sizeof(ap_cfg.ap.password), AP_PASSWORD);
    ap_cfg.ap.max_connection = 4;
    ap_cfg.ap.authmode = WIFI_AUTH_WPA_WPA2_PSK;

    esp_err_t err = esp_wifi_set_config(WIFI_IF_AP, &ap_cfg);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "ap config failed: %s", esp_err_to_name(err));
    }
    return err;
}

static esp_err_t wifi_apply_power_save_mode(void)
{
    if (!g_app.wifi_started) {
        return ESP_ERR_INVALID_STATE;
    }

    g_app.sta_configured = config_has_wifi(&g_app.cfg);
    wifi_mode_t mode = WIFI_MODE_NULL;
    if (g_app.ap_config_enabled || !g_app.sta_configured) {
        mode = g_app.sta_configured ? WIFI_MODE_APSTA : WIFI_MODE_AP;
    } else {
        mode = WIFI_MODE_STA;
    }

    esp_err_t err = esp_wifi_set_mode(mode);
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "wifi mode: %s config_ap=%d sta_cfg=%d",
                 mode == WIFI_MODE_APSTA ? "APSTA" :
                 mode == WIFI_MODE_AP ? "AP" :
                 mode == WIFI_MODE_STA ? "STA" : "NULL",
                 g_app.ap_config_enabled, g_app.sta_configured);
    }
    return err;
}

static esp_err_t wifi_enable_config_ap(void)
{
    if (!g_app.wifi_started) {
        return ESP_ERR_INVALID_STATE;
    }
    g_app.ap_config_enabled = true;
    esp_err_t err = wifi_apply_power_save_mode();
    if (err == ESP_OK) {
        err = wifi_configure_ap();
    }
    if (err == ESP_OK) {
        (void)http_server_start();
        copy_string(g_app.market_status, sizeof(g_app.market_status), "CFG AP");
    }
    return err;
}

static void wifi_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data)
{
    (void)arg;
    if (base == WIFI_EVENT && id == WIFI_EVENT_STA_START) {
        if (g_app.sta_configured && g_app.sta_connect_requested) {
            esp_wifi_connect();
        }
    } else if (base == WIFI_EVENT && id == WIFI_EVENT_STA_CONNECTED) {
        g_app.sta_link_connected = true;
        g_app.sta_disconnect_reason = 0;
    } else if (base == WIFI_EVENT && id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi_event_sta_disconnected_t *event = (wifi_event_sta_disconnected_t *)data;
        g_app.sta_connected = false;
        g_app.sta_link_connected = false;
        g_app.sta_disconnect_reason = event ? event->reason : 0;
        g_app.active_wifi_slot = -1;
        g_app.sta_ip[0] = '\0';
    } else if (base == WIFI_EVENT && id == WIFI_EVENT_AP_START) {
        g_app.ap_started = true;
    } else if (base == WIFI_EVENT && id == WIFI_EVENT_AP_STOP) {
        g_app.ap_started = false;
    } else if (base == WIFI_EVENT && id == WIFI_EVENT_AP_STACONNECTED) {
        g_app.last_activity_us = esp_timer_get_time();
        set_sleeping(false);
    } else if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)data;
        snprintf(g_app.sta_ip, sizeof(g_app.sta_ip), IPSTR, IP2STR(&event->ip_info.ip));
        g_app.sta_connected = true;
        if (g_app.pending_wifi_slot >= 0 && g_app.pending_wifi_slot < WIFI_SLOT_COUNT) {
            g_app.active_wifi_slot = g_app.pending_wifi_slot;
            g_app.pending_wifi_slot = -1;
        }
        int slot = wifi_current_connected_slot();
        if (slot >= 0) {
            apply_dns_config_for_slot(slot);
        }
        start_sntp_once();
    }
    ui_refresh_now();
}

static esp_err_t wifi_start(void)
{
    WL_RETURN_ON_ERROR(esp_netif_init(), "netif init failed");
    WL_RETURN_ON_ERROR(esp_event_loop_create_default(), "event loop failed");

    g_app.sta_netif = esp_netif_create_default_wifi_sta();
    esp_netif_create_default_wifi_ap();

    wifi_init_config_t init_cfg = WIFI_INIT_CONFIG_DEFAULT();
    WL_RETURN_ON_ERROR(esp_wifi_init(&init_cfg), "wifi init failed");
    WL_RETURN_ON_ERROR(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                                           wifi_event_handler, NULL, NULL),
                       "wifi event failed");
    WL_RETURN_ON_ERROR(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                                           wifi_event_handler, NULL, NULL),
                       "ip event failed");

    g_app.sta_configured = config_has_wifi(&g_app.cfg);
    g_app.ap_config_enabled = !g_app.sta_configured;
    wifi_mode_t mode = g_app.ap_config_enabled ?
                       (g_app.sta_configured ? WIFI_MODE_APSTA : WIFI_MODE_AP) :
                       WIFI_MODE_STA;
    ESP_LOGI(TAG, "wifi start: configured=%d slots=%d preferred=%d mode=%s",
             g_app.sta_configured, configured_wifi_slot_count(),
             g_app.preferred_wifi_slot,
             mode == WIFI_MODE_APSTA ? "APSTA" :
             mode == WIFI_MODE_AP ? "AP" :
             mode == WIFI_MODE_STA ? "STA" : "NULL");
    WL_RETURN_ON_ERROR(esp_wifi_set_mode(mode), "wifi mode failed");

    if (mode == WIFI_MODE_AP || mode == WIFI_MODE_APSTA) {
        WL_RETURN_ON_ERROR(wifi_configure_ap(), "ap config failed");
    }

    if (g_app.sta_configured) {
        int first_slot = wifi_slot_at_try_index(0);
        if (first_slot < 0) {
            for (int slot = 0; slot < WIFI_SLOT_COUNT; slot++) {
                if (config_wifi_slot_used(&g_app.cfg, slot)) {
                    first_slot = slot;
                    break;
                }
            }
        }
        if (first_slot >= 0) {
            ESP_LOGI(TAG, "wifi start: first slot=%d ssid=%s",
                     first_slot + 1, config_wifi_ssid_const(&g_app.cfg, first_slot));
            apply_ip_config_for_slot(first_slot);
            WL_RETURN_ON_ERROR(wifi_apply_sta_slot(first_slot), "sta config failed");
        }
    }

    WL_RETURN_ON_ERROR(esp_wifi_start(), "wifi start failed");
    g_app.wifi_started = true;
    (void)esp_wifi_set_ps(WIFI_PS_MAX_MODEM);
    (void)esp_wifi_set_max_tx_power(32);
    return ESP_OK;
}

