akg5188/esp32-s3-watch-lite/main/minimal_watch_main.c
void app_main(void)
{
    ESP_LOGI(TAG, "Watch Lite direct booting");
    configure_timezone_once();

    gpio_config_t amp_gpio = {
        .pin_bit_mask = 1ULL << BSP_POWER_AMP_IO,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    (void)gpio_config(&amp_gpio);
    gpio_set_level(BSP_POWER_AMP_IO, 0);
    power_button_gpio_prepare_active();
    log_wakeup_reason();

    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ESP_ERROR_CHECK(nvs_flash_init());
    } else {
        ESP_ERROR_CHECK(ret);
    }

    config_load(&g_app.cfg);
    (void)ai_profiles_load(&g_app.ai_profiles, &g_app.cfg);
    ai_profile_apply(g_app.ai_profiles.active_index, false);
    make_ap_ssid();
    app_state_set_defaults();
    log_config_summary();
    (void)market_cache_load();
    g_app.net_lock = xSemaphoreCreateMutex();
    if (!g_app.net_lock) {
        ESP_LOGW(TAG, "network lock unavailable");
    }
    g_app.audio_lock = xSemaphoreCreateMutex();
    if (!g_app.audio_lock) {
        ESP_LOGW(TAG, "audio lock unavailable");
    }
    g_app.last_activity_us = esp_timer_get_time();

    esp_err_t wifi_err = wifi_start();
    if (wifi_err != ESP_OK) {
        ESP_LOGE(TAG, "WiFi failed: %s", esp_err_to_name(wifi_err));
    }
    if (g_app.ap_config_enabled) {
        http_server_start();
    }
    home_market_refresh_async();

    lv_display_t *display = bsp_display_start();
    if (!display) {
        ESP_LOGE(TAG, "Display init failed");
        return;
    }
    (void)display;
    s_ai_text_filter_enabled = true;
    restore_display_brightness();

    if (bsp_display_lock(5000)) {
        ui_create_home();
        ui_create_ai();
        ui_create_chart();
        ui_show_home();
        lv_timer_create(ui_timer_cb, 1000, NULL);
        g_app.ui_ready = true;
        ui_refresh_locked();
        bsp_display_unlock();
    } else {
        ESP_LOGE(TAG, "LVGL lock failed");
        return;
    }

    if (pmic_init() == ESP_OK) {
        battery_update_once();
    }

    motion_task_start_once();
    boot_button_task_start_once();
    ui_refresh_now();

    while (true) {
        vTaskDelay(pdMS_TO_TICKS(5000));
        ESP_LOGI(TAG, "alive sta=%d cfg=%d slots=%d ip=%s ap=%s sleep=%d market=%s",
                 g_app.sta_connected, g_app.sta_configured, configured_wifi_slot_count(),
                 g_app.sta_ip, g_app.ap_ssid, g_app.screen_sleeping, g_app.market_status);
    }
}
